<?
$arrGHIn = array(
	array(60,100,80,60,50,100,50,100,70,70),
	array(100,60,70,70,100,50,100,50,80,70),
	array(60,70,60,70,70,60,80,100,50,100),
	array(100,60,70,60,70,70,60,80,100,50),
	array(50,100,60,70,60,70,70,60,80,100),
	array(100,50,100,60,70,60,70,70,60,80),
	array(80,100,50,100,60,70,60,70,70,60),
	array(60,80,100,50,100,60,70,60,70,70),
	array(70,60,80,100,50,100,60,70,60,70),
	array(70,80,100,50,100,50,60,80,100,60)
);

$arrGHInText = array(
	array("크게 좋지도 나쁘지도 않는 평범한 궁합이라고 하겠습니다. 따라서 두 사람의 노력여하에 따라 행과 불행이 결정된다는 것을 명심 하십시오. 남성도 목(木)이고 여성도 목(木)이어서, 두 사람의 음양과 오행이 모두 같습니다. 그러나 남녀가 같다고 해서 좋은 게 아니며, 강약과 완급의 조화가 없으므로 오히려 서로 양보하려는 마음이 없고 고집을 세우게 되기 쉽습니다. 그러므로 무엇보다도 서로를 이해하고 베푸는 마음이 필요하겠습니다.

구체적으로 이 남성은 부지런하고 성실하고 과욕 없이 충실하게 살아가는 사람이어서 투기나 무모한 일은 하지 않습니다. 그러나 일단 신념이 서면 과감하게 밀고 나가는 사람입니다. 일에서 뿐만 아니라 이성을 대함에 있어서도 처음 만남 사람에 대한 애착이 강하나, 단, 낭만적인 것과는 거리가 멀고 멋과 테크닉이 부족하여 이런 점까지 요구하는 여성에게는 좀 재미없다는 생각이 들 것입니다. 
그러므로 인생을 화려하게 멋지게 살고 싶다고 생각하는 여성과는 어울리지 않습니다. 그러나 멋이나 낭만보다는 현실적인 안정과 신뢰, 신경쓰지 않고 살고 싶다는 여성에게는 최상의 배우자감  이라고 하겠습니다.

반면 이 여성은 명랑하고 활발하며 외향적이고 생활력이 매우 강합니다. 그래서 본래 남에게 위축되지 않는 성격으로 부끄럼을 타지 않으며, 이해심이 많으나 반면, 자존심과 자부심이 무척 강하여 결혼해서 설사 남편이 바람을 피우거나 무관심하게 대해도 드러내 놓고 질투를 하거나 투정을 부리지는 않습니다. 아니 겁내지 않는다는 표현이 맞습니다. 즉 '나 혼자도 잘 살 수 있다'는 자신감이 있기 때문입니다. 
그렇다고 가정에서 남편을 무시하거나 하지 않으며, 단 애정의 포로가 되어 울고불고하지 않으며, 바람을 피우지도 않습니다. 또한 검소하게 살면서 한푼 두푼 저축하는 사람이므로 의존적이고 낭비벽이 있거나 결단력이 부족한 남성의 아내로 좋습니다. ",
"그런대로 좋은 결합이 될 수 있겠습니다, 남성과 여성이 같은 목(木)으로 오행은 같지만 음양이 다릅니다. 즉 남성은 양이며, 여성은 음으로서 본래의 조화를 이루기 때문에 인연을 맺는다면 여성 쪽에서 양보하고 순종하는 부부관계가 이루어질 것입니다. 설사 서로의 생각이 다르다고 해도 같은 목적을 위해서 합심하고 협력할 것이기 때문입니다. 

구체적으로 이 남성은 부지런하고 성실하게 과욕 없이 충실하게 살아가는 사람이어서 투기 나 무모한 일은 하지 않습니다. 그러나 일단 신념이 서면 과감하게 밀고 나가는 사람입니다. 일에서 뿐만 아니라 이성을 대함에 있어서도 처음 만남 사람에 대한 애착이 강하나, 단, 낭만적인 것과는 거리가 멀고 멋과 테크닉이 부족하여 이런점까지 요구하는 여성에게는 좀 재미없다는 생각이 들 것입니다. 그러므로 인생을 화려하게 멋지게 살고 싶다고 생각하는 여성과는 어울리지 않습니다. 그러나 멋이나 낭만보다는 현실적인 안정과 신뢰, 신경 쓰지 않고 살고 싶다는 여성에게는 최상의 배우자감이라고 하겠습니다.

반면, 이 여성은 현모양처의 표상으로, 누구라도 이 여성을 아내로 맞이한다면 행복한 남 성이라 해도 지나친 말이 아닐 것입니다. 활발하고 명랑하면서도 버릇없거나 거칠지 않고, 얌전하면서도 꽁하거나 고집스러운 타입이 아닙니다. 오히려 너무 여성적이고 평범하기에 개성이 없는 것 같으나 그 자체가 바로 이 여성의 장점이며, 튀는 매력은 없어도 싫증이 나지 않는 사람입니다. 또한 살림살이를 운영함에 있어서, 쓸 때는 쓰면서도, 아낄 때는 아끼고, 즉, 낭비를 하거나 인색하지도 않으며, 가정 주부로서의 사명을 다합니다. 결코 분위기에 휩싸여 시간을 망각하는 일도 없으며, 배우자가 커다란 실수를 하여도, 자신의 잘못을 솔직하게 시인하고 용서를 빈다면 스스럼없이 용서해 줄 그런 여인입니다. 결론적으로 이 여성은 아내로서 엄마로서의 도리를 다할 수 있는 바탕이 되어있는 이상적인 주부라고 하겠습니다.",
"서로 대립할 가능성도 보이나 심각하게 대립하지는 않겠습니다. 
두 사람의 결합은 남성은 목(木)이요, 여성은 화(火)로서 오행적으로 보면 서로 보완해 주 는 상생궁합 이므로 좋으나, 두 사람 모두 음양이 양과 양끼리 만났으므로 사소한 일로 다투거나 고집을 피울 수 있으며, 아기자기한 맛은 없습니다. 그러나 여성 편에서 조금 양보하고 이끌어 나가면 무난한 가정 생활을 영위할 수 있습니다. 
 
구체적으로 이 남성은 부지런하고 성실하게 과욕 없이 충실하게 살아가는 사람이어서 투기나 무모한 일은 하지 않습니다. 그러나 일단 신념이 서면 과감하게 밀고 나가는 사람입니다. 
일에서 뿐만 아니라 이성을 대함에 있어서도 처음 만남 사람에 대한 애착이 강하나, 단, 낭만적인 것과는 거리가 멀고 멋과 테크닉이 부족하여 이런점까지 요구하는 여성에게는 좀 재미없다는 생각이 들 것입니다. 
그러므로 인생을 화려하게 멋지게 살고 싶다고 생각하는 여성과는 어울리지 않습니다. 그러나 멋이나 낭만보다는 현실적인 안정과 신뢰, 신경 쓰지 않고 살고 싶다는 여성에게는 최상의 배우자감이라고 하겠습니다. 
 
반면, 이 여성의 외형은 세련미가 있으나, 다소 건방져 보이기도 하고 신경질적이며 까다롭게 보이나, 내면은 겁이 많고 연약하며 순진한 면이 있습니다. 
따라서 일단 연애를 하거나 아내로 맞이하면 하루가 다르게 새로운 매력에 이끌리게 될 것입니다. 
솔직하고 명랑하며, 애교로서 남편의 마음을 사로잡을 것이며, 살림을 알뜰하게 꾸려 나가고 남편의 사 업이나 출세에 적극적인 협력자가 되어 줄 것입니다. 
또한 이 여성은 마음에 드는 남성이 발견되면 먼저 용감하게 사랑을 고백하는 대담성도 있으나, 우물쭈물 시간만 끄는 남성은 흥미가 없어 합니다. 
즉, 남성이 적극적으로 과감하게 프로포즈해 주기를 바라는 한편, 로맨틱한 감상은 좋아하지 않는 형으로 달콤한 애정 표현이나 유혹 따위에는 넘어가질 않습니다. 
그리고 연애와 결혼은 다르다는 생각을 갖고 있으므로, 연애 상대자로서의 남성은 잘 생기고, 세련된 남성을 선택하나, 결혼 상대자는 경제력이 있거나 사회적으로 어느 정도 위치에 있어야만 마음이 움직이게 됩니다. 
그러나 화목한 가정을 가꾸려면 경제력 보다는 원만한 성격의 남성을 만나야 합니다. 결론적으로 이 여 성은 평생을 함께 살아도 싫증이 나지 않을 만큼 귀여운 아내감 입니다.",
"두 사람의 결합은 평범이상의 좋은 궁합입니다. 음과 양이 만나 조화가 되었으며, 남성(木)은 목이고 여성은 화(火)이므로 오행면에서도 서로 상생관계 입니다. 설사 남성이 고집스럽고 꽁한 성격이 강하다고 해도 여성이 친절하고 사근사근한 성격이므로 잘 이끌어나갈 것 입니다.
 
구체적으로 이 남성은 부지런하고 성실하게 과욕 없이 충실하게 살아가는 사람이어서 투기나 무모한 일은 하지 않습니다. 그러나 일단 신념이 서면 과감하게 밀고 나가는 사람입니다.
일에서 뿐만 아니라 이성을 대함에 있어서도 처음 만남 사람에 대한 애착이 강하나, 단, 낭만적인 것과는 거리가 멀고 멋과 테크닉이 부족하여 이런 점까지 요구하는 여성에게는 좀 재미없다는 생각이 들 것입니다. 그러므로 인생을 화려하게 멋지게 살고 싶다고 생각하는 여성과는 어울리지 않습니다. 그러나 멋이나 낭만보다는 현실적인 안정과 신뢰, 신경 쓰지 않고 살고 싶다는 여성에게는 최상의 배우자감이라고 하겠습니다.
 
반면, 이 여성은 활발하고 외향적이면서 인정이 많습니다. 또 좋고 싫은 것이 분명해서, 누구든 한 번 좋아하면 가식 없이 따르고, 한 번 미워하면 노골적으로 싫은 것을 나타냅니다.
그리고 마음이 약해서 남의 어려운 청을 거절하지 못하며, 미혼시절에 별로 좋아하지 않는 남성에게 차마 냉정하게 대하지 못하는 약점 때문에 당하지 않아도 될 곤욕을 당하거나, 심지어는 끈질긴 구애를 거절하지 못해 결혼까지 하게 될 수도 있습니다. 따라서 이 점에 주의해야 평생 동안 후회가 없을 것입니다.

반면 결혼해서는 생활력이 강하여 남편 일을 잘 거들고 맞벌이도 주저하지 않습니다. 이 여성을 배우자로 맞이했거나 하려는 남성은 상대의 자존심을 상하게 하는 말을 해서는 안되며, 진심어린 애정의 표시를 하십시오. 그것이 전달된다면 아내는 남편을 위해 어떤 일도 불사할 수 있는 아름다운 성격의 소유자입니다.",
"두 사람의 결합은 뜨거운 애정보다는 의리로 살아가는 부부관계가 될 것입니다. 남성과 여성의 배합에서 남녀 위계는 되어있으나 음과 양의 결합이 아닌 양과 양의 결합으로서 즉 정배합(正配合)이 아닌 반배합 입니다. 그리고 만약 여성이 외동딸이거나 막내로서 제멋대로 자란 경우라면 남편은 아내의 기를 누그러뜨리고 살아가야 할 것입니다. 그러나 다투기는 해도 운명적으로 나쁜 관계는 아닙니다.

구체적으로 이 남성은 부지런하고 성실하게 과욕 없이 충실하게 살아가는 사람이어서 투기나 무모한 일은 하지 않습니다. 그러나 일단 신념이 서면 과감하게 밀고 나가는 사람입니다. 일에서 뿐만 아니라 이성을 대함에 있어서도 처음 만남 사람에 대한 애착이 강하나, 단, 낭만적인 것과는 거리가 멀고 멋과 테크닉이 부족하여 이런점까지 요구하는 여성에게는 좀 재미없다는 생각이 들 것입니다.
그러므로 인생을 화려하게 멋지게 살고 싶다고 생각하는 여성과는 어울리지 않습니다. 그러나 멋이나 낭만보다는 현실적인 안정과 신뢰, 신경 쓰지 않고 살고 싶다는 여성에게는 최상의 배우자감이라고 하겠습니다.

반면, 이 여성은 똑똑하고 대담하며 노련한 여장부격인 사람으로, 부드럽고 애교스럽거나 야한 맛을 풍기지는 않으나 세련되고 침착하며, 개성이 강해서 분위기에 잘 말려들지 않고 남의 꼬임에도 넘어가지 않습니다. 그래서 남성이 유혹하기에 가장 힘들고 다루기 어려운 타입의 여성형입니다. 
그러나 좋아하는 사람에게는 깊은 애정을 쏟으며, 설사 금전적으로 손해를 보더라도 애정을 쏟기도 합니다. 이처럼 애정면에서 적극적이어서 누가 먼저 프로포즈하건 사귐이 빠르게 진행되며, 시일을 기다리면서 이것저것 재지 않고 즉흥적인 판단을 내립니다.

반면 좋아하는 남성상은 강한 남성미 보다는, 곱고 단아하면서도 유약해 보이는 남성을 좋아하며, 정조 그 자체를 대단하게 여기지는 않으나 고고하고 도도한 성격 탓에 함부로 몸을 허락하는 행동을 하지는 않습니다. 남편은 사회적, 경제적으로 상당한 위치에 있는 남성이라야 이 여성을 이끌 수 있으며, 아니면 차라리 여성이 주도권을 쥐고 남편이 아내의 의견에 따라가는 부부관계가 형성되어야 집안이 평안할 것입니다.",
"두 사람의 배합은 매우 이상적인 결합이라 할 수 있습니다. 즉, 남녀의 음양에서 양인 납성과 음인 여성의 결합이며, 남녀의 위계(位階)가 바로된 정배합이어서, 다소 성격 차이가 있을지라도 천생연분이라고 할 수 있으며, 운명적으로도 좋은 운입니다.

구체적으로 이 남성은 부지런하고 성실하게 과욕 없이 충실하게 살아가는 사람이어서 투기나 무모한 일은 하지 않습니다. 
그러나 일단 신념이 서면 과감하게 밀고 나가는 사람입니다. 일에서 뿐만 아니라 이성을 대함에 있어서도 처음 만남 사람에 대한 애착이 강하나, 단, 낭만적인 것과는 거리가 멀고 멋과 테크닉이 부족하여 이런 점까지 요구하는 여성에게는 좀 재미없다는 생각이 들 것입니다. 
그러므로 인생을 화려하게 멋지게 살고 싶다고 생각하는 여성과는 어울리지 않습니다. 그러나 멋이나 낭만보다는 현실적인 안정과 신뢰, 신경 쓰지 않고 살고 싶다는 여성에게는 최상의 배우자감이라고 하겠습니다. 

반면, 이 여성은 총명하고 약고 깜짝하며, 다소 신경질적이나 재치가 번득이는 사람입니다, 또한 보수적인 면이 있으면서도, 현대적인 것도 취하고, 가정적이어서 알뜰하고 절약성이 강한 주부상으로 조금도 흠이 없습니다, 단, 남편에게 정도 이상으로 간섭하는 경향이 있으나, 명분상 남편의 위신을 세워 주며, 타인이 그것을 느낄 수 있도록 정성을 기울입니다. 그리고 사람을 대할 때 앞에서는 그를 추켜 주고 비위를 맞추나 진심이 아닌 경우가 많습니다. 
즉, 자신에게 유리한 사람에게는 자세도 낮추고 겸손하여 상대의 호감을 사려고 노력하지만 그렇지 않으면 사귀지 않습니다. 이러한 이해타산은 생활을 하면서도 나타나 궁해도 궁한 체하지 않고 과시하기를 좋아하며, 명예나 이익 관리에 지혜로울 정도로 처신합니다. 따라서 이 여성을 아내로 맞이한다면, 아내의 재치와 순발력, 총명한 두뇌를 잘 수용하고 결점을 잘 타일러 간다면 최상의 반려자가 될 것입니다.",
"그리 좋은 결합이 아니며, 좋지 못한 상대끼리 만난 것이라고 할 수 있습니다. 즉, 남성과 여성이 양과 양으로 음양이 치우친대다 남녀 위계가 거꾸로 되어있기 때문으로, 아내의 극성에 남편이 피곤할 수 있습니다. 단, 무난하게 부부생활을 꾸려가려면 반드시 여성이 주도권을 쥐고 남편이 따라가야 할 것이며, 그래야 가정의 화목이 유지될 수 있습니다.

구체적으로 이 남성은 부지런하고 성실하게 과욕 없이 충실하게 살아가는 사람이어서 투기나 무모한 일은 하지 않습니다. 그러나 일단 신념이 서면 과감하게 밀고 나가는 사람입니다. 일에서 뿐만 아니라 이성을 대함에 있어서도 처음 만남 사람에 대한 애착이 강하나, 단, 낭만적인 것과는 거리가 멀고 멋과 테크닉이 부족하여 이런 점까지 요구하는 여성에게는 좀 재미없다는 생각이 들 것입니다.
그러므로 인생을 화려하게 멋지게 살고 싶다고 생각하는 여성과는 어울리지 않습니다. 그러나 멋이나 낭만보다는 현실적인 안정과 신뢰, 신경 쓰지 않고 살고 싶다는 여성에게는 최상의 배우자감이라고 하겠습니다.

반면, 이 여성은 성격이 강하고 솔직하며, 개성이 있고 생활력이 강합니다. 특히 분위기에 흔들리지 않고 감언이설에 잘 넘어가지 않으며, 명분을 좋아해서 명분 없는 일은 설사 유혹에 이끌릴지라도 절대 행하지 않습니다. 그리고 개방적이며 이상보다 현실에 충실하고 시대의 흐름에 민감합니다. 반면 바람기가 있는 것 같으면서도 방종하지 않고, 사치와 허영에 빠지지 않으며, 자기 관리에 철저하여 감정에 치우쳐 과오를 범하지 않으며, 정조관념도 강합니다. 결혼해서는 혹 남편이 잘못하면 그것을 눈감아 주지 않고 트집잡고, 바가지도 잘 긁어대며, 남편의 바람기를 용납하지 않습니다. 
따라서 웬만한 남성은 이 여성에게 쩔쩔매게 되고, 남편을 공처가로 만들기 쉽습니다. 그러나 이해심은 남성 못지 않아서 금세 풀어지며, 가정을 위해 최대한의 노력을 아끼지않을 믿음직스러운 아내의 상입니다. ",
"크게 나쁘지도, 그렇다고 해서 크게 좋지도 않은 결합입니다.
오행적으로 금(金)인 여성이 목(木)인 남성을 만났으므로 남녀 위계가 바뀐 결합이나 음과 양이 조화되었으므로 크게 나쁘지는 않습니다. 단, 남성 편에서 많은 양보가 있어야 할 것이며, 이미 결혼을 해서 부부관계가 이루어졌다면 그렇게 되었을 것입니다. 또한, 남 보기에는 두 사람을 두고, 여성이 주도권을 잡았느니, 남편이 아내한테 쥐어 지낸다는 평을 들을지 몰라도 납성은 별로 불쾌하지 않고 자기를 이끌어 나가는 아내가 오히려 사랑스러울 것입니다. 그리고 남편은 모든 일에 있어서 아내의 결재가 있어야만 된다는 점을 알아두시면 가정생활이 원만하겠습니다.
 
구체적으로 이 남성은 부지런하고 성실하게 과욕 없이 충실하게 살아가는 사람이어서 투기나 무모한 일은 하지 않습니다. 그러나 일단 신념이 서면 과감하게 밀고 나가는 사람입니다.
일에서 뿐만 아니라 이성을 대함에 있어서도 처음 만남 사람에 대한 애착이 강하나, 단, 낭만적인 것과는 거리가 멀고 멋과 테크닉이 부족하여 이런점까지 요구하는 여성에게는 좀 재미없다는 생각이 들 것입니다. 그러므로 인생을 화려하게 멋지게 살고 싶다고 생각하는 여성과는 어울리지 않습니다. 그러나 멋이나 낭만보다는 현실적인 안정과 신뢰, 신경 쓰지 않고 살고 싶다는 여성에게는 최상의 배우자감이라고 하겠습니다.
 
반면, 이 여성은 약고 재치가 있으며 친절하면서도 남성 못지 않은 이해심과 아량으로 때로는 좋은 일을 위해서 다소의 손해도 불사합니다.
그리고 특별한 용모를 갖추지 않았더라도 사람을 끄는 매력이 있어 아무리 수수한 차림새라도 야해 보이고 바람기가 있어 보이며, 부담감이 없게 느껴지는 여성이어서 남성들의 유혹을 많이 받게 됩니다.
가정을 아름답게 꾸미는 데 취미와 소질이 있고, 평범한 삶보다 이상적인 생활환경, 삶의 멋을 추구하는 타입이어서 세상의 이목이나 경제적 구애가 없다고 가정할 때 이 여성은 멋진 연애를 하고 싶고, 결혼 후에도 가장 호화롭고 사치스러운 삶을 영위하고자 할 것입니다. 그리고 서비스가 만점이라서 남편한테 베푸는 애정과 서비스는 그 누구도 따라오지 못합니다.
좋아하는 남성상은 의젓하고 개성 있고 주관이 뚜렷한 남성을 좋아하며, 자신이 남성을 지배하기를 원하지 않으며, 남편으로 섬기고 싶어합니다. 그렇지 않으면 소위 제비족인 남성에게 유혹당할 우려가 있습니다.",
"오행면에서 수(水)인 여성이 목(木)인 남성을 생하는 상생관계로 좋습니다. 그러나 양인 남성과 양인 여성이 만났으므로 음양의 배합이 조화되지 못한 게 흠이라고 하겠습니다. 
즉, 오행은 상생이라 운명상의 작용은 나쁘지 않으나 멋이 없는 남편과 멋을 좋아하는 여성의 만남으로 성격 차이가 심하니 서로가 반씩 양보하며 지성적인 남성이라면 매우 이상적인 생황환경을 이룰 수도 있습니다. 어쨌든 여성은 아내로서의 본분을 다하기에 절대 극단적인 가정불화는 일어나지 않을 것입니다. 

구체적으로 이 남성은 부지런하고 성실하게 과욕 없이 충실하게 살아가는 사람이어서 투기나 무모한 일은 하지 않습니다.그러나 일단 신념이 서면 과감하게 밀고 나가는 사람입니다. 
일에서 뿐만 아니라 이성을 대함에 있어서도 처음 만남 사람에 대한 애착이 강하나, 단, 낭만적인 것과는 거리가 멀고 멋과 테크닉이 부족하여 이런점까지 요구하는 여성에게는 좀 재미없다는 생각이 들 것입니다. 그러므로 인생을 화려하게 멋지게 살고 싶다고 생각하는 여성과는 어울리지 않습니다. 그러나 멋이나 낭만보다는 현실적인 안정과 신뢰, 신경 쓰지 않고 살고 싶다는 여성에게는 최상의 배우자감이라고 하겠습니다.

반면, 이 여성은 명랑하고 활발하며 부끄러움을 타지 않고 시원스럽습니다. 
또한 성깔도 있고 억센 듯하지만 여성이 갖추어야 할 애교와 매력도 있습니다. 즉, 여성이면서도 배짱이 있고 폭 넓은 아량과 남을 위해 봉사하고 이해하는데 인색하지 않으며, 웬만한 일은 스스로 해결하며 무슨 일에나 태도가 분명합니다. 혹 낭만적인 면이 있어 기분에 따라서 씀씀이가 크지만 계획 없는 낭비는 하지 않으며 써야 할 일이면 손이 크다는 평을 들을 만큼 멋지게 쓰는 타입입니다. 만일 이 여성에게 경제력만 허용된다면 평소에 꿈꾸던 이상을 실현하여 낙원 같은 가정을 만들어 놓을 것입니다. 
단, 남편을 이끌려 하고 시시한 남성은 깔보는 경향이 있으나, 일단 결혼한 뒤에는 그 남편의 인격 여하를 막론하고 아내로서의 본분을 다할 것입니다. 그리고 명분을 존중하여 도리에 어긋나는 행동은 절대로 하지 않는 부인상입니다. ",
"두 사람의 음양과 오행이 모두 조화를 이루었으므로, 매우 좋은 궁합이며,천생연분이 라고 하겠습니다.
즉 오행에 있어 남성은 목(木)이고, 여성은 수(水)여서, 수생목(水生木)이 되어 상생관계이며, 음양적으로도 남성은 양, 여성은 음이기에 조화도 잘 이루었습니다. 
따라서 두 사람이 인연을 맺게 된다면, 남편은 아내를 사랑하고, 아내는 남편의 인격과 사랑에 만족할 것이며, 마음과 마음이 서로 통하는 애정으로서 설사 무뚝뚝한 남편일지라도 그런 남편의 모습이 아내에게는 도리어 믿음직스럽게 느낄 것입니다. 또한 남편은 약한 아내의 건강 하나하나도 관심을 기울여 주는 다정다감한 남편이 될 것 입니다. 

구체적으로 이 남성은 부지런하고 성실하게 과욕 없이 충실하게 살아가는 사람이어서 투기나 무모한 일은 하지 않습니다. 그러나 일단 신념이 서면 과감하게 밀고 나가는 사람입니다.일에서 뿐만 아니라 이성을 대함에 있어서도 처음 만남 사람에 대한 애착이 강하나, 단, 낭만적인 것과는 거리가 멀고 멋과 테크닉이 부족하여 이런 점까지 요구하는 여성에게는 좀 재미없다는 생각이 들 것입니다. 그러므로 인생을 화려하게 멋지게 살고 싶다고 생각하는 여성과는 어울리지 않습니다. 그러나 멋이나 낭만보다는 현실적인 안정과 신뢰, 신경 쓰지 않고 살고 싶다는 여성에게는 최상의 배우자감 이라고 하겠습니다. 

반면, 이 여성은 내성적이고 부끄러움을 잘 타며 얌전해서 한국적인 여성상입니다. 그래서 어른들이 가장 좋아할 만한 며느리감 이며, 설사 말괄량이 모습을 보인다고 해도 겉보기만 그럴 뿐 막상 자기가 좋아하는 남성 앞에서는 어쩔 수 없이 수줍음을 탑니다. 
애정관은 순정파로 한번 누구를 사랑하면 딴마음을 두지 않고 진심으로 헌신적인 애정을 베풀며, 혹 남성이 자기를 싫어해도 쉽게 단념하지 않습니다. 때문에 만약 남성으로부터 배신을 당하면 자기가 정을 준 만큼 증오하고 저주하게 됩니다. 따라서 이 여성과 교제중인 남성들은 만약 일시적으로 사귈 예정이라면 아예 상처를 주지 않는 것이 좋을 것입니다.
남성은 이런 여성을 아내로 맞이한다면 복입니다. 희생적인 봉사정신과 순정, 현모양처의 조건을 다 갖춘 사람과 결혼한다면, 부자면 말할 것도 없고 비록 궁해도 아껴만 준다면 불평 없이 알뜰하고 성실하게 살아가는 아내가 될 것이기 때문입니다."),
array("아기자기한 맛은 없어도 무난한 가정을 꾸린 수 있는 비교적 원만한 결합이라고 하겠습니다. 
남성과 여성의 오행은 같은 목(木)이나 음양이 다르며, 따라서 남성은 소극적 이나 여성은 적극적인 성격으로 뒤바뀐 점이 없지 않으나 두 사람의 소극성과 적극성이 묘한 조화를 이루겠습니다. 또한 남편에게 부족한 대인 관계를 아내가 유지해 나갈 것이며, 여성도 피부에 까지 닿는 애정까지 원하지 않는 성격이라서 애정문제로 충돌은 일어나지 않겠습니다. 

구체적으로 이 남성은 매우 부지런하고 착실하며, 현실 그 자체에 만족하면서 그대로 순응하면서 생활을 안전 위주로 살아갑니다. 그래서 모험이나 무모한 일에는 절대로 손대지 않으며, 부모와 형제, 처자 등 혈족간에도 불화하지 않고 삽니다. 따라서 크게 궁지에 빠지지도 않으며, 큰 출세나 큰 치부도 없이 즉 이렇다 할 굴곡도 없습니다. 
만약 여성이 낭비벽이 있거나 낭만적인 경향이 있다면 테크닉도 멋도 없는 이 남성과는 결합하지 않는 것이 좋으나, 단, 성실하고 부지런하며 아내와 자식을 아끼고 일생동안 불행은 초래하지 않으므로 딴 욕심이 없이 평온하고 담담한 삶을 원하는 여성에게 이 남성은 최상의 신랑감이라고 하겠습니다. 

반면 이 여성은 명랑하고 활발하며 외향적이고 생활력이 매우 강합니다. 그래서 본래 남에게 위축되지 않는 성격으로 부끄럼을 타지 않으며, 이해심이 많으나 반면, 자존심과 자부심이 무척 강하여 결혼해서 설사 남편이 바람을 피우거나 무관심하게 대해도 드러내 놓고 질투를 하거나 투정을 부리지는 않습니다. 아니 겁내지 않는다는 표현이 맞습니다. 
즉 '나 혼자도 잘 살 수 있다'는 자신감이 있기 때문입니다. 그렇다고 가정에서 남편을 무시하거나 하지 않으며, 단 애정의 포로가 되어 울고불고하지 않으며, 바람을 피우지도 않습니다. 또한 검소하게 살면서 한푼 두푼 저축하는 사람이므로 의존적이고 낭비벽이 있거나 결단력이 부족한 남성의 아내로 좋습니다. ",
"음양의 조화는 이루지 못했으나 이 남성에게 가장 어울리는 여성의 결합이라고 하겠습니다.
남성과 여성의 음양오행이 모두 음과 음, 목과 목이 만났으나, 부지런하고 성실한 남성에게 이 여성은 잘 어울리는 사람이므로, 부부로 만난다면 날로 발전이 예상됩니다. 단 아내의 입장에서 남편이 좀더 적극적이고 스케일이 큰 것을 기대하게 되면, 이런 점에서 좀 답답할 것이나, 무난히 잘 적응하여 조화를 이룰 것 입니다. 

구체적으로 이 남성은 매우 부지런하고 착실하며, 현실 그 자체에 만족하면서 그대로 순응하면서 생활을 안전 위주로 살아갑니다. 그래서 모험이나 무모한 일에는 절대로 손대지 않으며, 부모와 형제, 처자 등 혈족간에도 불화하지 않고 삽니다. 
따라서 크게 궁지에 빠지지도 않으며, 큰 출세나 큰 치부도 없이 즉 이렇다 할 굴곡도 없습니다. 만약 여성이 낭비벽이 있거나 낭만적인 경향이 있다면 테크닉도 멋도 없는 이 남성과는 결합하지 않는 것이 좋으나, 단, 성실하고 부지런하며 아내와 자식을 아끼고 일생동안 불행은 초래하지 않으므로 딴 욕심이 없이 평온하고 담담한 삶을 원하는 여성에게 이 남성은 최상의 신랑감이라고 하겠습니다. 

반면, 이 여성은 현모양처의 표상으로, 누구라도 이 여성을 아내로 맞이한다면 행복한 남성이라 해도 지나친 말이 아닐 것입니다. 활발하고 명랑하면서도 버릇없거나 거칠지 않고, 얌전하면서도 꽁하거나 고집스러운 타입이 아닙니다. 오히려 너무 여성적이고 평범하기에 개성이 없는 것 같으나 그 자체가 바로 이 여성의 장점이며, 튀는 매력은 없어도 싫증이 나지 않는 사람입니다. 
또한 살림살이를 운영함에 있어서, 쓸 때는 쓰면서도, 아낄 때는 아끼고, 즉, 낭비를 하거나 인색하지도 않으며, 가정 주부로서의 사명을 다합니다. 결코 분위기에 휩싸여 시간을 망각하는 일도 없으며, 배우자가 커다란 실수를 하여도, 자신의 잘못을 솔직하게 시인하고 용서를 빈다면 스스럼없이 용서해 줄 그런 여인입니다. 
결론적으로 이 여성은 아내로서 엄마로서의 도리를 다할 수 있는 바탕이 되어있는 이상적인 주부라고 하겠습니다.",
"남녀의 음양이 조화되었으며, 서로 상생관계가 이루어져 좋은 결합으로 보겠으나 성격상의 차이가 많아 은근히 갈등이 생길 우려가 있습니다. 
개방적이고 급하며 시원시원하고 멋을 추구하는 아내와 보수적이고 멋이 부족한 남편의 스타일이 문제가 되겠으나, 서로 절약정신이 강하고, 실익을 취하는 데는 의견이 같기 때문에 만약 서로 한 걸음씩 양보만 한다면 재와 부를 이루어 내는 데에 있어서 어떤 만남 보다 수월할 것입니다. 

구체적으로 이 남성은 매우 부지런하고 착실하며, 현실 그 자체에 만족하면서 그대로 순응하면서 생활을 안전 위주로 살아갑니다. 그래서 모험이나 무모한 일에는 절대로 손대지 않으며, 부모와 형제, 처자 등 혈족간에도 불화하지 않고 삽니다. 따라서 크게 궁지에 빠지지도 않으며, 큰 출세나 큰 치부도 없이 즉 이렇다 할 굴곡도 없습니다. 
만약 여성이 낭비벽이 있거나 낭만적인 경향이 있다면 테크닉도 멋도 없는 이 남성과는 결합하지 않는 것이 좋으나, 단, 성실하고 부지런하며 아내와 자식을 아끼고 일생동안 불행은 초래하지 않으므로 딴 욕심이 없이 평온하고 담담한 삶을 원하는 여성에게 이 남성은 최상의 신랑감이라고 하겠습니다. 

반면, 이 여성의 외형은 세련미가 있으나, 다소 건방져 보이기도 하고 신경질적이며 까다롭게 보이나, 내면은 겁이 많고 연약하며 순진한 면이 있습니다. 따라서 일단 연애를 하거나 아내로 맞이하면 하루가 다르게 새로운 매력에 이끌리게 될 것입니다. 솔직하고 명랑하며, 애교로서 남편의 마음을 사로잡을 것이며, 살림을 알뜰하게 꾸려나가고 남편의 사업이나 출세에 적극적인 협력자가 되어 줄 것입니다. 
또한 이 여성은 마음에 드는 남성이 발견되면 먼저 용감하게 사랑을 고백하는 대담성도 있으나, 우물쭈물 시간만 끄는 남성은 흥미가 없어 합니다. 
즉, 남성이 적극적으로 과감하게 프로포즈해 주기를 바라는 한편, 로맨틱한 감상은 좋아하지 않는 형으로 달콤한 애정 표현이나 유혹 따위에는 넘어가질 않습니다. 그리고 연애와 결혼은 다르다는 생각을 갖고 있으므로, 연애 상대자로서의 남성은 잘생기고, 세련된 남성을 선택하나, 결혼 상대자는 경제력이 있거나 사회적으로 어느 정도 위치에 있어야만 마음이 움직이게 됩니다. 
그러나 화목한 가정을 가꾸려면 경제력 보다는 원만한 성격의 남성을 만나야 합니다. 결론적으로 이 여성은 평생을 함께 살아도 싫증이 나지 않을 만큼 귀여운 아내감입니다.",
"두 사람의 배합은 운명상으로는 하자가 없으나 성격면에서 서로 불만스러울 수 있습니다. 음양오행 적으로 남성과 여성이 모두 음이나, 오행은 목과 화가 만났으므로 서로 상생관계 이므로 괜찮은 편입니다. 그러나 성격적인 측면에서 남편은 소극적이고 조심성이 많은 대신 여성은 적극적이고 기 분에 따라 행동하는 경향이 있어 부딪힐 우려가 있습니다. 그러나 이 여성은 남성이 하기에 따라 금세 풀릴 수도 있고, 응어리가 오래도록 남아 있을 수도 있으므로, 남편은 아내의 마음을 달래주고, 아내는 남편의 근면 성실함에 만족할 줄 알고 서로 이해하고자 노력하면 매우 윤택한 가정을 이룰 것입니다. 

구체적으로 이 남성은 매우 부지런하고 착실하며, 현실 그 자체에 만족하면서 그대로 순응하면서 생활을 안전 위주로 살아갑니다. 그래서 모험이나 무모한 일에는 절대로 손대지 않으며, 부모와 형제, 처자 등 혈족간에도 불화하지 않고 삽니다. 따라서 크게 궁지에 빠지지도 않으며, 큰 출세나 큰 치부도 없이 즉 이렇다 할 굴곡도 없습니다. 
만약 여성이 낭비벽이 있거나 낭만적인 경향이 있다면 테크닉도 멋도 없는 이 남성과는 결합하지 않는 것이 좋으나, 단, 성실하고 부지런하며 아내와 자식을 아끼고 일생동안 불행은 초래하지 않으므로 딴 욕심이 없이 평온하고 답답한 삶을 원하는 여성에게 이 남성은 최상의 신랑감이라고 하겠습니다. 

반면, 이 여성은 활발하고 외향적이면서 인정이 많습니다. 또 좋고 싫은 것이 분명해서 누구든 한 번 좋아하면 가식 없이 따르고, 한 번 미워하면 노골적으로 싫은 것을 나타냅니다. 
그리고 마음이 약해서 남의 어려운 청을 거절하지 못하며, 미혼시절에 별로 좋아하지 않는 남성에게 차마 냉정하게 대하지 못하는 약점 때문에 당하지 않아도 될 곤욕을 당하거나, 심지어는 끈질긴 구애를 거절하지 못해 결혼까지 하게 될 수도 있습니다. 따라서 이 점에 주의해야 평생 동안 후회가 없을 것입니다. 
반면 결혼해서는 생활력이 강하여 남편 일을 잘 거들고 맞벌이도 주저하지 않습니다. 이 여성을 배우자로 맞이했거나 하려는 남성은 상대의 자존심을 상하게 하는 말을 해서는 안되며, 진심어린 애정의 표시를 하십시오. 그것이 전달된다면 아내는 남편을 위해 어떤 일도 불사할 수 있는 아름다운 성격의 소유자입니다.",
"남녀의 음양이 잘 조화되었으며, 부부의 위계가 바로 된 정배합으로, 가장 이상적인 관계로 만났다고 하겠습니다. 
따라서 다소 성격 차이가 있다고 해도 여성은 남편의 근면과 성실, 정직함에 존경심이 들것이며, 남편은 아내의 노련미와 진중함에 만족하여 서로 어려워하고 아끼면서도 알찬 삶을 영위해 나갈 것입니다. 또한 그런 가운데 서로가 각자 다른 취미나 직업 활동에 간섭하지 않으므로 한 가정에서 두 가지 사업을 경영해 나갈 가능성도 있습니다. 

구체적으로 이 남성은 매우 부지런하고 착실하며, 현실 그 자체에 만족하면서 그대로 순응하면서 생활을 안전 위주로 살아갑니다. 그래서 모험이나 무모한 일에는 절대로 손대지 않으며, 부모와 형제, 처자 등 혈족간에도 불화하지 않고 삽니다. 따라서 크게 궁지에 빠지지도 않으며, 큰 출세나 큰 치부도 없이 즉 이렇다 할 굴곡도 없습니다. 
만약 여성이 낭비벽이 있거나 낭만적인 경향이 있다면 테크닉도 멋도 없는 이 남성과는 결합하지 않는 것이 좋으나, 단, 성실하고 부지런하며 아내와 자식을 아끼고 일생동안 불행은 초래하지 않으므로 딴 욕심이 없이 평온하고 담담한 삶을 원하는 여성에게 이 남성은 최상의 신랑감이라고 하겠습니다. 

반면, 이 여성은 똑똑하고 대담하며 노련한 여장부격인 사람으로, 부드럽고 애교스럽거나 야한 맛을 풍기지는 않으나 세련되고 침착하며, 개성이 강해서 분위기에 잘 말려들지 않고 남의 꼬임에도 넘어가지 않습니다. 그래서 남성이 유혹하기에 가장 힘들고 다루기 어려운 타입의 여성형입니다. 그러나 좋아하는 사람에게는 깊은 애정을 쏟으며, 설사 금전적으로 손해를 보더라도 애정을 쏟기도 합니다. 
이처럼 애정면에서 적극적이어서 누가 먼저 프로포즈하건 사귐이 빠르게 진행되며, 시일을 기다리면서 이것저것 재지 않고 즉흥적인 판단을 내립니다. 반면 좋아하는 남성상은 강한 남성미 보다는, 곱고 단아하면서도 유약해 보이는 남성을 좋아하며, 정조 그 자체를 대단하게 여기지는 않으나 고고하고 도도한 성격 탓에 함부로 몸을 허락하는 행동을 하지는 않습니다. 
남편은 사회적, 경제적으로 상당한 위치에 있는 남성이라야 이 여성을 이끌 수 있으며, 아니면 차라리 여성이 주도권을 쥐고 남편이 아내의 의견에 따라가는 부부관계가 형성되어야 집안이 평안할 것입니다.",
"남녀의 위계는 제대로 이루어졌으나, 두 사람의 음양이 모두 음으로서 편배합니다. 
따라서 완고한 성격의 남편이 알뜰하면서도 자유분방한 아내의 성격을 얼마만큼 이해하고 호응할지가 가정생활에 있어서 행과 불행을 좌우할 것입니다. 그러므로 남편은 다소 억제 당하는 기분이 들더라도 자신에게 해가 되지 않으므로 이해하고 양보해야 겠습니다. 
그렇게 된다면 부부의 호흡은 잘 맞을 것이며, 다소 인색할 정도로 지독한 절약성 때문에 때론 지독스런 부부라는 평을 들을 정도로, 특히 경제적인 면에서 착실한 발전을 보게 될 것입니다. 

구체적으로 이 남성은 매우 부지런하고 착실하며, 현실 그 자체에 만족하면서 그대로 순응하면서 생활을 안전 위주로 살아갑니다. 그래서 모험이나 무모한 일에는 절대로 손대지 않으며, 부모와 형제, 처자 등 혈족간에도 불화하지 않고 삽니다. 따라서 크게 궁지에 빠지지도 않으며, 큰 출세나 큰 치부도 없이 즉 이렇다 할 굴곡도 없습니다. 
만약 여성이 낭비벽이 있거나 낭만적인 경향이 있다면 테크닉도 멋도 없는 이 남성과는 결합하지 않는 것이 좋으나, 단, 성실하고 부지런하며 아내와 자식을 아끼고 일생동안 불행은 초래하지 않으므로 딴 욕심이 없이 평온하고 담담한 삶을 원하는 여성에게 이 남성은 최상의 신랑감이라고 하겠습니다. 

반면, 이 여성은 총명하고 약고 깜짝하며, 다소 신경질적이나 재치가 번득이는 사람입니다. 또한 보수적인 면이 있으면서도, 현대적인 것도 취하고, 가정적이어서 알뜰하고 절약성이 강한 주부상으로 조금도 흠이 없습니다. 
단, 남편에게 정도 이상으로 간섭하는 경향이 있으나, 명분상 남편의 위신을 세워 주며, 타인이 그것을 느낄 수 있도록 정성을 기울입니다. 그리고 사람을 대할 때 앞에서는 그를 추켜 주고 비위를 맞추나 진심이 아닌 경우가 많습니다. 즉, 자신에게 유리한 사람에게는 자세도 낮추고 겸손하여 상대의 호감을 사려고 노력하지만 그렇지 않으면 사귀지 않습니다. 
이러한 이해타산은 생활을 하면서도 나타나 궁해도 궁한 체하지 않고 과시하기를 좋아하며, 명예나 이익 관리에 지혜로울 정도로 처신합니다. 따라서 이 여성을 아내로 맞이한다면, 아내의 재치와 순발력, 총명한 두뇌를 잘 수용하고 결점을 잘 타일러 간다면 최상의 반려자가 될 것입니다.",
"남녀의 위계가 바뀌었으나 음양이 조화되고 합을 이루었으므로 괜찮은 결합입니다. 
단, 가정에서 남편 위주로 살아가려면 부부간에 충돌이 자주 일어나게 되나, 타협이 잘 이루어져 남편이 경제권 등 결정권의 백퍼센트를 아내에게 양보하게 될 것이며, 도리어 그것을 편하게 생각하게 될 것입니다. 
근면 성실한 남편과 알뜰한 아내, 이렇게 만난 부부라면 어느 가정이건 살아가는 데 궁색하지 않을 것이나, 남편은 자칫하면 애처가 내지 지나친 공처가가 되기 쉬우며, 외도 따위는 엄두도 못 낼 것이며, 아내 역시 절대로 허용하지 않을 것입니다. 

구체적으로 이 남성은 매우 부지런하고 착실하며, 현실 그 자체에 만족하면서 그대로 순응하면서 생활을 안전 위주로 살아갑니다. 그래서 모험이나 무모한 일에는 절대로 손대지 않으며, 부모와 형제, 처자 등 혈족간에도 불화하지 않고 삽니다. 따라서 크게 궁지에 빠지지도 않으며, 큰 출세나 큰 치부도 없이 즉 이렇다 할 굴곡도 없습니다. 
만약 여성이 낭비벽이 있거나 낭만적인 경향이 있다면 테크닉도 멋도 없는 이 남성과는 결합하지 않는 것이 좋으나, 단, 성실하고 부지런하며 아내와 자식을 아끼고 일생동안 불행은 초래하지 않으므로 딴 욕심이 없이 평온하고 담담한 삶을 원하는 여성에게 이 남성은 최상의 신랑감이라고 하겠습니다. 

반면, 이 여성은 성격이 강하고 솔직하며, 개성이 있고 생활력이 강합니다. 특히 분위기에 흔들리지 않고 감언이설에 잘 넘어가지 않으며, 명분을 좋아해서 명분 없는 일은 설사 유혹에 이끌릴지라도 절대 행하지 않습니다. 그리고 개방적이며 이상보다 현실에 충실하고 시대의 흐름에 민감합니다. 
반면 바람기가 있는 것 같으면서도 방종하지 않고, 사치와 허영에 빠지지 않으며, 자기 관리에 철저하여 감정에 치우쳐 과오를 범하지 않으며, 정조관념도 강합니다. 결혼해서는 혹 남편이 잘못하면 그것을 눈감아 주지 않고 트집잡고, 바가지도 잘 긁어대며, 남편의 바람기를 용납하지 않습니다. 
따라서 웬만한 남성은 이 여성에게 쩔쩔매게 되고, 남편을 공처가로 만들기 쉽습니다. 그러나 이해심은 남성 못지않아서 금세 풀어지며, 가정을 위해 최대한의 노력을 아끼지않을 믿음직스러운 아내의 상입니다. ",
"그저 그런 관계라고 하겠습니다.
남녀가 모두 같은 음이며, 여성이 금이고, 남성이 목인 상극이자 상충(相沖) 관계입니다. 이처럼 오행의 위치가 반대되는 상극관계는 그런대로 무방하나 여성이 남성을 극하는 것은 좋은 결합이 아니라고 하겠습니다. 따라서 두 사람이 파탄 없이 무난하게 가정생활을 꾸려가려면 가정의 경제권과 결정권 등을 모두 아내가 쥐고, 남편은 아내에게 따라갈 뿐 간섭해서는 안됩니다. 즉, 엄처시하에 살아가는 남편이라면 문제될 것은 없습니다.

구체적으로 이 남성은 매우 부지런하고 착실하며, 현실 그 자체에 만족하면서 그대로 순응하면서 생활을 안전 위주로 살아갑니다. 그래서 모험이나 무모한 일에는 절대로 손대지 않으며, 부모와 형제, 처자 등 혈족간에도 불화하지 않고 삽니다. 따라서 크게 궁지에 빠지지도 않으며, 큰 출세나 큰 치부도 없이 즉 이렇다 할 굴곡도 없습니다. 
만약 여성이 낭비벽이 있거나 낭만적인 경향이 있다면 테크닉도 멋도 없는 이 남성과는 결합하지 않는 것이 좋으나, 단, 성실하고 부지런하며 아내와 자식을 아끼고 일생동안 불행은 초래하지 않으므로 딴 욕심이 없이 평온하고 담담한 삶을 원하는 여성에게 이 남성은 최상의 신랑감이라고 하겠습니다. 

반면, 이 여성은 약고 재치가 있으며 친절하면서도 남성 못지않은 이해심과 아량으로 때로는 좋은 일을 위해서 다소의 손해도 불사합니다. 
그리고 특별한 용모를 갖추지 않았더라도 사람을 끄는 매력이 있어 아무리 수수한 차림새라도 야해 보이고 바람기가 있어 보이며, 부담감이 없게 느껴지는 여성이어서 남성들의 유혹을 많이 받게 됩니다. 
가정을 아름답게 꾸미는 데 취미와 소질이 있고, 평범한 삶보다 이상적인 생활환경, 삶의 멋을 추구하는 타입이어서 세상의 이목이나 경제적 구애가 없다고 가정할 때 이 여성은 멋진 연애를 하고 싶고, 결혼 후에도 가장 호화롭고 사치스러운 삶을 영위하고자 할 것입니다. 그리고 서비스가 만점이라서 남편한테 베푸는 애정과 서비스는 그 누구도 따라오지 못합니다. 
좋아하는 남성상은 의젓하고 개성 있고 주관이 뚜렷한 남성을 좋아하며, 자신이 남성을 지배하기를 원하지 않으며, 남편으로 섬기고 싶어합니다. 그렇지 않으면 소위 제비족인 남성에게 유혹당할 우려가 있습니다. ",
"음양과 오행이 모두 조화된 매우 좋은 관계라고 하겠습니다. 
즉 음인 남성과 양인 여성의 결합했으므로, 음양이 조화되었으며, 여성과 남성이 수와 목으로 상생궁합입니다. 
음양의 이치로서 음은 의존적이고 양은 솔선하는 성질이 있기 때문에, 남편은 왠지 모르게 아내에게 의지하고 싶어할 것이며, 여성은 모성애로써 그런 남편을 감싸고 싶은 감정이 들어 묘하게 부부가 일치되고 있습니다. 그러므로 이런 결합은 남편이 아내에게 모든 것을 맡기고, 아내는 남편을 위해 최대한의 서비스로 남편을 섬길 것이며, 아내는 완고하고 보수적인 남편을 슬기롭게 이끌어 나갈 수 있을 것입니다. 

구체적으로 이 남성은 매우 부지런하고 착실하며, 현실 그 자체에 만족하면서 그대로 순응하면서 생활을 안전 위주로 살아갑니다. 그래서 모험이나 무모한 일에는 절대로 손대지 않으며, 부모와 형제, 처자 등 혈족간에도 불화하지 않고 삽니다. 따라서 크게 궁지에 빠지지도 않으며, 큰 출세나 큰 치부도 없이 즉 이렇다 할 굴곡도 없습니다. 
만약 여성이 낭비벽이 있거나 낭만적인 경향이 있다면 테크닉도 멋도 없는 이 남성과는 결합하지 않는 것이 좋으나, 단, 성실하고 부지런하며 아내와 자식을 아끼고 일생동안 불행은 초래하지 않으므로 딴 욕심이 없이 평온하고 담담한 삶을 원하는 여성에게 이 남성은 최상의 신랑감이라고 하겠습니다. 

반면, 이 여성은 명랑하고 활발하며 부끄러움을 타지 않고 시원스럽습니다. 
또한 성깔도 있고 억센 듯하지만 여성이 갖추어야 할 애교와 매력도 있습니다. 즉, 여성이면서도 배짱이 있고 폭 넓은 아량과 남을 위해 봉사하고 이해하는데 인색하지 않으며, 웬만한 일은 스스로 해결하며 무슨 일에나 태도가 분명합니다. 혹 낭만적인 면이 있어 기분에 따라서 씀씀이가 크지만 계획 없는 낭비는 하지 않으며, 써야 할 일이면 손이 크다는 평을 들을 만큼 멋지게 쓰는 타입입니다. 
만일 이 여성에게 경제력만 허용된다면 평소에 꿈꾸던 이상을 실현하여 만들어 놓을 것입니다. 
단, 남편을 이끌려 하고 시시한 남성은 깔보는 경향이 있으나, 일단 결혼한 뒤에는 그 남편의 인격 여하를 막론하고 아내로서의 본분을 다할 것입니다. 그리고 명분을 존중하여 도리에 어긋나는 행동은 절대로 하지 않는 부인상입니다.",
"남녀 모두가 음과 음이나, 오행은 상생관계라 나쁜 배합은 아닙니다. 
다만 남녀 모두 조심성이 지나치고 소극적이라서 어떤 일이건 과감히 결단을 내리지 못함으로써 좋은 기회를 놓칠 아쉬움이 있습니다. 그러나 무리를 범하지 않는 장점도 있어 큰 실패는 하지 않을 것이며, 서로 상대방을 자극하는 언행을 피함으로써 큰 충돌은 일어나지 않겠으나, 만약 한번 사이가 나빠지면 냉전이 오랫동안 계속될 우려도 있습니다. 
만약 두 사람이 이미 부부로 만났다거나 그렇게 된다면 남편 쪽에서 적극적인 태도로 아내를 위로하는 데 노력해야 하며, 그러면 아내는 무척 감격하고 고마워서 설사 궁색한 살림일지라도 기쁜 마음으로 살아갈 것입니다. 

구체적으로 이 남성은 매우 부지런하고 착실하며, 현실 그 자체에 만족하면서 그대로 순응하면서 생활을 안전 위주로 살아갑니다. 그래서 모험이나 무모한 일에는 절대로 손대지 않으며, 부모와 형제, 처자 등 혈족간에도 불화하지 많고 삽니다. 따라서 크게 궁지에 빠지지도 않으며, 큰 출세나 큰 치부도 없이 즉 이렇다 할 굴곡도 없습니다. 
만약 여성이 낭비벽이 있거나 낭만적인 경향이 있다면 테크닉도 멋도 없는 이 남성과는 결합하지 않는 것이 좋으나, 단, 성실하고 부지런하며 아내와 자식을 아끼고 일생동안 불행은 초래하지 않으므로 딴 욕심이 없이 평온하고 담담한 삶을 원하는 여성에게 이 남성은 최상의 신랑감이라고 하겠습니다. 

반면, 이 여성은 내성적이고 부끄러움을 잘 타며 얌전해서 한국적인 여성상입니다. 그래서 어른들이 가장 좋아할 만한 며느리감이며, 설사 말괄량이 모습을 보인다고 해도 겉보기만 그럴 뿐 막상 자기가 좋아하는 남성 앞에서는 어쩔 수 없이 수줍음을 탑니다. 
애정관은 순정파로 한번 누구를 사랑하면 딴마음을 두지 않고 진심으로 헌신적인 애정을 베풀며, 혹 남성이 자기를 싫어해도 쉽게 단념하지 않습니다. 때문에 만약 남성으로부터 배신을 당하면 자기가 정을 준 만큼 증오하고 저주하게 됩니다. 따라서 이 여성과 교제중인 남성들은 만약 일시적으로 사귈 예정이라면 아예 상처를 주지 않는 것이 좋을 것입니다. 
남성은 이런 여성을 아내로 맞이한다면 복입니다 희생적인 봉사정신과 순정, 현모양처의 조건을 다 갖춘 사람과 결혼한다면, 부자면 말할 것도 없고 비록 궁해도 아껴만 준다면 불평 없이 알뜰하고 성실하게 살아가는 아내가 될 것이기 때문입니다."),
array("무난한 관계이므로 괜찮은 결합이라고 하겠습니다. 
남성은 불이며, 여성은 목이니 목생화로서 상생궁합이나, 단, 양끼리 만났기에 음양이 치우친 즉, 같은 성격끼리 만난 셈입니다. 따라서 이 결합에 있어 남편은 아내에게 바라는 주문이 많으며, 아내 입장에서는 남편으로부터 받는 것은 적고 주는 데 신경을 써야 하므로 아무래도 아내가 남편에게 봉사를 많이 하게 되는 궁합입니다. 
그러나 남편이 이기적인 마음을 버리고 아내의 입장을 십분 이해하여 위로와 애정을 베푼 다면, 원만하고 행복한 삶을 영위할 수 있을 것입니다. 

구체적으로 이 남성은 누구보다 두뇌회전이 빠릅니다. 그러다 보면 자기 꾀에 스스로 넘어가기도 하나 대개는 시대의 흐름에 민감해서 처세를 잘하며, 사업경영도 적절히 함으로써 남보다 앞서는 사람입니다. 비록 겉은 까다로워 보여도 수더분하고 음식도 가리는 게 별로 없으며, 성격이 급해서 누가 우물쭈물 하는 것을 보지 못하고 화를 잘 내지만 금새 풀려서 상대방의 감정을 잘 풀어줍니다. 
특히 사람을 사귀고 다루는 수단이 좋아 생면부지의 사람과 만나도 금세 사귀고, 그들에게 호감을 받으며, 연애관은 좋아하는 상대가 있으면 이것 저것 재지 않고 과감하게 프로포즈하는 타입이며, 좋고 싫은 표현이 확실하여 숨기지 않는 그런 사람입니다. 

반면 이 여성은 명랑하고 활발하며 외향적이고 생활력이 매우 강합니다. 
그래서 본래 남에게 위축되지 않는 성격으로 부끄럼을 타지 않으며, 이해심이 많으나 반면, 자존심과 자부심이 무척 강하여 결혼해서 설사 남편이 바람을 피우거나 무관심하게 대해도 드러내 놓고 질투를 하거나 투정을 부리지는 않습니다. 아니 겁내지 않는다는 표현이 맞습니다. 즉 '나 혼자도 잘 살 수 있다'는 자신감이 있기 때문입니다. 그렇다고 가정에서 남편을 무시하거나 하지 않으며, 단 애정의 포로가 되어 울고불고하지 않으며, 바람을 피우지도 않습니다.
또한 검소하게 살면서 한푼 두푼 저축하는 사람이므로 의존적이고 낭비벽이 있거나 결단력이 부족한 남성의 아내로 좋습니다.",
"매우 좋은 궁합이라고 하겠습니다. 
남성이 양이고, 여성이 음으로서 음양이 잘 조화되었으며, 여성이 목(木)이고 남편은 불로서 서로 상생해 주는 오행관계 입니다. 따라서 이 남성은 이 여성을 아내를 맞이하면 본래의 이기심이 사랑으로 변하여 아내를 위해서는 무엇이든 다 들어줄 만한 각오가 서게 될 것입니다. 
또한 아내는 그런 남편이 한없이 고맙고 감격스러워 남편은 소중히 여기므로 언제나 신혼부부와 같은 애정이 지속될 것입니다. 그러므로 두 사람의 가정은 험한 난관이 없을 것이며, 자녀 등도 부모의 마음과 같이 충실하여 그야말로 가장 평화롭고 축복 받은 가정을 이를 것입니다. 

구체적으로 이 남성은 누구보다 두뇌회전이 빠릅니다. 그러다 보면 자기 꾀에 스스로 넘어가기도 하나 대개는 시대의 흐름에 민감해서 처세를 잘하며, 사업경영도 적절히 함으로써 남보다 앞서는 사랑입니다. 
비록 겉은 까다로워 보여도 수더분하고 음식도 가리는 것이 별로 없으며, 성격이 급해서 누가 우물쭈물 하는 것을 보지 못하고 화를 잘 내지만 금새 풀려서 상대방의 감정을 잘 풀어줍니다. 특히 사람을 사귀고 다루는 수단이 좋아 생면부지의 사람과 만나도 금세 사귀고, 그들에게 호감을 받으며, 연애관은 좋아하는 상대가 있으면 이것 저것 재지 않고 과감하게 프로포즈하는 타입이며, 좋고 싫은 표현이 확실하여 숨기지 않는 그런 사람입니다. 

반면, 이 여성은 현모양처의 표상으로, 누구라도 이 여성을 아내로 맞이한다면 행복한 남성이라 해도 지나친 말이 아닐 것입니다. 활발하고 명랑하면서도 버릇없거나 거칠지 않고, 얌전하면서도 꽁하거나 고집스러운 타입이 아닙니다. 오히려 너무 여성적이고 평범하기에 개성이 없는 것 같으나 그 자체가 바로 이 여성의 장점이며, 튀는 매력은 없어도 싫증이 나지 않는 사람입니다. 
또한 살림살이를 운영함에 있어서, 쓸 때는 쓰면서도, 아낄 때는 아끼고, 즉, 낭비를 하거나 인색하지도 않으며, 가정 주부로서의 사명을 다합니다. 결코 분위기에 휩싸여 시간을 망각하는 일도 없으며, 배우자가 커다란 실수를 하여도, 자신의 잘못을 솔직하게 시인하고 용서를 빈다면 스스럼없이 용서해 줄 그런 여인입니다. 
결론적으로 이 여성은 아내로서 엄마로서의 도리를 다할 수 있는 바탕이 되어있는 이상적인 주부라고 하겠습니다.",
"별다른 문제는 없으나 그렇다고 해서 바람직한 결합이라고 하기는 어렵습니다.
오행적으로 남녀 모두 불이라서, 서로 기분이 맞을 때는 누구와의 만남보다 열정적인 애정을 쏟게 되나, 또 금세 사그라드는 불길 같아서 그 애정이 오랫동안 지속되기가 어렵겠습니다. 따라서 잠시 만났다가 헤어지는 사이라면 모르나 일생을 같이 살아야 하는 부부로서의 결합은 그리 좋지 못하며, 한번 충돌이 생기면 서로 양보하지 않으므로 극단에 이르기 쉽습니다.
만약 두 사람이 이미 부부가 되었다면 각자 자신의 결점을 알아서 참고 이해하는데 최선을 다해야 원만한 가정생활을 꾸려나갈 수 있겠습니다. 

구체적으로 이 남성은 누구보다 두뇌회전이 빠릅니다. 그러다 보면 자기 피에 스스로 넘어가기도 하나 대개는 시대의 흐름에 민감해서 처세를 잘하며, 사업경영도 적절히 함으로써 남보다 앞서는 사람입니다. 비록 겉은 까다로워 보여도 수더분하고 음식도 가리는 게 별로 없으며, 성격이 급해서 누가 우물쭈물 하는 것을 보지 못하고 화를 잘 내지만 금새 풀려서 상대방의 감정을 잘 풀어줍니다. 
특히 사람을 사귀고 다루는 수단이 좋아 생면부지의 사람과 만나도 금세 사귀고, 그들에게 호감을 받으며, 연애관은 좋아하는 상대가 있으면 이것 저것 재지 않고 과감하게 프로포즈하는 타입이며, 좋고 싫은 표현이 확실하여 숨기지 않는 그런 사람입니다. 

반면, 이 여성의 외형은 세련미가 있으나, 다소 건방져 보이기도 하고 신경질적이며 까다롭게 보이지만, 내면은 겁이 많고 연약하며 순진한 면이 있습니다. 따라서 일단 연애를 하거나 아내로 맞이하면 하루가 다르게 새로운 매력에 이끌리게 될 것입니다. 솔직하고 명랑하며, 애교로서 남편의 마음을 사로잡을 것이며, 살림을 알뜰하게 꾸려 나가고 남편의 사업이나 출세에 적극적인 협력자가 되어 줄 것입니다. 
또한 이 여성은 마음에 드는 남성이 발견되면 먼저 용감하게 사랑을 고백하는 대담성도 있으나, 우물쭈물 시간만 끄는 남성은 흥미가 없어 합니다. 즉, 남성이 적극적으로 과감하게 프로포즈해 주기를 바라는 한편, 로맨틱한 감상은 좋아하지 않는 형으로 달콤한 애정 표현이나 유혹 따위에는 넘어가질 않습니다. 
그리고 연애와 결혼은 다르다는 생각을 갖고 있으므로, 연애 상대자로서의 남성은 잘 생기고, 세련된 납성을 선택하나, 결혼 상대자는 경제력이 있거나 사회적으로 어느 정도 위치에 있어야만 마음이 움직이게 됩니다. 그러나 화목한 가정을 가꾸려면 경제력 보다는 원만한 성격의 남성을 만나야 합니다. 
결론적으로 이 여성은 평생을 함께 살아도 싫증이 나지 않을 만큼 귀여운 아내감 입니다.",
"두 사람의 궁합은 별로이며, 좋은 만남이 아닙니다. 
남성과 여성이 모두 불과 불의 만남이어서, 서로 참을성이 부족하며, 남편이 감정적으로 함부로 말한 것이 아내에게는 충격이 되고 응어리로 남아 냉전 상태가 오래 지속되기 쉽기 때문에 가정의 분위기가 좋지 못하기 쉽습니다. 단, 무난하게 부부생활을 하려면 서로 상대가 싫어하는 일을 삼가 하고 조심스럽게 대해야 하며, 남편 쪽에서 아내에게 저주고 양보하는 마음으로 살아가야 합니다. 
아무튼 운명상의 작용도 좋지 않으므로 가급적 인연 맺는 일을 피하는 것도 좋을 것입니다. 

구체적으로 이 남성은 누구보다 두뇌회전이 빠릅니다. 그러다 보면 자기 죄에 스스로 넘어가기도 하나 대개는 시대의 흐름에 민감해서 처세를 잘하며, 사업경영도 적절히 함으로써 남보다 앞서는 사람입니다. 비록 겉은 까다로워 보여도 수더분하고 음식도 가리는 게 별로 없으며, 성격이 급해서 누가 우물쭈물 하는 것을 보지 못하고 화를 잘 내지만 금새 풀려서 상대방의 감정을 잘 풀어줍니다.
특히 사람을 사귀고 다루는 수단이 좋아 생면부지의 사람과 만나도 금세 사귀고, 그들에게 호감을 받으며, 연애관은 좋아하는 상대가 있으면 이것 저것 재지 않고 과감하게 프로포즈하는 타입이며, 좋고 싫은 표현이 착실하여 숨기지 않는 그런 사람입니다.

반면, 이 여성은 활발하고 외향적이면서 인정이 많습니다. 또 좋고 싫은 것이 분명해서, 누구든 한 번 좋아하면 가식 없이 따르고, 한 번 미워하면 노골적으로 싫은 것을 나타냅니다. 그리고 마음이 약해서 남의 어려운 청을 거절하지 못하며, 미혼시절에 별로 좋아하지 않는 남성에게 차마 냉정하게 대하지 못하는 약점 때문에 당하지 않아도 될 곤욕을 당하거나, 심지어는 끈질긴 구애를 거절하지 못해 결혼까지 하게 될 수도 있습니다. 따라서 이 점에 주의해야 평생 동안 후회가 없을 것입니다.
반면 결혼해서는 생활력이 강하여 남편 일을 잘 거들고 맞벌이도 주저하지 않습니다. 이 여성을 배우자로 맞이했거나 하려는 남성은 상대의 자존심을 상하게 하는 말을 해서는 안되며, 진심어린 애정의 표시를 하십시오. 그것이 전달된다면 아내는 남편을 위해 어떤 일도 불사할 수 있는 아름다운 성격의 소유자입니다.",
"남녀가 상생관계를 이루었으므로 나쁜 관계는 아닙니다.
그러나 서로가 자존심을 내세워 지지 않으려고 하기 때문에 이기적인 방향으로 표현될 가능성도 있습니다. 따라서 웬만한 일이면 서로 간섭하지 말고 자존심을 상하지 않도록 노력해야 큰 충돌이 일어나지 않을 것입니다. 특히, 노련미가 있고 생각이 깊은 아내가 남편의 비위를 맞추는 형식으로 살아간다면 결과적으로 이익은 아내에게 돌아올 것입니다. 

구체적으로 이 남성은 누구보다 두뇌회전이 빠릅니다. 그러다 보면 자기 꾀에 스스로 넘어가기도 하나 대개는 시대의 흐름에 민감해서 처세를 잘하며, 사업경영도 적절히 함으로써 남보다 앞서는 사람입니다. 비록 겉은 까다로워 보여도 수더분하고 음식도 가리는 게 별로 없으며, 성격이 급해서 누가 우물쭈물 하는 것을 보지 못하고 화를 잘 내지만 금새 풀려서 상대방의 감정을 잘 풀어줍니다. 
특히 사람을 사귀고 다루는 수단이 좋아 생면부지의 사람과 만나도 금세 사귀고, 그들에게 호감을 받으며, 연애관은 좋아하는 상대가 있으면 이것 저것 재지 않고 과감하게 프로포즈하는 타입이며, 좋고 싫은 표현이 확실하여 숨기지 않는 그런 사람입니다. 

반면, 이 여성은 똑똑하고 대담하며 노련한 여장부격인 사람으로, 부드럽고 애교스럽거나 야한 맛을 풍기지는 않으나 세련되고 침착하며, 개성이 강해서 분위기에 잘 말려들지 않고 남의 꼬임에도 넘어가지 않습니다. 그래서 남성이 유혹하기에 가장 힘들고 다루기 어려운 타입의 여성형입니다. 그러나 좋아하는 사람에게는 깊은 애정을 쏟으며, 설사 금전적으로 손해를 보더라도 애정을 쏟기도 합니다.
이처럼 애정면에서 적극적이어서 누가 먼저 프로포즈하건 사귐이 빠르게 진행되며, 시일을 기다리면서 이것저것 재지 않고 즉흥적인 판단을 내립니다.
반면 좋아하는 남성상은 강한 남성미 보다는, 곱고 단아하면서도 유약해 보이는 남성을 좋아하며, 정조 그 자체를 대단하게 여기지는 않으나 고고하고 도도한 성격 탓에 함부로 몸을 허락하는 행동을 하지는 않습니다.
남편은 사회적, 경제적으로 상당한 위치에 있는 남성이라야 이 여성을 이끌 수 있으며, 아니면 차라리 여성이 주도권을 쥐고 남편이 아내의 의견에 따라가는 부부관계가 형성되어야 집안이 평안할 것입니다.",
"매우 좋은 결합이라고 하겠습니다. 
음양적으로 남성은 양이며, 여성은 음이고 서로 상생관계를 이루는 길한 배합입니다. 따라서 아내는 남편에게 어리광을 부리고 싶어지고, 남편은 그런 아내가 귀엽고 사랑스러워 다소의 결점이 있지만 잘못을 했더라도 밉게 보지 않을 것입니다. 혹 서로 눈치만 보면서 약게 살아가는 예도 있으나 이는 서로의 본래 성격인 이기심 때문으로, 항상 부부란 일심동체라는 것을 잊지 말고 상대방부터 위하면 결과적으로 자신에게 이익이 돌아온다는 것을 명심하십시오.

구체적으로 이 남성은 누구보다 두뇌회전이 빠릅니다. 
그러다 보면 자기 뫼에 스스로 넘어가기도 하나 대개는 시대의 흐름에 민감해서 처세를 잘하며, 사업경영도 적절히 함으로써 남보다 앞서는 사람입니다. 비록 겉은 까다로워 보여도 수더분하고 음식도 가리는 게 별로 없으며, 성격이 급해서 누가 우물쭈물 하는 것을 보지 못하고 화를 잘 내지만 금새 풀려서 상대방의 감정을 잘 풀어줍니다. 
특히 사람을 사귀고 다루는 수단이 좋아 생면부지의 사람과 만나도 금세 사귀고, 그들에게 호감을 받으며, 연애관은 좋아하는 상대가 있으면 이것 저것 재지 않고 과감하게 프로포즈하는 타입이며, 좋고 싫은 표현이 확실하여 숨기지 않는 그런 사람입니다.

반면, 이 여성은 총명하고 약고 깜짝하며, 다소 신경질적이나 재치가 번득이는 사람입니다. 
또한 보수적인 면이 있으면서도, 현대적인 것도 취하고, 가정적이어서 알뜰하고 절약성이 강한 주부상으로 조금도 흠이 없습니다. 단, 남편에게 정도 이상으로 간섭하는 경향이 있으나, 명분상 남편의 위신을 세워 주며, 타인이 그것을 느낄 수 있도록 정성을 기울입니다. 그리고 사람을 대할 때 앞에서는 그를 추켜 주고 비위를 맞추나 진심이 아닌 경우가 많습니다. 즉, 자신에게 유리한 사람에게는 자세도 낮추고 겸손하여 상대의 호감을 사려고 노력하지만 그렇지 않으면 사귀지 않습니다. 
이러한 이해타산은 생활을 하면서도 나타나 궁해도 궁한 체하지 않고 과시하기를 좋아하며, 명예나 이익 관리에 지혜로울 정도로 처신합니다. 따라서 이 여성을 아내로 맞이한다면, 아내의 재치와 순발력, 총명한 두뇌를 잘 수용하고 결점을 잘 타일러 간다면 최상의 반려자가 될 것입니다.",
"운명적으로 나쁘지는 않으나, 다소 충돌이 염려됩니다. 
그러나 남성과 여성의 위계가 바르게 되어 있으므로 나쁜 결합은 아닙니다. 두 사람 모두 다같이 성격이 급하고 억세고 외향적이나, 여성의 강하고 높은 콧대를 남성은 능히 컨트롤 할 수 있습니다. 그렇다고 해서 남편은 아내를 무조건적으로 억압하기 보다는 말로써 설득하는 것이 더 효과적입니다. 
그렇다면 비록 자존심이 강한 아내라 할지라도 경우가 바른 남편에게 순종할 것이며, 존경하는 마음으로 현모양처가 되기 위해 노력할 것입니다. 즉, 똑똑하고 개성 있고 슬기로운 아내를 남편이 얼마만큼 이끌어 가느냐에 따라 부부간의 행복과 불행이 좌우될 것입니다. 

구체적으로 이 남성은 누구보다 두뇌회전이 빠릅니다. 그러다 보면 자기 외에 스스로 넘어가기도 하나 대개는 시대의 흐름에 민감해서 처세를 잘하며, 사업경영도 적절히 함으로써 남보다 앞서는 사람입니다. 비록 겉은 까다로워 보여도 수더분하고 음식도 가리는 게 별로 없으며, 성격이 급해서 누가 우물쭈물 하는 것을 보지 못하고 화를 잘 내지만 금새 풀려서 상대방의 감정을 잘 풀어줍니다. 
특히 사람을 사귀고 다루는 수단이 좋아 생면부지의 사람과 만나도 금세 사귀고, 그들에게 호감을 받으며, 연애관은 좋아하는 상대가 있으면 이것 저것 재지 않고 과감하게 프로포즈하는 타입이며, 좋고 싫은 표현이 확실하여 숨기지 않는 그런 사람입니다. 

반면, 이 여성은 성격이 강하고 솔직하며, 개성이 있고 생활력이 강합니다. 
특히 분위기에 흔들리지 않고 감언이설에 잘 넘어가지 않으며, 명분을 좋아해서 명분 없는 일은 설사 유혹에 이끌릴지라도 절대 행하지 않습니다. 그리고 개방적이며 이상보다 현실에 충실하고 시대의 흐름에 민감합니다. 
반면 바람기가 있는 것 같으면서도 방종하지 않고, 사치와 허영에 빠지지 않으며, 자기 관리에 철저하여 감정에 치우쳐 과오를 범하지 않으며, 정조관념도 강합니다. 결혼해서는 혹 남편이 잘못하면 그것을 눈감아 주지 않고 트집잡고, 바가지도 잘 긁어대며, 남편의 바람기를 용납하지 않습니다. 
따라서 웬만한 남성은 이 여성에게 쩔쩔매게 되고, 남편을 공처가로 만들기 쉽습니다. 그러나 이해심은 남성 못지않아서 금세 풀어지며, 가정을 위해 최대한의 노력을 아끼지 않을 믿음직스러운 아내의 상입니다. ",
"남성과 여성의 음양이 양과 음으로 잘 조화되었으며, 정배합을 이룬 최상의 부부관계 입니다. 따라서 부부로 맺어지면 어떤 일이 있어도 헤어지지 않고 해로할 것이며, 자손 운도 좋습니다. 
물론 각자 타고난 본분에 따라 생활형편이 다르겠지만 궁합으로서는 더 이상 바랄게 없습니다. 남편은 아내를 위해서 무엇이든 해줄 것이며, 아내는 남편에게 다소 결점이 있더라도 그것만으로는 싫어하지 않겠습니다. 

구체적으로 이 남성은 누구보다 두뇌회전이 빠릅니다. 그러다 보면 자기 꾀에 스스로 넘어가기도 하나 대개는 시대의 흐름에 민감해서 처세를 잘하며, 사업경영도 적절히 함으로써 남보다 앞서는 사람입니다. 비록 겉은 까다로워 보여도 수더분하고 음식도 가리는 게 별로 없으며, 성격이 급해서 누가 우물쭈물 하는 것을 보지 못하고 화를 잘 내지만 금새 풀려서 상대방의 감정을 잘 풀어줍니다. 
특히 사람을 사귀고 다루는 수단이 좋아 생면부지와 사람과 만나도 금세 사귀고, 그들에게 호감을 받으며, 연애관은 좋아하는 상대가 있으면 이것 저것 재지 않고 과감하게 프로포즈하는 타입이며, 좋고 싫은 표현이 확실하여 숨기지 않는 그런 사람입니다. 

반면, 이 여성은 약고 재치가 있으며 친절하면서도 남성 못지않은 이해심과 아량으로 때로는 좋은 일을 위해서 다소의 손해도 불사합니다. 그리고 특별한 용모를 갖추지 않았더라도 사람을 끄는 매력이 있어 아무리 수수한 차림새라도 야해 보이고 바람기가 있어 보이며, 부담감이 없게 느껴지는 여성이어서 남성들의 유혹을 많이 받게 됩니다. 
가정을 아름답게 꾸미는데 취미와 소질이 있고, 평범한 삶보다 이상적인 생활환경, 삶의 멋을 추구하는 타입이어서 세상의 이목이나 경제적 구애가 없다고 가정할 때 이 여성은 멋진 연애를 하고 싶고, 결혼 후에도 가장 호화롭고 사치스러운 삶을 영위하고자 할 것입니다. 그리고 서비스가 만점이라서 남편한테 베푸는 애정과 서비스는 그 누구도 따라오지 못합니다. 
좋아하는 남성상은 의젓하고 개성 있고 주관이 뚜렷한 남성을 좋아하며, 자신이 남성을 지배하기를 원하지 않으며, 남편으로 섬기고 싶어합니다. 그렇지 않으면 소위 제비족인 남성에게 유혹당할 우려가 있습니다. ",
"두 사람의 결합을 궁합적인 측면에서 보면 그리 좋은 관계는 아닙니다. 
남녀가 모두 양이고 여성이 남성에게 해를 끼치니 남녀 위계가 거꾸로 되었다고 할 수 있으며, 두 사람의 관계는 마치 활활 타오르는 불길을 물로 꺼버리는 형상입니다. 이런 배합일 경우, 아내가 가정적으로, 또는 사회적으로 우위에 있어 주도권을 쥐어야만 가정생활이 유지될 것입니다. 
따라서 남편은 아내의 결정대로 따라가야 하는 관계라면 무방하나, 결코 만만치 않은 이 남성의 특성을 볼 때 충돌할 가능성이 높아 화합을 이루기가 어렵습니다. 단, 여성이 유순한 성격을 타고나 매사 양보하는 입장이라면 극단적인 충돌은 없을 것입니다. 

구체적으로 이 남성은 누구보다 두뇌회전이 빠릅니다. 그러다 보면 자기 죄에 스스로 넘어가기도 하나 대개는 시대의 흐름에 민감해서 처세를 잘하며, 사업경영도 적절히 함으로써 남보다 앞서는 사람입니다. 비록 겉은 까다로워 보여도 수더분하고 음식도 가리는 게 별로 없으며, 성격이 급해서 누가 우물쭈물 하는 것을 보지 못하고 화를 잘 내지만 금새 풀려서 상대방의 감정을 잘 풀어줍니다. 
특히 사람을 사귀고 다루는 수단이 좋아 생면부지의 사람과 만나도 금세 사귀고, 그들에게 호감을 받으며, 연애관은 좋아하는 상대가 있으면 이것 저것 재지 않고 과감하게 프로포즈하는 타입이며, 좋고 싫은 표현이 확실하여 숨기지 않는 그런 사람입니다. 

반면, 이 여성은 명랑하고 활발하며 부끄러움을 타지 않고 시원스럽습니다. 또한 성깔도 있고 억센 듯하지만 여성이 갖추어야 할 애교와 매력도 있습니다. 즉, 여성이면서도 배짱이 있고 폭 넓은 아량과 남을 위해 봉사하고 이해하는데 인색하지 않으며, 웬만한 일은 스스로 해결하며 무슨 일에나 태도가 분명합니다. 
혹 낭만적인 면이 있어 기분에 따라서 씀씀이가 크지만 계획 없는 낭비는 하지 않으며, 써야 할 일이면 손이 크다는 평을 들을 만큼 멋지게 쓰는 타입입니다. 만일 이 여성에게 경제력만 허용된다면 평소에 꿈·꾸던 이상을 실현하여 낙원 같은 가정을 만들어 놓을 것입니다. 
단, 남편을 이끌려 하고 시시한 남성은 깔보는 경향이 있으나, 일단 결혼한 뒤에는 그 남편의 인격 여하를 막론하고 아내로서의 본분을 다할 것입니다. 그리고 명분을 존중하여 도리에 어긋나는 행동은 절대로 하지 않는 부인상입니다. ",
"음양의 조화가 그런대로 이루어졌으므로 운명상의 해는 없습니다. 
독선적이고 참을성이 부족한 남편의 결점을 차분하고 깐깐한 아내가 적당히 견제하여 조화를 이를 수도 있습니다. 단, 남성이 여성에게 제압당해 가정의 주도권을 아내가 쥐고 살아가야 무난합니다. 즉, 남편이 아내에게 저주는 형식으로 살아간다면 오히려 자신에게 이로울 것이며, 아내는 알뜰하고 섬세한 자신의 개성을 살려 이상적인 가정을 이루게 될 것입니다. 

구체적으로 이 남성은 누구보다 두뇌회전이 빠릅니다. 그러다 보면 자기 뫼에 스스로 넘어가기도 하나 대개는 시대의 흐름에 민감해서 처세를 잘하며, 사업경영도 적절히 함으로써 남보다 앞서는 사람입니다. 비록 겉은 까다로워 보여도 수더분하고 음식도 가리는 것이 별로 없으며, 성격이 급해서 누가 우물쭈물 하는 것을 보지 못하고 화를 잘 내지만 금새 풀려서 상대방의 감정을 잘 풀어줍니다. 
특히 사람을 사귀고 다루는 수단이 좋아 생면부지의 사람과 만나도 금세 사귀고, 그들에게 호감을 받으며, 연애관은 좋아하는 상대가 있으면 이것 저것 재지 않고 과감하게 프로포즈하는 타입이며, 좋고 싫은 표현이 확실하여 숨기지 않는 그런 사람입니다. 

반면, 이 여성은 내성적이고 부끄러움을 잘 타며 얌전해서 한극적인 여성상입니다. 그래서 어른들이 가장 좋아할 만한 며느리감이며, 설사 말괄량이 모습을 보인다고 해도 겉보기만 그럴 뿐 막상 자기가 좋아하는 남성 앞에서는 어쩔 수 없이 수줍음을 탑니다. 
애정관은 순정파로 한번 누구를 사랑하면 딴마음을 두지 않고 진심으로 헌신적인 애정을 베풀며, 혹 남성이 자기를 싫어해도 쉽게 단념하지 않습니다. 때문에 만약 남성으로부터 배신을 당하면 자기가 정을 준 만큼 증오하고 저주하게 됩니다. 따라서 이 여성과 교제중인 남성들은 만약 일시적으로 사귈 예정이라면 아예 상처를 주지 않는 것이 좋을 것입니다. 
남성은 이런 여성을 아내로 맞이한다면 복입니다. 희생적인 봉사정신과 순정, 현모양처의 조건을 다 갖춘 사람과 결혼한다면, 부자면 말할 것도 없고 비록 궁해도 아껴만 준다면 불평 없이 알뜰하고 성실하게 살아가는 아내가 될 것이기 때문입니다."),
array("남성은 음이고, 여성은 양이므로, 여성이 남성을 생하는 상생궁합 입니다. 
약간 철이 없는 듯하고 침착성이 부족하며 변덕스러운 듯한 남편한테 아내는 좀 손해를 보면서 살아가겠으나, 아내로서는 큰 불평 없이 남편을 이해하면서 잘 이끌어 나갈 수 있습니다. 그러므로 남편은 아내의 내조를 잘 받아들여 고집 부리지 말고 아내의 리드에 따라간다면 좋은 가정을 이룰 것입니다.

구체적으로 이 남성은 고지식하고 솔직해서 남을 속일 줄도 모르며, 혹 어쩔 수 없이 속였다 해도 그것이 불안하여 스스로 고백하고 맙니다. 또한 사람을 잘 따르고 사귀기도 잘 하지만 한번 오해를 하거나 미워하면 좀처럼 꽁한 마음을 풀지 못하고 노골적으로 싫어하는 감정을 나타내어 괜한 적을 만드는 경우도 있습니다. 
반대로, 남의 일, 자기 일 가릴 것 없이 손대기만 하면 몸을 아끼지 않으며, 칭찬 듣기를 좋아하고 누가 잘해 주면 그 보답을 꼭 하려고 합니다. 그만큼 의리가 있으나 복수심도 강하고 집요한 면도 있어 잘못 건드리면 무척 애를 먹게 됩니다. 그러므로 이 남성에게는 상대방에서도 적대시할 수 없으며, 부부관계에서도 아내가 결정적인 잘못만 없으면 매우 너그럽게 대해 주며, 아내의 의견을 십분 존중하여 잘 따라 주기도 합니다. 

반면 이 여성은 명랑하고 활발하며 외향적이고 생활력이 매우 강합니다. 
그래서 본래 남에게 위축되지 않는 성격으로 부끄럼을 타지 않으며, 이해심이 많으나 반면, 자존심과 자부심이 무척 강하여 결혼해서 설사 남편이 바람을 피우거나 무관심하게 대해도 드러내놓고 질투를 하거나 투정을 부리지는 않습니다. 아니 겁내지 않는다는 표현이 맞습니다. 즉 '나 혼자도 잘 살 수 있다'는 자신감이 있기 때문입니다. 
그렇다고 가정에서 남편을 무시하거나 하지 않으며, 단 애정의 포로가 되어 울고불고하지 않으며, 바람을 피우지도 않습니다. 또한 검소하게 살면서 한푼 두푼 저축하는 사람이므로 의존적이고 낭비벽이 있거나 결단력이 부족한 남성의 아내로 좋습니다. ",
"남녀가 모두 음이지만 남성이 나무고 여성이 불이어서 서로 상생하니 큰 충돌이 없는 결합입니다. 그리고 남성은 솔직하고 적극적이며 자부심이 강하고, 좋고 나쁜 감정을 그대로 나타내는 성격이므로 가정은 항상 명랑할 것입니다. 
또한 여성다운 아내가 그지없이 사랑스러워 흐뭇하고 너그러워지며, 아내의 입장에서는 다소 남편에게 못마땅한 점이 있어도 그것을 긍정적으로 받아들여 신경을 쓰지 않으므로 불화가 없는 가정을 이룰 것입니다. 

구체적으로 이 남성은 고지식하고 솔직해서 남을 속일 줄도 모르며, 혹 어쩔 수 없이 속였다 해도 그것이 불안하여 스스로 고백하고 맙니다. 또한 사람을 잘 따르고 사귀기도 잘 하지만 한번 오해를 하거나 미워하면 좀처럼 꽁한 마음을 풀지 못하고 노골적으로 싫어하는 감정을 나타내어 괜한 적을 만드는 경우도 있습니다. 
반대로, 남의 일, 자기 일 가릴 것 없이 손대기만 하면 몸을 아끼지 않으며, 칭찬 듣기를 좋아하고 누가 잘해 주면 그 보답을 꼭 하려고 합니다. 그만큼 의리가 있으나 복수심도 강하고 집요한 면도 있어 잘못 건드리면 무척 애를 먹게 됩니다. 그러므로 이 남성에게는 상대방에서도 적대시할 수 없으며, 부부관계에서도 아내가 결정적인 잘못만 없으면 매우 너그럽게 대해 주며, 아내의 의견을 십분 존중하여 잘 따라 주기도 합니다. 

반면, 이 여성은 현모양처의 표상으로, 누구라도 이 여성을 아내로 맞이한다면 행복한 남성이라 해도 지나친 말이 아닐 것입니다. 활발하고 명랑하면서도 버릇없거나 거칠지 않고, 얌전하면서도 꽁하거나 고집스러운 타입이 아닙니다. 오히려 너무 여성적이고 평범하기에 개성이 없는 것 같으나 그 자체가 바로 이 여성의 장점이며, 튀는 매력은 없어도 싫증이 나지 않는 사람입니다. 
또한 살림살이를 운영함에 있어서, 쓸 때는 쓰면서도, 아낄 때는 아끼고, 즉, 낭비를 하거나 인색하지도 않으며, 가정 주부로서의 사명을 다합니다. 결코 분위기에 휩싸여 시간을 망각하는 일도 없으며, 배우자가 커다란 실수를 하여도, 자신의 잘못을 솔직하게 시인하고 용서를 빈다면 스스럼없이 용서해 줄 그런 여인입니다. 
결론적으로 이 여성은 아내로서 엄마로서의 도리를 다할 수 있는 바탕이 되어있는 이상적인 주부라고 하겠습니다.",
"좋지도 나쁘지도 않은 결합입니다. 
남성이 음이고 여성은 양이어서 음양이 조화되었으며, 불과 불이 만났으니 성격적으로 서로 참을성이 부족하고 즉흥적이며 자기 기분대로 살아가려고 하기 때문에 조화를 이루기 어렵습니다. 단, 기분이 좋을 때는 세상에 둘도 없이 다정하나 오래가지 못하며, 대수롭지 않은 일로 부부싸움을 하게 되는데, 이것은 불과 불의 특성 때문이므로 인내하고 참아야만 결혼 생활을 끝까지 지속할 것입니다. 

구체적으로 이 남성은 고지식하고 솔직해서 남을 속일 줄도 모르며, 혹 어쩔 수 없이 속였다 해도 그것이 불안하여 스스로 고백하고 맙니다. 또한 사람을 잘 따르고 사귀기도 잘 하지만 한번 오해를 하거나 미워하면 좀처럼 꽁한 마음을 풀지 못하고 노골적으로 싫어하는 감정을 나타내어 괜한 적을 만드는 경우도 있습니다. 
반대로, 남의 일, 자기 일 가릴 것 없이 손대기만 하면 몸을 아끼지 않으며, 칭찬 듣기를 좋아하고 누가 잘해 주면 그 보답을 꼭 하려고 합니다. 그만큼 의리가 있으나 복수심도 강하고 집요한 면도 있어 잘못 건드리면 무척 애를 먹게 됩니다. 그러므로 이 남성에게는 상대방에서도 적대시할 수 없으며, 부부관계에서도 아내가 결정적인 잘못만 없으면 매우 너그럽게 대해 주며, 아내의 의견을 십분 존중하여 잘 따라 주기도 합니다. 

반면, 이 여성의 외형은 세련미가 있으나, 다소 건방져 보이기도 하고 신경질적이며 까다롭게 보이나, 내면은 겁이 많고 연약하며 순진한 면이 있습니다. 따라서 일단 연애를 하거나 아내로 맞이하면 하루가 다르게 새로운 매력에 이끌리게 될 것입니다. 솔직하고 명랑하며, 애교로서 남편의 마음을 사로잡을 것이며, 살림을 알뜰하게 꾸려 나가고 남편의 사업이나 출세에 적극적인 협력자가 되어 줄 것입니다. 
또한 이 여성은 마음에 드는 남성이 발견되면 먼저 용감하게 사랑을 고백하는 대담성도 있으나, 우물쭈물 시간만 끄는 남성은 흥미가 없어 합니다. 즉, 남성이 적극적으로 과감하게 프로포즈해 주기를 바라는 한편, 로맨틱한 감상은 좋아하지 않는 형으로 달콤한 애정 표현이나 유혹 따위에는 넘어가질 않습니다. 그리고 연애와 결혼은 다르다는 생각을 갖고 있으므로, 연애 상대자로서의 남성은 잘생기고, 세련된 남성을 선택하나, 결혼 상대자는 경제력이 있거나 사회적으로 어느 정도 위치에 있어야만 마음이 움직이게 됩니다. 그러나 화목한 가정을 가꾸려면 경제력 보다는 원만한 성격의 남성을 만나야 합니다.",
"그리 좋은 결합이라고 하기 어렵습니다. 
조급하고 단순하며 기분파인 두 사람이 결합하면 마치 철부지처럼 좋을 때는 한없이 좋으나, 한번 충돌이 생기면 나중의 일은 고려하지도 않고 감정이 내키는 대로 행동하여 결정적인 불행을 자초할 우려가 있으므로, 만약 결혼을 하게 된다면 이점에 주의를 하셔야 합니다. 

구체적으로 이 남성은 고지식하고 솔직해서 남을 속일 줄도 모르며, 혹 어쩔 수 없이 속였다 해도 그것이 불안하여 스스로 고백하고 맙니다. 
또한 사람을 잘 따르고 사귀기도 잘 하지만 한번 오해를 하거나 미워하면 좀처럼 꽁한 마음을 풀지 못하고 노골적으로 싫어하는 감정을 나타내어 괜한 적을 만드는 경우도 있습니다. 반대로, 남의 일, 자기 일 가릴 것 없이 손대기만 하면 몸을 아끼지 않으며, 칭찬 듣기를 좋아하고 누가 잘해 주면 그 보답을 꼭 하려고 합니다. 그만큼 의리가 있으나 복수심도 강하고 집요한 면도 있어 잘못 건드리면 무척 애를 먹게 됩니다. 그러므로 이 남성에게는 상대방에서도 적대시할 수 없으며, 부부관계에서도 아내가 결정적인 잘못만 없으면 매우 너그럽게 대해 주며, 아내의 의견을 십분 존중하여 잘 따라 주기도 합니다. 

반면, 이 여성은 활발하고 외향적이면서 인정이 많습니다. 또 좋고 싫은 것이 분명해서, 누구든 한 번 좋아하면 가식 없이 따르고, 한 번 미워하면 노골적으로 싫은 것을 나타냅니다. 
그리고 마음이 약해서 남의 어려운 청을 거절하지 못하며, 미혼시절에 별로 좋아하지 않는 남성에게 차마 냉정하게 대하지 못하는 약점 때문에 당하지 않아도 될 곤욕을 당하거나, 심지어는 끈질긴 구애를 거절하지 못해 결혼까지 하게 쥘 수도 있습니다. 따라서 이 점에 주의해야 평생 동안 후회가 없을 것입니다. 
반면 결혼해서는 생활력이 강하여 남편 일을 잘 거들고 맞벌이도 주저하지 않습니다. 이 여성을 배우자로 맞이했거나 하려는 남성은 상대의 자존심을 상하게 하는 말을 해서는 안되며, 진심어린 애정의 표시를 하십시오. 그것이 전달된다면 아내는 남편을 위해 어떤 일도 불사할 수 있는 아름다운 성격의 소유자입니다.",
"여성은 남성을 이끌어 가기를 원하며, 결혼해서도 가정의 경제권을 비롯해 모든 결정권을 자신에게 일임해 주기를 바랍니다.
이런 여성의 요구를 이 남성은 받아들일 수 있는 좋은 남편감이라고 하겠습니다. 다만 어쩌다가 크게 싸우면 서로 충격을 받을 만한 언행을 주고받음으로써 애정에 금이 갈 우려가 있으니 이 점만 주의하면 좋은 가정을 영위해 나갈 것입니다. 

구체적으로 이 남성은 고지식하고 솔직해서 남을 속일 줄도 모르며, 혹 어쩔 수 없이 속였다 해도 그것이 불안하여 스스로 고백하고 맙니다. 또한 사람을 잘 따르고 사귀기도 잘 하지만 한번 오해를 하거나 미워하면 좀처럼 꽁한 마음을 풀지 못하고 노골적으로 싫어하는 감정을 나타내어 괜한 적을 만드는 경우도 있습니다. 
반대로, 남의 일, 자기 일 가릴 것 없이 손대기만 하면 몸을 아끼지 않으며 칭찬 듣기를 좋아하고 누가 잘해 주면 그 보답을 꼭 하려고 합니다. 그만큼 의리가 있으나 복수심도 강하고 집요한 면도 있어 잘못 건드리면 무척 애를 먹게 됩니다. 그러므로 이 남성에게는 상대방에서도 적대시할 수 없으며, 부부관계에서도 아내가 결정적인 잘못만 없으면 매우 너그럽게 대해 주며, 아내의 의견을 십분 존중하여 잘 따라 주기도 합니다. 

반면, 이 여성은 똑똑하고 대담하며 노련한 여장부격인 사람으로, 부드럽고 애교스럽거나 야한 맛을 풍기지는 않으나 세련되고 침착하며, 개성이 강해서 분위기에 잘 말려들지 않고 남의 꼬임에도 넘어가지 않습니다. 그래서 남성이 유혹하기에 가장 힘들고 다루기 어려운 타입의 여성형입니다. 그러나 좋아하는 사람에게는 깊은 애정을 쏟으며, 설사 금전적으로 손해를 보더라도 애정을 쏟기도 합니다. 이처럼 애정면에서 적극적이어서 누가 먼저 프로포즈하건 사귐이 빠르게 진행되며, 시일 을 기다리면서 이것저것 재지 않고 즉흥적인 판단을 내립니다. 
반면 좋아하는 남성상은 강한 남성미 보다는, 곱고 단아하면서도 유약해 보이는 남성을 좋아하며, 정조 그 자체를 대단하게 여기지는 않으나 고고하고 도도한 성격 탓에 함부로 몸을 허락하는 행동을 하지는 않습니다. 
남편은 사회적, 경제적으로 상당한 위치에 있는 남성이라야 이 여성을 이끌 수 있으며, 아니면 차라리 여성이 주도권을 쥐고 남편이 아내의 의견에 따라가는 부부관계가 형성되어야 집안이 평안할 것입니다.",
"남성은 불이고 여성은 흙으로서 좋은 상생궁합 입니다. 
다만 남녀가 모두 자존심이 강하여 양보하는 데 인색할 우려가 있습니다. 따라서 두 사람이 부부관계를 맺으려면 남성이 먼저 이해와 애정으로 아내를 다독거리며 살아가야 하며, 그렇게 한다면 알뜰한 아내는 정성어린 내조를 아끼지 않을 것입니다. 따라서 남편의 입장에서 아내를 얼마만큼 아끼느냐에 따라 가정의 화목이 결정된다는 것을 잊지 마십시오.

구체적으로 이 남성은 고지식하고 솔직해서 남을 속일 줄도 모르며, 혹 어쩔 수 없이 속였다 해도 그것이 불안하여 스스로 고백하고 맙니다. 또한 사람을 잘 따르고 사귀기도 잘 하지만 한번 오해를 하거나 미워하면 좀처럼 꽁한 미움을 풀지 못하고 노골적으로 싫어하는 감정을 나타내어 괜한 적을 만드는 경우도 있습니다. 
반대로, 남의 일, 자기 일 가릴 것 없이 손대기만 하면 몸을 아끼지 않으며, 칭찬 듣기를 좋아하고 누가 잘해 주면 그 보답을 꼭 하려고 합니다. 그만큼 의리가 있으나 복수심도 강하고 집요한 면도 있어 잘못 건드리면 무척 애를 먹게 됩니다. 그러므로 이 남성에게는 상대방에서도 적대시할 수 없으며, 부부관계에서도 아내가 결정적인 잘못만 없으면 매우 너그럽게 대해 주며, 아내의 의견을 십분 존중하여 잘 따라 주기도 합니다. 

반면, 이 여성은 총명하고 약고 깜짝하며, 다소 신경질적이나 재치가 번득이는 사람입니다. 또한 보수적인 면이 있으면서도, 현대적인 것도 취하고, 가정적이어서 알뜰하고 절약성이 강한 주부상으로 조금도 흠이 없습니다. 단, 남편에게 정도 이상으로 간섭하는 경향이 있으나, 명분상 남편의 위신을 세워 주며, 타인이 그것을 느낄 수 있도록 정성을 기울입니다. 
그리고 사람을 대할 때 앞에서는 그를 추켜 주고 비위를 맞추나 진심이 아닌 경우가 많습니다. 즉, 자신에게 유리한 사람에게는 자세도 낮추고 겸손하여 상대의 호감을 사려고 노력하지만 그렇지 않으면 사귀지 않습니다. 이러한 이해타산은 생황을 하면서도 나타나 궁해도 궁한 체하지 않고 과시하기를 좋아하며, 명예나 이익 관리에 지혜로울 정도로 처신합니다. 
따라서 이 여성을 아내로 맞이한다면, 아내의 재치와 순발력, 총명한 두뇌를 잘 수용하고 결점을 잘 타일러 간다면 최상의 반려자가 될 것입니다.",
"두 사람의 관계는 정배합으로서 남편과 아내의 오행 위치가 바르게 되었습니다. 
좀 억세고 까다로운 성격의 이 여성은 다른 남성을 깔보더라도 왠지 이 남성한테는 기가 누그러지게 되므로, 결혼을 해서 가정을 꾸려간다면 다소 성격적으로 서로 못마땅한 점이 있어도 묘하게 조화를 이루어 평생을 함께 해로 하겠습니다. 

구체적으로 이 남성은 고지식하고 솔직해서 남을 솔일 줄도 모르며, 혹 어쩔 수 없이 속였다 해도 그것이 불안하여 스스로 고백하고 맙니다. 또한 사랑을 잘 따르고 사귀기도 잘 하지만 한번 오해를 하거나 미워하면 좀처럼 꽁한 마음을 풀지 못하고 노골적으로 싫어하는 감정을 나타내어 꾀한 적을 만드는 경우도 있습니다. 
반대로, 남의 일, 자기 일 가릴 것 없이 손대기만 하면 몸을 아끼지 않으며 칭찬 듣기를 좋아하고 누가 잘해 주면 그 보답을 꼭 하려고 합니다. 그만큼 의리가 있으나 복수심도 강하고 집요한 면도 있어 잘못 건드리면 무척 애를 먹게 됩니다. 그러므로 이 남성에게는 상대방에서도 적대시할 수 없으며, 부부관계에서도 아내가 결정적인 잘못만 없으면 매우 너그럽게 대해 주며, 아내의 의견을 십분 존중하여 잘 따라 주기도 합니다. 

반면, 이 여성은 성격이 강하고 솔직하며, 개성이 있고 생활력이 강합니다. 특히 분위기에 흔들리지 않고 감언이설에 잘 넘어가지 않으며, 명분을 좋아 해서 명분 없는 일은 설사 유혹에 이끌릴지라도 절대 행하지 않습니다. 그리고 개방적이며 이상보다 현실에 충실하고 시대의 흐름에 민감합니다. 
반면 바람기가 있는 것 같으면서도 방종하지 않고, 사치와 허영에 빠지지 않으며, 자기 관리에 철저하여 감정에 치우쳐 과오를 범하지 않으며, 정조관념도 강합니다. 결혼해서는 혹 남편이 잘못하면 그것을 눈감아 주지 않고 트집잡고, 바가지도 잘 긁어대며, 남편의 바람기를 용납하지 않습니다. 따라서 웬만한 남성은 이 여성에게 쩔쩔매게 되고, 남편을 공처가로 만들기 쉽습니다. 
그러나 이해심은 남성 못지않아서 금세 풀어지며, 가정을 위해 최대한의 노력을 아끼지 않을 믿음직스러운 아내의 상입니다.",
"궁합자체로 볼 때, 운명적인 만남은 나쁘다고 평할 수 없으나 성격 차이가 크다는 것이 흠입니다. 
남녀 모두가 음 대 음이라서 조화를 이루지 못했으나, 부부간의 위계는 바르게 된 배합 입니다. 약간 자유분방해서 구속을 싫어하는 아내와 그것을 용납하지 않는 남편, 듬직한 남성을 좋아하는 여성과 좀 경망스러울 가능성이 있는 남성, 이런 면에서 봄 때 아무래도 성격차이가 크나, 남편이 아내의 충고를 긍정적으로 받아들여 고치면서 살아간다면 기타의 문제는 염려할 게 없겠습니다. 

구체적으로 이 납성은 고지식하고 솔직해서 남을 속일 줄도 모르며, 흑 어쩔 수 없이 속였다 해도 그것이 불안하여 스스로 고백하고 맙니다. 또한 사람을 잘 따르고 사귀기도 잘 하지만 한번 오해를 하거나 미워하면 좀처럼 꽁한 마음을 풀지 못하고 노골적으로 싫어하는 감정을 나타내어 괜한 적을 만드는 경우도 있습니다. 
반대로, 남의 일, 자기 일 가릴 것 없이 손대기만 하면 몸을 아끼지 않으며, 칭찬 듣기를 좋아하고 누가 잘해 주면 그 보답을 꼭 하려고 합니다. 그만큼 의리가 있으나 복수심도 강하고 집요한 면도 있어 잘못 건드리면 무척 애를 먹게 됩니다. 그러므로 이 남성에게는 상대방에서도 적대시할 수 없으며, 부부관계에서도 아내가 결정적인 잘못만 없으면 매우 너그럽게 대해 주며, 아내의 의견을 십분 존중하여 잘 따라 주기도 합니다. 

반면, 이 여성은 약고 재치가 있으며 친절하면서도 남성 못지않은 이해심과 아량으로 때로는 좋은 일을 위해서 다소의 손해도 불사합니다. 그리고 특별한 용모를 갖추지 않았더라도 사람을 끄는 매력이 있어 아무리 수수한 차림새라도 야해 보이고 바람기가 있어 보이며, 부담감이 없게 느껴지는 여성이어서 남성들의 유혹을 많이 받게 됩니다. 가정을 아름답게 꾸미는 데 취미와 소질이 있고, 평범한 삶보다 이상적인 생활환경, 삶의 멋을 추구하는 타입이어서 세상의 이목이나 경제적 구애가 없다고 가정할 때 이 여성은 멋진 연애를 하고 싶고, 결혼 후에도 가장 호화롭고 사치스러운 삶을 영위하고자 할 것입니다. 
그리고 서비스가 만점이라서 남편한테 베푸는 애정과 서비스는 그 누구도 따라오지 못합니다. 좋아하는 남성상은 의젓하고 개성 있고 주관이 뚜렷한 남성을 좋아하며, 자신이 남성을 지배하기를 원하지 않으며, 남편으로 섬기고 싶어합니다. 그렇지 않으면 소위 제비족인 남성에게 유혹당할 우려가 있습니다.",
"물에 해당하는 아내와 불에 해당하는 남편은 얼핏 봐서 매우 불리한 궁합 같으나 꼭 그렇지만은 않습니다. 
두 사람은 서로 합을 이루어 좋아하게 되어 있으며, 다만 오행관계로 볼 때 여성이 남성을 지배하는 위치에 있으므로 부부간의 형태를 바꾸어 살아가면 무난한 생활을 영위할 수 있을 것입니다. 즉, 남성은 아내의 내조를 받아들이면서 살림을 아내에게 일임하고 살아간다면, 너그럽고 슬기로운 아내는 가정사는 물론 사회적인 활동까지도 도맡아 가정의 치부에 결정적인 공을 세울 것입니다. 

구체적으로 이 남성은 고지식하고 솔직해서 남을 속일 줄도 모르며, 혹 어쩔 수 없이 속였다 해도 그것이 불안하여 스스로 고백하고 맙니다. 또한 사람을 잘 따르고 사귀기도 잘 하지만 한번 오해를 하거나 미워하면 좀처럼 꽁한 마음을 풀·지 못하고 노골적으로 싫어하는 감정을 나타내어 괜한 적을 만드는 경우도 있습니다. 
반대로, 남의 일, 자기 일 가릴 것 없이 손대기만 하면 몸을 아끼지 않으며, 칭찬 듣기를 좋아하고 누가 잘해 주면 그 보답을 꼭 하려고 합니다. 그만큼 의리가 있으나 복수심도 강하고 집요한 면도 있어 잘못 건드리면 무척 애를 먹게 됩니다. 그러므로 이 남성에게는 상대방에서도 적대시할 수 없으며, 부부관계에서도 아내가 결정적인 잘못만 없으면 매우 너그럽게 대해 주며, 아내의 의견을 십분 존중하여 잘 따라 주기도 합니다. 

반면, 이 여성은 명랑하고 활발하며 부끄러움을 타지 않고 시원스럽습니다. 또한 성깔도 있고 억신 듯하지만 여성이 갖추어야 할 애교와 매려도 있습니다. 즉, 여성이면서도 배짱이 있고 폭 넓은 아량과 남을 위해 봉사하고 이해하는데 인색하지 않으며, 웬만한 일은 스스로 해결하며 무슨 일에나 태도가 분명합니다. 혹 낭만적인 면이 있어 기분에 따라서 씀씀이가 크지만 계획 없는 낭비는 하지 않으며 써야 할 일이면 손이 크다는 평을 들을 만큼 멋지게 쓰는 타입입니다. 
만일 이 여성에게 경제력만 허용된다면 평소에 꿈꾸던 이상을 실현하여 낙원 같은 가정을 만들어 놓을 것입니다. 단, 남편을 이끌려 하고 시시한 남성은 깔보는 경향이 있으나, 일단 결혼한 뒤에는 그 남편의 인격 여하를 막론하고 아내로서의 본분을 다할 것입니다. 그리고 명분을 존중하여 도리에 어긋나는 행동은 절대로 하지 않는 부인상입니다.",
"남성이 불이고, 여성이 물이어서 서로 상충하여 좋지 않습니다. 따라서 서로가 상대를 업신여기고 미워하며 성격 차이도 심해 불화가 자주 발생할 수 있으며, 또한 한번 싸우게 되면 먼저 화해하려 하지 않고 자존심만 세워 냉전이 매우 오래가겠습니다. 
두 사람은 실상 서로 다루기 어려운 성격이 아닌데도 이들 남녀는 스스로가 벅차게 생각되어지므로 아직 혼인을 하지 않고 망설이는 중이라면 헤어지는 것이 오히려 좋을 수 있습니다. 

구체적으로 이 남성은 고지식하고 솔직해서 남을 속일 줄도 모르며, 흑 어쩔 수 없이 속였다 해도 그것이 불안하여 스스로 고백하고 맙니다. 또한 사람을 잘 따르고 사귀기도 잘 하지만 한번 오해를 하거나 미워하면 좀처럼 꽁한 마음을 풀지 못하고 노골적으로 싫어하는 감정을 나타내어 괜한 적을 만드는 경우도 있습니다. 
반대로, 남의 일, 자기 일 가릴 것 없이 손대기만 하면 몸을 아끼지 않으며, 칭찬 듣기를 좋아하고 누가 잘해 주면 그 보답을 꼭 하려고 합니다. 그만큼 의리가 있으나 복수심도 강하고 집요한 면도 있어 잘못 건드리면 무척 애를 먹게 됩니다. 그러므로 이 남성에게는 상대방에서도 적대시할 수 없으며, 부부관계에서도 아내가 결정적인 잘못만 없으면 매우 너그럽게 대해 주며, 아내의 의견을 십분 존중하여 잘 따라 주기도 합니다. 

반면, 이 여성은 내성적이고 부끄러움을 잘 타며 얌전해서 한국적인 여성상입니다. 
그래서 어른들이 가장 좋아할 만한 며느리감이며, 설사 말괄량이 모습을 보인다고 해도 겉보기만 그럴 뿐 막상 자기가 좋아하는 남성 앞에서는 어쩔 수 없이 수줍음을 탑니다. 
애정관은 순정파로 한번 누구를 사랑하면 딴마음을 두지 않고 진심으로 헌신적인 애정을 베풀며, 혹 남성이 자기를 싫어해도 쉽게 단념하지 않습니다. 때문에 만약 남성으로부터 배신을 당하면 자기가 정을 준 만큼 증오하고 저주하게 됩니다. 따라서 이 여성과 교제중인 남성들은 만약 일시적으로 사귈 예정이라면 아예 상처를 주지 않는 것이 좋을 것입니다. 
남성은 이런 여성을 아내로 맞이한다면 복입니다. 희생적인 봉사정신과 순정, 현모양처 의 조건을 다 갖춘 사람과 결혼한다면, 부자면 말할 것도 없고 비록 궁해도 아껴만 준다면 불평 없이 알뜰하고 성실하게 살아가는 아내가 될 것이기 때문입니다."),
array("여성은 나무이고 남성은 토양으로, 여성이 남성을 극하는 상극 궁합입니다. 
그런데 만약 음양이 서로 다르다면 충돌하는 것이 다소 적을 수 있으나, 두 사람은 같은 음양이기 때문에 싸움이 치열하겠습니다. 따라서 이 결합은 궁합적으로 볼 때 매우 불리한 결합입니다. 결혼해서도 의견 대립이 빈번하고, 걸핏하면 충돌이 일어나 가정이 조용한 날이 없으며, 만약 이미 부부로 맺어진 경우라면 남편이 저주는 형식으로 주도권을 아내에게 일임해서 아내의 의사대로 따라간다면 화목이 유지될 것입니다. 

구체적으로 이 남성은 성실하고 부지런하며 개성이 강합니다. 
반면 애증이 극단적이어서 마음에 들면 특별히 잘 해 주지만 별로 이해관계가 없는 사람에게는 아무리 가까운 사이라 할지라도 몰인정할 만큼 냉정하며, 남을 용서하고 이해하는데 인색합니다. 그러나 남에게는 자신을 보이지 않으며, 오히려 대륙적이고 가장 남성적이며 무척 그릇이 크게 보이기도 합니다. 
또한 책임감이 강해 일에도 충실하고 가정에서는 특별히 아내를 아끼며, 가장으로서 가족을 보호하려는 의식이 누구보다도 강합니다. 아무튼 허술한 점이 없고 개성이 강하며, 일에 임하여 우물쭈물하지 않고 결단력이 있으며 가정에 소홀하지 않는 장점을 타고 난 남성이라고 하겠습니다. 

반면 이 여성은 명랑하고 활발하며 외향적이고 생활력이 매우 강합니다. 그래서 본래 남에게 위축되지 않는 성격으로 부끄럼을 타지 않으며, 이해심이 많으나 반면, 자존심과 자부심이 무척 강하여 결혼해서 설사 남편이 바람을 피우거나 무관심하게 대해도 드러내 놓고 질투를 하거나 투정을 부리지는 않습니다. 아니 겁내지 않는다는 표현이 맞습니다. 
즉 '나 혼자도 잘 살 수 있다'는 자신감이 있기 때문입니다. 그렇다고 가정에서 남편을 무시하거나 하지 않으며, 단 애정의 포로가 되어 울고불고하지 않으며, 바람을 피우지도 않습니다. 또한 검소하게 살면서 한푼 두푼 저축하는 사람이므로 의존적이고 낭비벽이 있거나 결단력이 부족한 남성의 아내로 좋습니다.",
"두 남녀의 관계는 여성이 나무요, 남성이 흙이어서 상극 궁합입니다. 
그러나 여성이 음이므로 그리 강하지도 않고 유순하므로 크게 나쁜 결합만은 아닙니다. 그렇지만 아내가 은연중에 남편을 압박하는 상이어서 남편은 억세지 않은 아내에게 무언가 눌리고 있는 기분이 들기도 하겠습니다. 그러나 성격상의 큰 충돌은 없을 것입니다. 단, 남성이 아내의 우위에 서서 당당히 가장으로서의 권리와 체면을 유지하려고 한다면 불만스러울 것입니다. 

구체적으로 이 남성은 성실하고 부지런하며 개성이 강합니다. 
반면 애증이 극단적이어서 마음에 들면 특별히 잘 해 주지만 별로 이해관계가 없는 사람에게는 아무리 가까운 사이라 할지라도 몰인정할 만큼 냉정하며, 남을 용서하고 이해하는데 인색합니다. 그러나 남에게는 자신을 보이지 않으며, 오히려 대륙적이고 가장 남성적이며 무척 그릇이 크게 보이기도 합니다. 또한 책임감이 강해 일에도 충실하고 가정에서는 특별히 아내를 아끼며, 가장으로서 가족을 보호하려는 의식이 누구보다도 강합니다. 
아무튼 허술한 점이 없고 개성이 강하며, 일에 임하여 우물쭈물하지 않고 결단력이 있으며 가정에 소홀하지 않는 장점은 타고 난 남성이라고 하겠습니다. 

반면, 이 여성은 현모양처의 표상으로, 누구라도 이 여성을 아내로 맞이한다면 행복한 남성이라 해도 지나친 말이 아닐 것입니다. 활발하고 명랑하면서도 버릇없거나 거칠지 않고, 얌전하면서도 꽁하거나 고집스러운 타입이 아닙니다. 오히려 너무 여성적이고 평범하기에 개성이 없는 것 같으나 그 자체가 바로 이 여성의 장점이며, 뒤는 매력은 없어도 싫증이 나지 않는 사람입니다. 
또한 살림살이를 운영함에 있어서, 쓸 때는 쓰면서도, 아낄 때는 아끼고, 즉, 낭비론 하거나 인색하지도 않으며, 가정 주부로서의 사명을 다합니다. 결코 분위기에 휩싸여 시간을 망각하는 일도 없으며, 배우자가 커다란 실수를 하여도, 자신의 잘못을 솔직하게 시인하고 용서를 빈다면 스스럼없이 용서해 줄 그런 여인입니다. 
결론적으로 이 여성은 아내로서 엄마로서의 도리를 다할 수 있는 바탕이 되어있는 이상적인 주부라고 하겠습니다.",
"남녀가 같은 양이나 서로 상생관계라서 좋은 궁합입니다. 따라서 서로가 자기의 마음을 미리 알아주는 것 같아 호흡이 잘 맞는 부부관계를 이를 것이나, 결혼 후에는 이성문제로 인한 질투 때문에 싸움을 자주 할 우려가 있습니다. 따라서 이런 문제만 아니면 별달리 불화할 일은 생기지 않을 것입니다. 
또한 남녀 둘 다 이기적인 경향이 있어 남들로부터 박정한 사람들이라고 평가 될 것이니, 타인에게 인정을 베풀며 살아간다면 좋은 평판을 얻으면서 화목하게 살아갈 것입니다. 

구체적으로 이 남성은 성실하고 부지런하며 개성이 강합니다. 반면 애중이 극단적이어서 마음에 들면 특별히 잘 해 주지만 별로 이해관계가 없는 사람에게는 아무리 가까운 사이라 할지라도 몰인정할 만큼 냉정하며, 남을 용서하고 이해하는데 인색합니다. 그러나 남에게는 자신을 보이지 않으며, 오히려 대륙적이고 가장 남성적이며 무척 그릇이 크게 보이기도 합니다. 
또한 책임감이 강해 일에도 충실하고 가정에서는 특별히 아내를 아끼며, 가장으로서 가족을 보호하려는 의식이 누구보다도 강합니다. 
아무튼 허술한 점이 없고 개성이 강하며, 일에 입하여 우물쭈물하지 않고 결단력이 있으며 가정에 소홀하지 않는 장점을 타고 난 남성이라고 하겠습니다. 

반면, 이 여성의 외형은 세련미가 있으나, 다소 건방져 보이기도 하고 신경질적이며 까다롭게 보이지만, 내면은 겁이 많고 연약하며 순진한 면이 있습니다. 
따라서 일단 연애를 하거나 아내로 맞이하면 하루가 다르게 새로운 매력에 이끌리게 될 것입니다 솔직하고 명랑하며, 애교로서 남편의 마음을 사로잡을 것이며, 살림을 알뜰하게 꾸려 나가고 남편의 사업이나 출세에 적극적인 협력자가 되어 줄 것입니다. 또한 이 여성은 마음에 드는 남성이 발견되면 먼저 용감하게 사랑을 고백하는 대담성도 있으나, 우물쭈물 시간만 끄는 남성은 흥미가 없어 합니다. 즉, 남성이 적극적으로 과감하게 프로포즈해 주기를 바라는 한편, 로맨틱한 감상은 좋아하지 않는 형으로 달콤한 애정 표현이나 유혹 따위에는 넘어가질 않습니다. 
그리고 연애와 결혼은 다르다는 생각을 갖고 있으므로, 연애 상대자로서의 남성은 잘생기고, 세련된 남성을 선택하나, 결혼 상대자는 경제력이 있거나 사회적으로 어느 정도 위치에 있어야만 마음이 움직이게 됩니다. 그러나 화목한 가정을 가꾸려면 경제력 보다는 원만한 성격의 남성을 만나야 합니다. 
결론적으로 이 여성은 평생을 함께 살아도 싫증이 나지 않을 만큼 귀여운 아내감입니다.",
"좋은 만남입니다. 음양의 배합도 좋고 아내와 남편이 불과 흙으로써 서로 상생을 이루어 길격궁합에 해당합니다. 그러나 부부간의 아기자기한 애정은 없을 것이며, 서로 싫어하지 않는 정도의 금슬을 유지 할 것 입니다. 
아내는 남편에게 필요 이상의 주문을 많이 할 것이나 남편은 그런 아내의 요구를 들어주면서 살아가게 될 것이며, 반면 남편은 아내의 도움말이 매우 효과적으로 작용하므로, 그런 아내를 소중히 여기게 됩니다. 설사 남편이 무모한 일을 경영하려고 해서 의견 충돌이 생길 수는 있으나 아내는 웬만하면 실수하지 않는 남편의 의사를 무시하지 않을 것입니다. 

구체적으로 이 남성은 성실하고 부지런하며 개성이 강합니다. 
반면 애증이 극단적이어서 마음에 들면 특별히 잘 해 주지만 별로 이해관계가 없는 사람에게는 아무리 가까운 사이라 할지라도 몰인정할 만큼 냉정하며, 남을 용서하고 이해하는데 인색합니다. 그러나 남에게는 자신을 보이지 않으며, 오히려 대륙적이고 가장 남성적이며 무척 그릇이 크게 보이기도 합니다. 
또한 책임감이 강해 일에도 충실하고 가정에서는 특별히 아내를 아끼며, 가장으로서 가족을 보호하려는 의식이 누구보다도 강합니다. 아무튼 허술한 점이 없고 개성이 강하며, 일에 임하여 우물쭈물하지 않고 결단력이 있으며 가정에 소홀하지 않는 장점을 타고 난 남성이라고 하겠습니다. 

반면, 이 여성은 활발하고 외향적이면서 인정이 많습니다. 또 좋고 싫은 것이 분명해서 누구든 한 번 좋아하면 가식 없이 따르고, 한 번 미워하면 노골적으로 싫은 것을 나타냅니다. 그리고 마음이 약해서 남의 어려운 청을 거절하지 못하며, 미혼시절에 별로 좋아하지 않는 남성에게 차마 냉정하게 대하지 못하는 약점 때문에 당하지 않아도 될 곤욕을 당하거나, 심지어는 끈질긴 구애를 거절하지 못해 결혼까지 하게 될 수도 있습니다. 따라서 이 점에 주의해야 평생 동안 후회가 없을 것입니다. 
반면 결혼해서는 생활력이 강하여 남편 일을 잘 거들고 맞벌이도 주저하지 않습니다. 이 여성은 배우자로 맞이했거나 하려는 남성은 상대의 자존심을 상하게 하는 말을 해서는 안되며, 진심어린 애정의 표시를 하십시오. 그것이 전달된다면 아내는 남편을 위해 어떤 일도 불사할 수 있는 아름다운 성격의 소유자입니다.",
"두 사람이 배우자로서 맺어진다면 애정면에서 아기자기한 맛이 들하고 덤덤할 것입니다. 
이는 두 사람이 모두 같은 흙끼리의 결합이기 때문입니다. 따라서 서로가 약점을 잡히지 않으려고 말과 행동을 조심하기 때문에 실수가 적어 큰 충돌은 일어나지 않을 것이나 다소 분위기가 딱딱한 가정이 될 수 있습니다. 그러므로 두 사람은 부부관계는 가벼운 실수와 다툼도 있어야 도리어 권태롭지 않은 가정이 될 것이라는 것을 명심해야 하며, 아내는 애교 있는 제스처를 써가면서 가정에 웃음을 선사하는 슬기를 발휘해야 겠습니다. 

구체적으로 이 남성은 성실하고 부지런하며 개성이 강합니다. 
반면 애증이 극단적이어서 마음에 들면 특별히 잘 해 주지만 별로 이해관계가 없는 사람에게는 아무리 가까운 사이라 할지라도 몰인정 할 만큼 냉정하며, 남을 용서하고 이해하는데 인색합니다. 그러나 남에게는 자신을 보이지 않으며, 오히려 대륙적이고 가장 남성적이며 무척 그릇이 크게 보이기도 합니다. 또한 책임감이 강해 일에도 충실하고 가정에서는 특별히 아내를 아끼며, 가장으로서 가족을 보호하려는 의식이 누구보다도 강합니다. 
아무튼 허술한 점이 없고 개성이 강하며, 일에 임하여 우물쭈물하지 않고 결단력이 있으며 가정에 소홀하지 않는 장점을 타고 난 남성이라고 하겠습니다. 

반면, 이 여성은 똑똑하고 대담하며 노련한 여장부격인 사람으로, 부드럽고 애교스럽거나 야한 맛을 풍기지는 않으나 세련되고 침착하며, 개성이 강해서 분위기에 잘 말려들지 않고 남의 꼬임에도 넘어가지 않습니다. 그래서 남성이 유혹하기에 가장 힘들고 다루기 어려운 타입의 여성형입니다. 그러나 좋아하는 사람에게는 깊은 애정을 쏟으며, 설사 금전적으로 손해를 보더라도 애정을 쏟기도 합니다. 이처럼 애정면에서 적극적이어서 누가 먼저 프로포즈하건 사귐이 빠르게 진행되며, 시일 을 기다리면서 이것저것 재지 않고 즉흥적인 판단을 내립니다. 
반면 좋아하는 남성상은 강한 남성미 보다는, 곱고 단아하면서도 유약해 보이는 남성을 좋아하며, 정조 그 자체를 대단하게 여기지는 않으나 고고하고 도도한 성격 탓에 함부로 몸을 허락하는 행동을 하지는 않습니다. 
남편은 사회적, 경제적으로 상당한 위치에 있는 남성이라야 이 여성을 이끌 수 있으며 아니면 차라리 여성이 주도권을 쥐고 남편이 아내의 의견에 따라가는 부부관계가 형성되어야 집안이 평안할 것입니다.",
"두 사람이 모두 같은 흙이요, 남자는 양, 여자는 음이어서 매우 좋은 결합처럼 여겨지나, 상충관계가 되어 서로 화합을 이루면서도 은연중에 충돌의 기세가 내포되어 있습니다. 따라서 두 남녀가 기분이 합쳐지면 서로 아끼고 다정하지만 하찮은 것을 가지고도 의견 대립이 자주 일어나기도 합니다. 그러므로 두 남녀는 애정도 있고 싸우기도 잘하는 배합입니다. 

구체적으로 이 남성은 성실하고 부지런하며 개성이 강합니다. 
반면 애증이 극단적이어서 마음에 들면 특별히 잘 해 주지만 별로 이해관계가 없는 사람에게는 아무리 가까운 사이라 할지라도 몰인정할 만큼 냉정하며, 남을 용서하고 이해하는데 인색합니다. 그러나 남에게는 자신을 보이지 않으며, 오히려 대륙적이고 가장 남성적이며 무척 그릇이 크게 보이기도 합니다. 또한 책임감이 강해 일에도 충실하고 가정에서는 특별히 아내를 아끼며, 가장으로서 가족을 보호하려는 의식이 누구보다도 강합니다. 
아무튼 허술한 점이 없고 개성이 강하며, 일에 임하여 우물쭈물하지 않고 결단력이 있으며 가정에 소홀하지 않는 장점을 타고 난 남성이라고 하겠습니다. 

반면, 이 여성은 총명하고 약고 깜찍하며, 다소 신경질적이나 재치가 번득이는 사람입니다. 
또한 보수적인 면이 있으면서도, 현대적인 것도 취하고, 가정적이어서 알뜰하고 절약성이 강한 주부상으로 조금도 흠이 없습니다. 단, 남편에게 정도 이상으로 간섭하는 경향이 있으나, 명분상 남편의 위신을 세워 주며, 타인이 그것을 느낄 수 있도록 정성을 기울입니다. 그리고 사람을 대할 때 앞에서는 그를 추켜 주고 비위를 맞추나 진심이 아닌 경우가 많습니다. 즉, 자신에게 유리한 사람에게는 자세도 낮추고 겸손하여 상대의 호감을 사려고 노력하지만 그렇지 않으면 사귀지 않습니다. 이러한 이해타산은 생황을 하면서도 나타나 궁해도 궁한 체하지 않고 과시하기를 좋아하며, 명예나 이익 관리에 지혜로울 정도로 처신합니다. 
따라서 이 여성을 아내로 맞이한다면, 아내의 재치와 순발력, 총명한 두뇌를 잘 수용하고 결점을 잘 타일러 간다면 최상의 반려자가 쥘 것입니다.",
"두 사람은 호흡이 잘 맞는 아주 좋은 궁합입니다. 
비록 남녀가 모두 양에 해당하지만 남성이 여성에게 애정 깊이 잘 대해 주게 되며, 오행으로 흙과 금이어서 설사 부부가 빈손 등고 시작해도 걱정할 것이 없습니다. 남편은 부지런하고 성실하며 가정의 행복을 위해 노력할 것이며, 아내의 정성이린 내조로 일취월장 발전할 것입니다. 
또한 남편은 아내의 괄괄하고 억센 듯한 성격을 잘 받아주고, 아내는 그런 남편을 고맙게 여겨 남편을 위해 최선을 다하게 되므로 호흡이 잘 맞습니다. 따라서 망설일 것 없이 부부가 되기를 약속해도 뒷날 후회가 없을 것입니다. 

구체적으로 이 남성은 성실하고 부지런하며 개성이 강합니다. 
반면 애증이 극단적이어서 마음에 들면 특별히 잘 해 주지만 별로 이해관계가 없는 사이에게는 아무리 가까운 사이라 할지라도 몰인정할 만큼 냉정하며, 남을 용서하고 이해하는데 인색합니다. 그러나 남에게는 자신을 보이지 않으며, 오히려 대륙적이고 가장 남성적이며 무척 그릇이 크게 보이기도 합니다. 또한 책임감이 강해 일에도 충실하고 가정에서는 특별히 아내를 아끼며, 가장으로서 가족을 보호하려는 의식이 누구보다도 강합니다. 
아무튼 허술한 점이 없고 개성이 강하며, 일에 임하여 우물쭈물하지 않고 결단력이 있으며 가정에 소홀하지 않는 장점을 타고 난 납성이라고 하겠습니다. 

반면, 이 여성은 성격이 강하고 솔직하며, 개성이 있고 생황력이 강합니다. 
특히 분위기에 흔들리지 않고 감언이설에 잘 넘어가지 않으며, 명분을 좋아해서 명분 없는 일은 설사 유혹에 이끌릴지라도 절대 행하지 않습니다. 그리고 개방적이며 이상보다 현실에 충실하고 시대의 흐름에 민감합니다. 
반면 바람기가 있는 것 같으면서도 방종하지 않고, 사치와 허영에 빠지지 않으며, 자기 관리에 철저하여 감정에 치우쳐 과오를 범하지 않으며, 정조관념도 강합니다. 결혼해서는 혹 남편이 잘못하면 그것을 눈감아 주지 않고 트집잡고, 바가지도 잘 긁어대며, 남편의 바람기를 용납하지 않습니다. 
따라서 웬만한 남성은 이 여성에게 쩔쩔매게 되고, 남편을 공처가로 만들기 쉽습니다. 그러나 이해심은 남성 못지않아서 금세 풀어지며, 가정을 위해 최대한의 노력을 아끼지 않을 믿음직스러운 아내의 상입니다.",
"두 남녀의 궁합은 매우 좋아서 부부로 결합된다면 일생 동안 권태기가 없는 다정한 삶을 누릴 것입니다. 
음양오행으로 봐서 남성이 양이고 혼이며, 여성은 음이면서 금으로서 음양 배합이 좋고 오행이 상생되어 서로 만나는 순간부터 좋아지게 됩니다. 따라서 설사 상대방에게 약점이 있더라도 큰 약점이 아니라면 그것조차도 나쁘게 보지 않는 묘한 관계가 형성됩니다. 좀 무뚝뚝하고 완고한 남성은 여성의 애교에 홀딱 반하고, 여성은 남성다운 남성에게 의지하고 싶은 심리가 작용하게 되어, 좋은 관계를 이를 수 있습니다. 

구체적으로 이 남성은 성실하고 부지런하며 개성이 강합니다. 
반면 애증이 극단적이어서 마음에 들면 특별히 잘 해 주지만 별로 이해관계가 없는 사람에게는 아무리 가까운 사이라 할지라도 몰인정할 만큼 냉정하며, 남을 용서하고 이해하는데 인색합니다. 그러나 남에게는 자신을 보이지 않으며, 오히려 대륙적이고 가장 남성적이며 무척 그릇이 크게 보이기도 합니다. 또한 책임감이 강해 일에도 충실하고 가정에서는 특별히 아내를 아끼며, 가장으로서 가족을 보호하려는 의식이 누구보다도 강합니다. 
아무튼 허술한 점이 없고 개성이 강하며, 일에 임하여 우물쭈물하지 않고 결단력이 있으며 가정에 소홀하지 않는 장점을 타고 난 남성이라고 하겠습니다. 

반면, 이 여성은 약고 재치가 있으며 친절하면서도 남성 못지않은 이해심과 아량으로 때로는 좋은 일을 많이 해서 다소의 손해도 불사합니다. 
그리고 특별한 용모를 갖추지 않았더라도 사람을 끄는 매력이 있어 아무리 수수한 차림새라도 야해 보이고 바람기가 있어 보이며, 부담감이 없게 느껴지는 여성이어서 남성들의 유혹을 많이 받게 됩니다. 가정을 아름답게 꾸미는 데 취미와 소질이 있고, 평범한 삶보다 이상적인 생활환경, 삶의 멋을 추구하는 타입이어서 세상의 이목이나 경제적 구애가 없다고 가정할 때 이 여성은 멋진 연애를 하고 싶고, 결혼 후에도 가장 호화롭고 사치스러운 삶을 영위하고자 할 것입니다. 그리고 서비스가 만점이라서 남편한테 베푸는 애정과 서비스는 그 누구도 따라오지 못합니다. 
좋아하는 남성상은 의젓하고 개성 있고 주관이 뚜렷한 남성을 좋아하며, 자신이 남성을 지배하기를 원하지 않으며, 남편으로 섬기고 싶어합니다. 그렇지 않으면 소위 제비족인 남성에게 유혹당할 우려가 있습니다.",
"두 사람의 궁합은 편배합으로 음양의 조화는 이루지 못했으나 나쁜 관계는 아닙니다. 
여성의 성격이 시원스럽고 활발하여 억센 것 같아 보여도 여성의 본분을 망각하지 않고, 자신이 남편의 우위에 있고자 하지도 않으며, 오히려 남편이 자기를 꼼짝 못하게 할 만큼 위엄이 있기를 바랍니다.  때문에 이 여성은 개성이 강한 이 남성에게 만족해 할 것이며, 남성도 여성을 함부로 대하지 못하고 조심스럽게 비위를 맞추고자 할 것입니다. 
만약 어렵게 자란 여성이라면 생활의 안정을 위해 성실한 남편에게 불만을 모르고 살겠지만, 처음부터 여유 있는 가정에서 자랐다면 약간 낭만적인 멋을 추구하려고 하기 때문에 남편이 현실주의적이고 완고한 성격에 불만이 있을 수 있습니다. 따라서 남편이 이 점을 참작하여 아내의 정서생활에 신경을 써주면 무난할 것입니다. 

구체적으로 이 남성은 성실하고 부지런하며 개성이 강합니다. 
반면 애증이 극단적이어서 마음에 들면 특별히 잘 해 주지만 별로 이해관계가 없는 사람에게는 아무리 가까운 사이라 할지라도 몰인정할 만큼 냉정하며, 남을 용서하고 이해하는데 인색합니다. 그러나 남에게는 자신을 보이지 않으며, 오히려 대륙적이고 가장 남성적이며 무척 그릇이 크게 보이기도 합니다. 또한 책임감이 강해 일에도 충실하고 가정에서는 특별히 아내를 아끼며 가장으로서 가족을 보호하려는 의식이 누구보다도 강합니다. 
아무튼 허술한 점이 없고 개성이 강하며, 일에 임하여 우물쭈물하지 않고 결단력이 있으며 가정에 소홀하지 않는 장점을 타고 난 남성이라고 하겠습니다. 

반면, 이 여성은 명랑하고 활발하며 부끄러움을 타지 않고 시원스럽습니다. 
또한 성깔도 있고 억센 듯하지만 여성이 갖추어야 할 애교와 매력도 있습니다. 즉, 여성이면서도 배짱이 있고 폭 넓은 아량과 남을 위해 봉사하고 이해하는데 인색하지 않으며, 웬만한 일은 스스로 해결하며 무슨 일에나 태도가 분명합니다. 혹 낭만적인 면이 있어 기분에 따라서 씀씀이가 크지만 계획 없는 낭비는 하지 않으며 써야 할 일이면 손이 크다는 평을 들을 만큼 멋지게 쓰는 타입입니다. 
만일 이 여성에게 경제력만 허용된다면 평소에 꿈꾸던 이상을 실현하여 낙원 같은 가정을 만들어 놓을 것입니다. 단, 남편을 이끌려 하고 시시한 남성은 깔보는 경향이 있으나, 일단 결혼한 뒤에는 그 남편의 인격 여하를 막론하고 아내로서의 본분을 다할 것입니다. 그리고 명분을 존중하여 도리에 어긋나는 행동은 절대로 하지 않는 부인상입니다.",
"두 사람의 만남을 두고서 천생연분이라 하며 운명적인 판단으로는 일생 이변이 없이 해로하는 좋은 궁합으로 평가됩니다. 즉, 양과 음이 만나 정배합을 이루었으니 좋은 궁합입니다. 뿐만 아니라 남편은 아내가 무척 애처롭고 여리게 느껴져 무한한 동정심을 발하게 되고, 감수성이 예민한 아내는 그런 남편이 고맙고 감격스러워 여성으로서의 애정을 흠뻑 쏟게 될 것이다. 
단, 남편은 아내가 지나치리만큼 순정적이고 질투심이 강하므로 아내의 자존심을 상하게 하는 일, 즉, 외도 따위 등은 절대로 삼가 해야 할 것입니다. 

구체적으로 이 납성은 성실하고 부지런하며 개성이 강합니다. 
반면 애증이 극단적이어서 마음에 들면 특별히 잘 해 주지만 별로 이해관계가 없는 사람에게는 아무리 가까운 사이라 할지라도 몰인정할 만큼 냉정하며, 남을 용서하고 이해하는데 인색합니다. 그러나 남에게는 자신을 보이지 않으며, 오히려 대륙적이고 가장 남성적이며 무척 그릇이 크게 보이기도 합니다. 
또한 책임감이 강해 일에도 충실하고 가정에서는 특별히 아내를 아끼며, 가장으로서 가족을 보호하려는 의식이 누구보다도 강합니다. 
아무튼 허술한 점이 없고 개성이 강하며, 일에 임하여 우물쭈물하지 않고 결단력이 있으며 가정에 소홀하지 않는 장점을 타고 난 남성이라고 하겠습니다. 

반면, 이 여성은 내성적이고 부끄러움을 잘 타며 얌전해서 한국적인 여성상입니다. 
그래서 어른들이 가장 좋아할 만한 며느리감이며, 설사 말괄량이 모습을 보인다고 해도 겉보기만 그럴 뿐 막상 자기가 좋아하는 남성 앞에서는 어쩔 수 없이 수줍음을 탑니다. 애정관은 순정파로 한번 누구를 사랑하면 딴마음을 두지 않고 진심으로 헌신적인 애정을 베풀며, 혹 남성이 자기를 싫어해도 쉽게 단념하지 않습니다. 때문에 만약 남성으로부터 배신을 당하면 자기가 정을 준 만큼 증오하고 저주하게 됩니다. 따라서 이 여성과 교제중인 남성들은 만약 일시적으로 사귈 예정이라면 아예 상처를 주지 않는 게 좋을 것입니다. 
남성은 이런 여성을 아내로 맞이한다면 복입니다. 희생적인 봉사정신과 순정, 현모양처의 조건을 다 갖춘 사랑과 결혼한다면, 부자면 말할 것도 없고 비록 궁해도 아껴만 준다면 불평 없이 알뜰하고 성실하게 살아가는 아내가 될 것이기 때문입니다."),
array("여성이 나무요, 남성이 흙이어서 서로 상극이며, 여성이 남성을 극하므로 일단은 불리한 궁합으로 볼 수 있으나, 다행히 합을 이루었기 때문에 크게 나쁘지도 않습니다. 
두 사람은 만나자마자 금세 좋아하여 친근해지며, 결혼 후에는 남편의 입장에서 어떻게 아 내를 대하느냐에 따라 행, 불행이 좌우되겠습니다. 자기 하고 싶은 대로 다 하려는 이 남성을 웬만한 여성은 말리지를 못하나 이 여성은 능히 견제할 수 있으므로, 다소 남편에게 부담스러운 아내라 여겨지겠지만 실속면에서는 오히려 남편에게 유리한 결과가 됩니다. 따라서 원만한 가정을 영위하려면 아내가 주도권을 행사하는 것이 가정적으로 사회적으로 남편에게 적지 않은 도움이 되어 줄 것이라는 것을 기억하십시오. 

구체적으로 이 남성은 자부심이 강하고 대사에 자신감이 넘치며, 약고 똑똑하고 야무지며 타산적이고 이기적인 사람입니다. 또한 자기보다 못한 사람과는 사귀려 하지 않으나, 학식이 풍부하거나 사회적인 지위니 명망이 있는 사람한테는 진심으로 존경하고 겸손하게 대합니다. 그리고 호기심이 많아 신비로운 일에 직접 참여하길 좋아하며, 남이 전혀 이해하기 힘든 기괴한 취미도 갖고 있는 호기심 투성이의 사람입니다. 
여성 교제는 한 사람으로 만족하지 않으므로 바람둥이 같으나 바람이기보다는 다가오는 여성이면 그것을 놓치지 않으려는 일종의 지배욕이 강합니다. 그래서 어떤 여성일지라도 애정에 눈이 어두울 만큼 깊이 빠지지도 않으며, 여성을 대하는 면에서는 보수적이므로 애인이나 아내의 자유를 제한하기도 합니다. 

반면 이 여성은 명랑하고 활발하며 외향적이고 생활력이 매우 강합니다. 그래서 본래 남에게 위축되지 않는 성격으로 부끄럼을 타지 않으며, 이해심이 많으나 반면, 자존심과 자부심이 무척 강하여 결혼해서 설사 남편이 바람을 피우거나 무관심하게 대해도 드러내 놓고 질투를 하거나 투정을 부리지는 않습니다. 아니 겁내지 않는다는 표현이 맞습니다. 
즉 '나 혼자도 잘 살 수 있다'는 자신감이 있기 때문입니다. 그렇다고 가정에서 남편을 무시하거나 하지 않으며, 단 애정의 포로가 되어 울고불고하지 않으며, 바람을 피우지도 않습니다. 또한 검소하게 살면서 한푼 두푼 저축하는 사람이므로 의존적이고 낭비벽이 있거나 결단력이 부족한 남성의 아내로 좋습니다.",
"두 사람은 서로 조화를 이루기가 어렵겠습니다. 
남성은 상식 밖의 엉뚱한 면이 있고, 여성은 어디까지나 명분이 서는 상식적인 생활철학을 갖고 있으므로 사고 자체에서부터 두 남녀는 화합하기에 거리가 멀다고 하겠습니다. 게다가 음 대 음이요, 여성이 나무이고, 남성이 흙이어서 별로 좋지 않습니다. 
만약 이런 결합을 하고서도 풍파가 없다면 부부가 서로 간섭하지 않고 남편이 하는 대로 아내가 하는 대로 스스로에게 맡긴 채 살아가는 가정일 것이며, 그것도 아니라면 남편이 가정의 주도권을 아내에게 맡기고 아내의 의견에 백퍼센트 받아들이면서 생황의 안정을 이뤄가는 가정이라고 하겠습니다.

구체적으로 이 남성은 자부심이 강하고 매사에 자신감이 넘치며, 약고 똑똑하고 야무지며 타산적이고 이기적인 사람입니다. 또한 자기보다 못한 사람과는 사귀려 하지 않으나, 학식이 풍부하거나 사회적인 지위나 명망이 있는 사람한테는 진심으로 존경하고 겸손하게 대합니다. 그리고 호기심이 많아 신비로운 일에 직접 참여하길 좋아하며, 남이 전혀 이해하기 힘든 기괴한 취미도 갖고 있는 호기심 투성이의 사람입니다. 
여성 교제는 한 사람으로 만족하지 않으므로 바람둥이 같으나 바람이기보다는 다가오는 여성이면 그것을 놓치지 않으려는 일종의 지배욕이 강합니다. 그래서 어떤 여성일지라도 애정에 눈이 어두울 만큼 깊이 빠지지도 않으며, 여성을 대하는 면에서는 보수적이므로 애인이나 아내의 자유를 제한하기도 합니다. 

반면, 이 여성은 현모양처의 표상으로, 누구라도 이 여성을 아내로 맞이한다면 행복한 남성이라 해도 지나친 말이 아닐 것입니다. 활발하고 명랑하면서도 버릇없거나 거칠지 않고, 얌전하면서도 꽁하거나 고집스러운 타입이 아닙니다. 오히려 너무 여성적이고 평범하기에 개성이 없는 것 같으나 그 자체가 바로 이 여성의 장점이며, 뒤는 매력은 없어도 싫증이 나지 않는 사람입니다. 
또한 살림살이를 운영함에 있어서, 쓸 때는 쓰면서도, 아낄 때는 아끼고, 즉, 낭비를 하거나 인색하지도 않으며, 가정 주부로서의 사명을 다합니다. 결코 분위기에 휩싸여 시간을 망각하는 일도 없으며, 배우자가 커다란 실수를 하여도, 자신의 잘못을 솔직하게 시인하고 용서를 빈다면 스스럼 없이 용서해 줄 그런 여인입니다. 
결론적으로 이 여성은 아내로서 엄마로서의 도리를 다할 수 있는 바탕이 되어있는 이상적인 주부라고 하겠습니다.",
"음양이 조화되었으며, 오행이 서로 상생관계론 이루었으나 그렇다고 해서 성격마저 조화되는 것은 아닙니다. 두 사람은 모두 서로가 사랑을 주기보다 받기를 원하는 타입인데다 이기적인 경향이 농후하여 설사 상대에게 잘한다고 해도, 자기 기분이 좋아서 잘하는 것이지 상대의 기분은 고려해서 마음을 풀어주려고 노력하는 것은 아닙니다. 
또한 두 사람 모두는 한번 화가 나면 무서우리만큼 냉정하고 권태도 빨리 느끼게 되므로 중매에 의한 결합이면 무방하나 연애로 만나서 결혼까지 생각한다면 좀 더 고려하는 것이 좋겠습니다. 

구체적으로 이 남성은 자부심이 강하고 매사에 자신감이 넘치며, 약고 똑똑하고 야무지며 타산적이고 이기직인 사람입니다. 또한 자기보다 못한 사람과는 사귀려 하지 않으나, 학식이 풍부하거나 사회적인 지위나 명망이 있는 사람한테는 진심으로 존경하고 겸손하게 대합니다. 그리고 호기심이 많아 신비로운 일에 직접 참여하길 좋아하며, 남이 전혀 이해하기 힘든 기괴한 취미도 갖고 있는 호기심 투성이의 사람입니다. 
여성 교제는 한 사람으로 만족하지 않으므로 바람둥이 같으나 바람이기보다는 다가오는 여성이면 그것을 놓치지 않으려는 일종의 지배욕이 강합니다. 그래서 어떤 여성일지라도 애정에 눈이 어두울 만큼 깊이 빠지지도 않으며, 여성을 대하는 면에서는 보수적이므로 애인이나 아내의 자유를 제한하기도 합니다. 

반면, 이 여성의 외형은 세련미가 있으나, 다소 건방져 보이기도 하고 신경질적이며 까다롭게 보이나, 내면은 겁이 많고 연약하며 순진한 면이 있습니다. 따라서 일단 연애를 하거나 아내로 맞이하면 하루가 다르게 새로운 매력에 이끌리게 될 것입니다. 솔직하고 명랑하며, 애교로서 남편의 마음을 사로잡을 것이며, 살림을 알뜰하게 꾸려 나가고 남편의 사업이나 출세에 적극적인 협력자가 되어 줄 것입니다. 
또한 이 여성은 마음에 드는 남성이 발견되면 먼저 용감하게 사랑을 고백하는 대담성도 있으나, 우물쭈물 시간만 끄는 남성은 흥미가 없어 합니다. 즉, 남성이 적극적으로 과감하게 프로포즈해 주기를 바라는 한편, 로맨틱한 감상은 좋아하지 않는 형으로 달콤한 애정 표현이나 유혹 따위에는 넘어가질 않습니다. 그리고 연애와 결혼은 다르다는 생각을 갖고 있으므로, 연애 상대자로서의 남성은 잘 생기 고, 세련된 남성을 선택하나, 결혼 상대자는 경제력이 있거나 사회적으로 어느 정도 위치에 있어야만 마음이 움직이게 됩니다. 
그러나 화목한 가정을 가꾸려면 경제력 보다는 원만한 성격의 남성을 만나야 합니다. 결론적으로 이 여성은 평생을 함께 살아도 싫증이 나지 않을 만큼 귀여운 아내감 입니다.",
"남성이 불이고, 여성이 흙으로서 상생궁합을 이루었으나 두 남녀의 특성을 살펴보면 그리 권할 만한 배합은 아닙니다. 
언뜻 보기에 남성은 이기적이고 게으르나, 여성이 봉사적이고 부지런하므로 받기를 원하는 남편의 아내로서는 좋을 것 같으나 여성에게 벅찰 수 있습니다. 게다가 성격상으로 양쪽이 다 깐깐하여 한번 충돌이 있어 냉전이 시작되면 어느 쪽도 먼저 풀려고 하지 않으므로 부부간의 화합을 이루기 어렵습니다. 또한 서로의 장점을 무시하고 단점만을 집어내어 싸우기 일쑤입니다. 단, 남편이 아내에게 애정을 베풀고 너그럽게 이해하는 마음으로 살아간다면 무난한 가정은 꾸려갈 수 있습니다. 

구체적으로 이 납성은 자부심이 강하고 매사에 자신감이 넘치며, 약고 똑똑하고 야무지며 타산적이고 이기적인 사람입니다. 
또한 자기보다 못한 사람과는 사귀려 하지 않으나, 학식이 풍부하거나 사회적인 지위나 명망이 있는 사람한테는 진심으로 존경하고 겸손하게 대합니다. 그리고 호기심이 많아 신비로운 일에 직접 참여하길 좋아하며, 남이 전혀 이해하기 힘든 기괴한 취미도 갖고 있는 호기심 투성이의 사람입니다. 
여성 교제는 한 사람으로 만족하지 않으므로 바람둥이 같으나 바람이기보다는 다가오는 여성이면 그것을 놓치지 않으려는 일종의 지배욕이 강합니다. 그래서 어떤 여성일지라도 애정에 눈이 어두울 만큼 깊이 빠지지도 않으며, 여성을 대하는 면에서는 보수적이므로 애인이나 아내의 자유를 제한하기도 합니다. 

반면, 이 여성은 활발하고 외향적이면서 인정이 많습니다. 또 좋고 싫은 것이 분명해서, 누구든 한 번 좋아하면 가식 없이 따르고, 한 번 미워하면 노골적으로 싫은 것을 나타냅니다. 
그리고 마음이 약해서 남의 어려운 청을 거절하지 못하며, 미혼시절에 별로 좋아하지 않는 남성에게 차마 냉정하게 대하지 못하는 약정 때문에 당하지 않아도 될 곤욕을, 심지어는 끈질긴 구애를 거절하지 못해 결혼까지 하게 될 수도 있습니다. 따라서 이 점에 주의해야 평생 동안 후회가 없을 것입니다. 반면 결혼해서는 생활력이 강하여 남편 일을 잘 거들고 맞벌이도 주저하지 않습니다. 
이 여성을 배우자로 맞이했거나 하려는 남성은 상대의 자존심을 상하게 하는 말을 해서는 안되며, 진심어린 애정의 표시를 하십시오. 그것이 전달된다면 아내는 남편을 위해 어떤 일도 불사할 수 있는 아름다운 성격의 소유자입니다.",
"좋은 궁합입니다. 
남성이 음이고 여성이 양이며, 오행은 같은 흙이라서 서로 충돌하겠으나 남녀의 나이 차이가 많거나 남성보다 여성이 연상이라면 정다운 커플이 될 수 있습니다. 연하의 남편에게 아내는 모성애로 자기 희생적인 입장일지라도 보람을 느낄 것이며, 남편은 그런 아내가 든든하고 믿음직스러워 매사를 아내의 뜻에 따르게 될 것입니다. 
또한 만약 나이차가 많지 않으면 자주 충돌이 일어나기는 하지만, 그런대로 성격 차이는 있어도 살아가는 생활철학이 비슷하여 무슨 일이건 타협이 잘되고 같은 목적을 위해 힘을 합쳐 나갈 것입니다. 

구체적으로 이 남성은 자부심이 강하고 매사에 자신감이 넘치며, 약고 똑똑하고 야무지며 타산적이고 이기적인 사람입니다. 또한 자기보다 못한 사람과는 사귀려 하지 않으나, 지식이 풍부하거나 사회적인 지위나 명망이 있는 사람한테는 진심으로 존경하고 겸손하게 대합니다. 그리고 호기심이 많아 신비로운 일에 직접 참여하길 좋아하며, 남이 전혀 이해하기 힘든 기괴한 취미도 갖고 있는 호기심 투성이의 사람입니다. 여성 교제는 한 사람으로 만족하지 않으므로 바람둥이 같으나 바람이기보다는 다가오는 여성이면 그것을 놓치지 않으려는 일종의 지배욕이 강합니다. 
그래서 어떤 여성일지라도 애정에 눈이 어두울 만큼 깊이 빠지지도 않으며, 여성을 대하는 면에서는 보수적이므로 애인이나 아내의 자유를 제한하기도 합니다. 

반면, 이 여성은 똑똑하고 대담하며 노련한 여장부격인 사람으로, 부드럽고 애교스럽거나 야한 맛을 풍기지는 않으나 세련되고 침착하며, 개성이 강해서 분위기에 잘 말려들지 않고 남의 꼬임에도 넘어가지 않습니다. 그래서 남성이 유혹하기에 가장 힘들고 다루기 어려운 타입의 여성형입니다. 그러나 좋아하는 사람에게는 깊은 애정을 쏟으며, 설사 금전적으로 손해를 보더라도 애정을 쏟기도 합니다. 이처럼 애정면에서 적극적이어서 누가 먼저 프로포즈하건 사귐이 빠르게 진행되며, 시일을 기다리면서 이것저것 재지 않고 즉흥적인 판단을 내립니다. 
반면 좋아하는 남성상은 강한 남성미 보다는, 곱고 단아하면서도 유약해 보이는 남성을 좋아하며, 정조 그 자체를 대단하게 여기지는 않으나 고고하고 도도한 성격 탓에 함부로 몸을 허락하는 행동을 하지는 않습니다. 
남편은 사회적, 경제적으로 상당한 위치에 있는 남성이라야 이 여성을 이끌 수 있으며, 아니면 차라리 여성이 주도권을 쥐고 남편이 아내의 의견에 따라가는 부부관계가 형성되어야 집안이 평안할 것입니다.",
"비록 음양이 조화되지는 않았으나 나쁜 궁합은 아니며, 만약 결혼을 한다면 재산이 날로 늘어 상당한 재부가 예상됩니다. 
두 남녀의 관계는 음과 음이 만나고 흙과 흙이 만났습니다. 그래서 너는 너, 나는 나라는 이기심이 발동하며, 각기 딴생각으로 살아갈 가능성도 있습니다. 겉으로는 큰 충돌이 없어 금슬 좋게 살아가는 것 같아도 단조롭고 의무적인 부부가 될 우려가 있습니다. 

구체적으로 이 남성은 자부심이 강하고 매사에 자신감이 넘치며, 약고 똑똑하고 야무지며 타산적이고 이기적인 사람입니다. 또한 자기보다 못한 사람과는 사귀려 하지 않으나, 학식이 풍부하거나 사회적인 지위나 명망이 있는 사람한테는 진심으로 존경하고 겸손하게 대합니다. 그리고 호기심이 많아 신비로운 일에 직접 참여하길 좋아하며, 남이 전혀 이해하기 힘든 기괴한 취미도 갖고 있는 호기심 투성이의 사람입니다. 
여성 교제는 한 사람으로 만족하지 않으므로 바람둥이 같으나 바람이기보다는 다가오는 여성이면 그것을 놓치지 않으려는 일종의 지배욕이 강합니다. 그래서 어떤 여성일지라도 애정에 눈이 어두울 만큼 깊이 빠지지도 않으며, 여성을 대하는 면에서는 보수적이므로 애인이나 아내의 자유를 제한하기도 합니다. 

반면, 이 여성은 총명하고 약고 깜찍하며, 다소 신경질적이나 재치가 번득이는 사람입니다. 또한 보수적인 면이 있으면서도, 현대적인 것도 취하고, 가정적이어서 알뜰하고 절약성이 강한 주부상으로 조금도 흠이 없습니다. 단, 남편에게 정도 이상으로 간섭하는 경향이 있으나, 명분상 남편의 위신을 세워 주며, 타인이 그것을 느낄 수 있도록 정성을 기울입니다. 
그리고 사람을 대할 때 앞에서는 그를 추켜 주고 비위를 맞추나 진심이 아닌 경우가 많습니다. 즉, 자신에게 유리한 사람에게는 자세도 낮추고 겸손하여 상대의 호감을 사려고 노력하지만 그렇지 않으면 사귀지 않습니다. 이러한 이해타산은 생활을 하면서도 나타나 궁해도 궁한 체하지 않고 과시하기를 좋아하며, 명예나 이익 관리에 지혜로울 정도로 처신합니다. 
따라서 이 여성을 아내로 맞이한다면, 아내의 재치와 순발력, 총명한 두뇌를 잘 수용하고 결점을 잘 타일러 간다면 최상의 반려자가 될 것입니다.",
"두 사람의 음양 배합은 잘되었으며 흙과 금이 만나 서로 상생관계를 이루었으니 매우 이상적 입니다. 
남성이 약고 똑똑하고 다부지면서도 별난 취미가 있어 엉뚱한 일에 필요 이상의 낭비를 하지만 억세고 과감한 아내가 바가지를 긁어서라도 견제하게 되나 그런 아내에게 거부감이 없고 싫지 않기 때문에 누구의 말도 들으려 하지 않은 이 남편은 아내한테 만은 꼼짝 못하고 의견을 따르게 됩니다. 
이처럼 부부란 잘 만나면 완급과 신의를 조절하면서 무리 없는 삶을 영위하게 되는 묘가 있으므로, 서로의 배필을 만나 잘 살게 되는 것입니다. 

구체적으로 이 남성은 자부심이 강하고 매사에 자신감이 넙치며, 약고 똑똑하고 야무지며 타산적이고 이기적인 사람입니다. 또한 자기보다 못한 사람과는 사귀려 하지 않으나, 학식이 풍부하거나 사회적인 지위나 명망이 있는 사람한테는 진심으로 존경하고 겸손하게 대합니다. 그리고 호기심이 많아 신비로운 일에 직접 참여하길 좋아하며, 남이 전혀 이해하기 힘든 기괴한 취미도 갖고 있는 호기심 투성이의 사람입니다. 
여성 교제는 한 사람으로 만족하지 않으므로 바람둥이 같으나 바람이기보다는 다가오는 여성이면 그것을 놓치지 않으려는 일종의 지배욕이 강합니다. 그래서 어떤 여성일지라도 애정에 눈이 어두울 만큼 깊이 빠지지도 않으며, 여성을 대하는 면에서는 보수적이므로 애인이나 아내의 자유를 제한하기도 합니다. 

반면, 이 여성은 성격이 강하고 솔직하며, 개성이 있고 생활력이 강합니다. 특히 분위기에 흔들리지 않고 감언이설에 잘 넘어가지 않으며, 명분을 좋아해서 명분 없는 일은 설사 유혹에 이끌릴지라도 절대 행하지 않습니다. 그리고 개방적이며 이상보다 현실에 충실하고 시대의 흐름에 민감합니다. 
반면 바람기가 있는 것 같으면서도 방종하지 않고, 사치와 허영에 빠지지 않으며, 자기 관리에 철저하여 감정에 치우쳐 과오를 범하지 않으며, 정조관념도 강합니다. 
결혼해서는 혹 남편이 잘못하면 그것을 눈감아 주지 않고 트집잡고, 바가지도 잘 긁어대며, 남편의 바람기를 용납하지 않습니다. 따라서 웬만한 남성은 이 여성에게 쩔쩔매게 되고, 남편을 공처가로 만들기 쉽습니다. 그러나 이해심은 남성 못지않아서 금세 풀어지며, 가정을 위해 최대한의 노력을 아끼지 않을 믿음직스러운 아내의 상입니다.",
"모든 남녀관계가 두 사람 모두 같이 좋아하거나, 두 사람이 같이 싫어하는 것만은 아니며, 한 사람만 좋아하는 경우도 있고, 또 한족에서 특별히 싫어하는 경우도 많습니다. 그런데 바로 이 결합이 그런 경우라고 하겠습니다. 
남성은 여성이 싫지 않으나 여성 쪽에서 남성을 탐탁하게 생각하지 않습니다. 여성이 보기에 좀 잘고 째째하며 약은 체, 잘난 체하는 데다가 이기적인 면이 드러나 보이는 남성이 못마땅하게 생각되며, 설사 결혼을 해도 남편은 아내의 나들이까지 간섭하며, 특별히 여성한테만 보수적인 것을 원하는 남편에 대해 질색하게 됩니다. 그러나 오행이 상생되기에 운명상의 나쁜 점은 없습니다. 따라서 이왕 부부가 된 입장에서는 크게 불안해 할 이유는 없습니다. 

구체적으로 이 남성은 자부심이 강하고 매사에 자신감이 넘치며, 약고 똑똑하고 야무지며 타산적이고 이기적인 사람입니다. 또한 자기보다 못한 사람과는 사귀려 하지 않으나, 학식이 풍부하거나 사회적인 지위나 명망이 있는 사람한테는 진심으로 존경하고 겸손하게 대합니다. 그리고 호기심이 많아 신비로운 일에 직접 참여하길 좋아하며, 남이 전혀 이해하기 힘든 기괴한 취미도 갖고 있는 호기심 투성이의 사람입니다. 
여성 교제는 한 사람으로 만족하지 않으므로 바람둥이 같으나 바람이기보다는 다가오는 여성이면 그것을 놓치지 않으려는 일종의 지배욕이 강합니다. 그래서 어떤 여성일지라도 애정에 눈이 어두울 만큼 깊이 빠지지도 않으며, 여성을 대하는 면에서는 보수적이므로 애인이나 아내의 자유를 제한하기도 합니다. 

반면, 이 여성은 약고 재치가 있으며 친절하면서도 남성 못지않은 이해심과 아량으로 좋은 일을 위해서 다소의 손해도 불사합니다. 그리고 특별한 용모를 갖추지 않았더라도 사람을 끄는 매력이 있어 아무리 수수한 차림새라도 야해 보이고 바람기가 있어 보이며, 부담감이 없게 느껴지는 여성이어서 남성들의 유혹을 많이 받게 됩니다. 
가정을 아름답게 꾸미는 데 취미와 소질이 있고, 평범한 삶보다 이상적인 생활환경, 삶의 멋을 추구하는 타입이어서 세상의 이목이나 경제적 구애가 없다고 가정할 때 이 여성은 멋진 연애를 하고 싶고, 결혼 후에도 가장 호화롭고 사치스러운 삶을 영위하고자 할 것입니다. 그리고 서비스가 만점이라서 남편한테 베푸는 애정과 서비스는 그 누구도 따라오지 못합니다. 
좋아하는 남성상은 의젓하고 개성 있고 주관이 뚜렷한 남성을 좋아하며, 자신이 남성을 지배하기를 원하지 않으며, 남편으로 섬기고 싶어합니다. 그렇지 않으면 소위 제비족인 남성에게 유혹당할 우려가 있습니다.",
"남녀 음양이 조화되었으며, 남편과 아내라는 위치가 바르게 된 정배합으로 이상적인 결합이라고 하겠습니다. 비교적 활달하고 남성을 깔보는 듯한 이 여성은 왠지 이 남성한테는 깔볼 수 없는 위압감을 느끼고, 남성은 여성을 능히 위엄으로 잘 이끌어 나갑니다. 특히 결혼하여 여성은 자기 멋대로 자유로워야 좋은 것으로 여길 것이나 오히려 그런 자신을 견제하는 남편이 있기에 분수에 넘치지 않습니다. 
이처럼 두 사람의 만남은 남편 입장에서는 말괄량이 아내를 길들이며, 여성의 입장에선 특별히 잘나지도 않은 평범한 남성한테 다소 기를 죽이면서 살아가게 될 것입니다. 

구체적으로 이 남성은 자부심이 강하고 매사에 자신감이 넙치며, 약고 똑똑하고 야무지며 타산적이고 이기적인 사람입니다. 또한 자기보다 못한 사람과는 사귀려 하지 않으나, 학식이 풍부하거나 사회적인 지위나 명망이 있는 사람한테는 진심으로 존경하고 겸손하게 대합니다. 그리고 호기심이 많아 신비로운 일에 직접 참여하긴 좋아하며, 남이 전혀 이해하기 힘든 기괴한 취미도 갖고 있는 호기심 투성이의 사람입니다. 
여성 교제는 한 사람으로 만족하지 않으므로 바람둥이 같으나 바람이기보다는 다가오는 여성이면 그것을 놓치지 않으려는 일종의 지배욕이 강합니다. 그래서 어떤 여성일지라도 애정에 눈이 어두울 만큼 깊이 빠지지도 않으며, 여성을 대하는 면에서는 보수적이므로 애인이나 아내의 자유를 제한하기도 합니다. 

반면, 이 여성은 명랑하고 활발하며 부끄러움을 타지 않고 시원스럽습니다. 
또한 성깔도 있고 억센 듯하지만 여성이 갖추어야 할 애교와 매력도 있습니다. 즉, 여성이면서도 배짱이 있고 폭 넓은 아량과 남을 위해 봉사하고 이해하는데 인색하지 않으며, 웬만한 일은 스스로 해결하며 무슨 일에나 태도가 분명합니다. 홀 낭만적인 면이 있어 기분에 따라서 씀씀이가 크지만 계획 없는 낭비는 하지 않으며, 써야 할 일이면 손이 크다는 평을 들을 만큼 멋지게 쓰는 타입입니다. 
만일 이 여성에게 경제력만 허용된다면 평소에 꿈꾸던 이상을 실현하여 낙원 같은 가정을 만들어 놓을 것입니다. 단, 남편을 이끌려 하고 시시한 남성은 깔보는 경향이 있으나, 일단 결혼한 뒤에는 그 남편의 인격 여하를 막론하고 아내로서의 본분을 다할 것입니다. 그리고 명분을 존중하여 도리에 어긋나는 행동은 절대로 하지 않는 부인상입니다.",
"별로 바람직한 결합이 아닙니다. 
이 궁합은 편배합으로서 음양의 조화는 이루지 못했으나 다행이 남편과 아내의 위계가 다르게 된 결합입니다. 따라서 보통 이상의 정배합과 길한 궁합에는 비교되지 않으며, 남성의 입장에서는 손해 될 것이 없으나 여성은 살아가는 데 있어 자기 주장과 기를 펴기 어렵고, 남편의 주문이 많아 곤혹스러움을 느낄 것입니다. 

구체적으로 이 남성은 자부심이 강하고 매사에 자신감이 넘치며, 약고 똑똑하고 야무지며 타산적이고 이기적인 사람입니다. 또한 자기보다 못한 사람과는 사귀려 하지 않으나, 학식이 풍부하거나 사회적인 지위나 명망이 있는 사람한테는 진심으로 존경하고 겸손하게 대합니다. 그리고 호기심이 많아 신비로운 일에 직접 참여하길 좋아하며, 남이 전혀 이해하기 힘든 기괴한 취미도 갖고 있는 호기심 투성이의 사람입니다. 
여성 교제는 한 사람으로 만족하지 않으므로 바람둥이 같으나 바람이기보다는 다가오는 여성이면 그것을 놓치지 않으려는 일종의 지배욕이 강합니다. 그래서 어떤 여성일지라도 애정에 눈이 어두울 만큼 깊이 빠지지도 않으며, 여성을 대하는 면에서는 보수적이므로 애인이나 아내의 자유를 제한하기도 합니다. 

반면, 이 여성은 내성적이고 부끄러움을 잘 타며 얌전해서 한국적인 여성상입니다. 그래서 어른들이 가장 좋아할 만한 며느리감이며, 설사 말괄량이 모습을 보인다고 해도 겉보기만 그럴 뿐 막상 자기가 좋아하는 남성 앞에서는 어쩔 수 없이 수줍음을 탑니다. 
애정관은 순정파로 한번 누구를 사랑하면 딴마음을 두지 않고 진심으로 헌신적인 애정을 베풀며, 혹 남성이 자기를 싫어해도 쉽게 단념하지 않습니다 때문에 만약 남성으로부터 배신을 당하면 자기가 정을 준 만큼 증오하고 저주하게 됩니다. 따라서 이 여성과 교제중인 남성들은 만약 일시적으로 사귈 예정이라면 아예 상처를 주지 않는 것이 좋을 것입니다. 
남성은 이런 여성을 아내로 맞이한다면 복입니다. 희생적인 봉사정신과 순정, 현모양처 의 조건을 다 갖춘 사람과 결혼한다면, 부자면 말할 것도 없고 비록 궁해도 아껴만 준다면 불평 없이 알뜰하고 성실하게 살아가는 아내가 될 것이기 때문입니다."),
array("두 남녀가 서로 충돌할 가능성은 있으나 나쁜 궁합이라고는 볼 수 없습니다. 
남성과 여성이 모두 양으로서 음양이 조화되지 않고, 상충관계로 충돌의 형세가 보이나, 남편이 금이여서 아내인 목을 극하므로 위계가 바로 되어 있어 나쁜 궁합은 아닙니다. 특히 아내에게 약한 남편과 마음씨 너그러운 아내는 설사 성격상 은연중의 대립이 있더라도 서로의 자존심을 상하지 않도록 노력하면 원만한 가정이 유지될 것이며, 오히려 이런 결합이 비약적인 발전을 가져오는 예도 많습니다. 

구체적으로 이 남성은 개성이 강하고 황동력이 왕성하며 결단력과 추진력이 남보다 뛰어납니다. 
그래서 사회활동에서 누구에게도 굽히지 않으며, 성깔이 대단해 보여 남이 함부로 깔보지 못합니다. 그러나 내면의 마음은 약해서 차마 모진 일을 못하고 뒤가 무르며, 누가 집요하게 파고들면 쩔쩔매는 외강내유형의 사람입니다. 아마 이런 점이 이 남성을 좋아하게 되는 매력일 것입니다. 
가정에서도 아내를 아끼고 자녀를 사랑하는 사람으로서 천하를 호령하는 권세가라고 해도 아내한테는 왠지 약해져서 꼼짝 못합니다. 즉 강한 자에게는 강하고 약한 자에게는 약한 타입의 사람입니다. 단, 이 남성에게 결점이 있다면 입바른 말을 잘해서 괜한 적을 만드는 수가 있고, 무모한 일을 잘하며 매사 자기 판단만 고수하고 남의 충고를 받아들이지 않아 독선적인 면이 있습니다. 

반면 이 여성은 명랑하고 활발하며 외향적이고 생활력이 매우 강합니다. 
그래서 본래 남에게 위축되지 않는 성격으로 부끄럼을 타지 않으며, 이해심이 많으나 반면, 자존심과 자부심이 무척 강하여 결혼해서 설사 남편이 바람을 피우거나 무관심하게 대해도 드러내 놓고 질투를 하거나 투정을 부리지는 않습니다. 아니 겁내지 않는다는 표현이 맞습니다. 즉 '나 혼자도 잘 살 수 있다'는 자신감이 있기 때문입니다. 그렇다고 가정에서 남편을 무시하거나 하지 않으며, 단 애정의 포로가 되어 울고불고하지 않으며, 바람을 피우지도 않습니다. 
또한 검소하게 살면서 한푼 두푼 저축하는 사람이므로 의존적이고 낭비벽이 있거나 결단력이 부족한 남성의 아내로 좋습니다.",
"두 사람의 만남은 최상의 궁합이라고 할 수 있습니다. 
남자는 양이며, 여자는 음이라서 음양이 잘 조화된데다 정배합이며, 게다가 합을 이루었으니 천생연분이라고 할 수 있습니다. 따라서 남편은 아내를 아끼고 사랑하며 아내는 남편을 공경하면서 아내로서의 도리를 다하게 되므로 이런 남녀끼리의 배합은 다시 논할 필요도 없이 좋습니다. 

구체적으로 이 남성은 개성이 강하고 활동력이 왕성하며 결단력과 추진력이 남보다 뛰어 납니다. 
그래서 사회활동에서 누구에게도 굽히지 않으며, 성깔이 대단해 보여 남이 함부로 깔보지 못합니다. 그러나 내면의 마음은 약해서 차마 모진 일을 못하고 뒤가 무르며, 누가 집요하게 파고들면 쩔쩔매는 외강내유형의 사람입니다. 아마 이런 점이 이 남성을 좋아하게 되는 매력일 것입니다. 
가정에서도 아내를 아끼고 자녀를 사랑하는 사람으로서 천하를 호령하는 권세가라고 해도 아내한테는 왠지 약해져서 꼼짝 못합니다. 즉 강한 자에게는 강하고 약한 자에게는 약한 타입의 사람입니다. 단, 이 남성에게 결점이 있다면 입바른 말을 잘해서 괜한 적음 만드는 수가 있고, 무모한 일을 잘하며 매사 자기 판단만 고수하고 남의 충고를 받아들이지 않아 독선적인 면이 있습니다. 

반면, 이 여성은 현모양처의 표상으로, 누구라도 이 여성을 아내로 맞이한다면 행복한 남성이라 해도 지나친 말이 아닐 것입니다. 
활발하고 명랑하면서도 버릇 없거나 거칠지 않고, 얌전하면서도 꽁하거나 고집스러운 타입이 아닙니다. 오히려 너무 여성적이고 평범하기에 개성이 없는 것 같으나 그 자체가 바로 이 여성의 장점이며, 튀는 매력은 없어도 싫증이 나지 않는 사람입니다. 또한 살림살이를 운영함에 있어서, 쓸 때는 쓰면서도, 아낄 때는 아끼고, 즉, 낭비를 하거나 인색하지도 않으며, 가정 주부로서의 사명을 다합니다. 결코 분위기에 휩싸여 시간을 망각하는 일도 없으며, 배우자가 커다란 실수를 하여도, 자신의 잘못을 솔직하게 시인하고 용서를 빈다면 스스럼없이 용서해 줄 그런 여인입니다. 
결론적으로 이 여성은 아내로서 엄마로서의 도리를 다할 수 있는 바탕이 되어있는 이상적인 주부라고 하겠습니다.",
"양과 양의 만남이고, 여자가 남자를 극하니 불리한 배합입니다. 
만약 두 남녀가 부부관계가 아닌 애인관계라면 화끈한 열애를 할는지 모르나 결혼은 완급과 강유가 조화를 이루어야 하는데, 두 사람은 여성이 남성을 압박하는 형태인데다가 남성이 자존심이 강해 양보하지 않으려 할 것이므로 좋은 때는 한없이 좋을지 모르나 경우에 따라서는 극단적인 결과에 이를 수도 있습니다. 그러므로 가급적 이런 결합은 피하는 것이 좋습니다.

구체적으로 이 남성은 개성이 강하고 활동력이 왕성하며 결단력과 추진력이 남보다 뛰어 납니다. 
그래서 사회활동에서 누구에게도 굽히지 않으며, 성깔이 대단해 보여 남이 함부로 깔보지 못합니다. 그러나 내면의 마음은 약해서 차마 모진 일을 못하고 뒤가 무르며, 누가 집요하게 파고들면 쩔쩔매는 외강내유형의 사람입니다. 아마 이런 점이 이 남성을 좋아하게 되는 매력일 것입니다. 
가정에서도 아내를 아끼고 자녀를 사랑하는 사람으로서 천하를 호령하는 권세가라고 해도 아내한테는 왠지 약해져서 꼼짝 못합니다. 즉 강한 자에게는 강하고 약한 자에게는 약한 타입의 사람입니다. 단, 이 남성에게 결점이 있다면 입바른 말을 잘해서 괜한 적을 만드는 수가 있고, 무모한 일을 잘하며 매사 자기 판단만 고수하고 남의 충고를 받아들이지 않아 독선적인 면이 있습니다. 

반면, 이 여성의 외형은 세련미가 있으나, 다소 건방져 보이기도 하고 신경질적이며 까다롭게 보이나, 내면은 겁이 많고 연약하며 순진한 면이 있습니다. 따라서 일단 연애를 하거나 아내로 맞이하면 하루가 다르게 새로운 매력에 이끌리게 될 것입니다. 솔직하고 명랑하며, 애교로서 남편의 마음을 사로잡을 것이며, 살림을 알뜰하게 꾸려 나가고 남편의 사업이나 출세에 적극적인 협력자가 되어 줄 것입니다. 
또한 이 여성은 마음에 드는 남성이 발견되면 먼저 용감하게 사랑을 고백하는 대담성도 있으나, 우물쭈물 시간만 끄는 남성은 흥미가 없어 합니다. 즉, 남성이 적극적으로 과감하게 프로포즈해 주기를 바라는 한편, 로맨틱한 감상은 좋아하지 않는 형으로 달콤한 애정 표현이나 유혹 따위에는 넘어가질 않습니다. 그리고 연애와 결혼은 다르다는 생각을 갖고 있으므로, 연애 상대자로서의 남성은 잘 생기고, 세련된 남성을 선택하나, 결혼 상대자는 경제력이 있거나 사회적으로 어느 정도 위치에 있어야만 마음이 움직이게 됩니다. 그러나 화목한 가정을 가꾸려면 경제력 보다는 원만한 성격의 남성을 만나야 합니다. 
결론적으로 이 여성은 평생을 함께 살아도 실증이 나지 않을 만큼 귀여운 아내감 입니다.",
"두 사람의 결합은 불과 금의 상극관계이나 화합하는 상이라서 괜찮은 만남입니다. 
여성이 미약한 불이므로 여성이 남성을 제압한다고 해도 그 형세가 부드러우므로 남녀가 크게 충돌하지 않겠으나, 다만 남편의 입장에서 아내의 충고를 슬기롭게 받아들이고, 아내는 요령 있게 남편을 이끌어야 무난합니다. 

구체적으로 이 남성은 개성이 강하고 황동력이 왕성하며 결단력과 추진력이 남보다 뛰어 납니다. 그래서 사회활동에서 누구에게도 굽히지 않으며, 성깔이 대단해 보여 남이 함부로 얕보지 못합니다. 그러나 내면의 마음은 약해서 차마 모진 일을 뭇하고 뒤가 무르며, 누가 집요하게 파고들면 쩔쩔매는 외강내유형의 사람입니다. 아마 이런 점이 이 남성을 좋아하게 되는 매력일 것입니다. 
가정에서도 아내를 아끼고 자녀를 사랑하는 사람으로서 천하를 호령하는 권세가라고 해도 아내한테는 왠지 약해져서 꼼짝 못합니다. 즉 강한 자에게는 강하고 약한 자에게는 약한 타입의 사람입니다. 단, 이 남성에게 결점이 있다면 입바른 말을 잘해서 괜한 적을 만드는 수가 있고, 무모한 일을 잘하며 매사 자기 판단만 고수하고 남의 충고를 받아들이지 않아 독선적인 면이 있습니다. 

반면, 이 여성은 활발하고 외향적이면서 인정이 많습니다. 또 좋고 싫은 것이 분명해서 누구든 한 번 좋아하면 가식 없이 따르고, 한 번 미워하면 노골적으로 싫은 것을 나타냅니다. 그리고 마음이 약해서 남의 어려운 청을 거절하지 못하며, 미혼시절에 별로 좋아하지 않는 남성에게 차마 냉정하게 대하지 못하는 약점 때문에 당하지 않아도 될 곤욕을 당하거나, 심지어는 끈질긴 구애를 거절하지 못해 결혼까지 하게 될 수도 있습니다. 따라서 이 점에 주의해야 평생 동안 후회가 없을 것입니다. 
반면 결혼해서는 생활력이 강하여 남편 일을 잘 거들고 맞벌이도 주저하지 않습니다. 이 여성을 배우자로 맞이했거나 하려는 남성은 상대의 자존심을 상하게 하는 말을 해서는 안되며, 진심어린 애정의 표시를 하십시오. 그것이 전달된다면 아내는 남편을 위해 어떤 일도 불사할 수 있는 아름다운 성격의 소유자입니다.",
"오행은 상생이어서 좋으나 음양관계는 양과 양이 만났으므로 음양이 잘 배합되지 못한 것이 좀 아쉽습니다. 
두 사람은 자존심이 강해서 서로 지지 않으려는 심리가 작용되나, 아내 편에서 남편에게 아량을 베풀면서 이끌어가면 화목한 가정이 될 것입니다. 또한 부부간에 약간 냉담한 경향이 있고 아기자기한 재미는 부족하나, 경제면으로는 상당한 발전이 있을 것이고 자녀 운도 좋습니다. 

구체적으로 이 남성은 개성이 강하고 활동력이 왕성하며 결단력과 추진력이 남보다 뛰어 납니다. 그래서 사회활동에서 누구에게도 굽히지 않으며, 성깔이 대단해 보여 남이 함부로 깔보지 못합니다. 그러나 내면의 마음은 약해서 차마 모진 일을 못하고 뒤가 무르며, 누가 집요하게 파고들면 쩔쩔매는 외강내유형의 사람입니다. 아마 이런 점이 이 남성을 좋아하게 되는 매력일 것입니다. 
가정에서도 아내를 아끼고 자녀를 사랑하는 사람으로서 천하를 호령하는 권세가라고 해도 아내한테는 왠지 약해져서 꼼짝 못합니다. 즉, 강한 자에게는 강하고 약한 자에게는 약한 타입의 사람입니다. 단, 이 남성에게 결점이 있다면 입바른 말을 잘해서 괜한 적을 만드는 수가 있고, 무모한 일을 잘하며 매사 자기 판단만 고수하고 남의 충고를 받아들이지 않아 독선적인 면이 있습니다. 

반면, 이 여성은 똑똑하고 대담하며 노련한 여장부격인 사람으로, 부드럽고 애교스럽거나 야한 맛을 풍기지는 않으나 세련되고 침착하며, 개성이 강해서 분위기에 잘 말려들지 않고 남의 꼬임에도 넘어가지 않습니다. 그래서 남성이 유혹하기에 가장 힘들고 다루기 어려운 타입의 여성형입니다. 그러나 좋아하는 사람에게는 깊은 애정을 쏟으며, 설사 금전적으로 손해를 보더라도 애정을 쏟기도 합니다. 이처럼 애정면에서 적극적이어서 누가 먼저 프로포즈하건 사귐이 빠르게 진행되며, 시일을 기다리면서 이것저것 재지 않고 즉흥적인 판단을 내립니다. 
반면 좋아하는 남성상은 강한 남성미 보다는, 곱고 단아하면서도 유약해 보이는 남성을 좋아하며, 정조 그 자체를 대단하게 여기지는 않으나 고고하고 도도한 성격 탓에 함부로 몸을 허락하는 행동을 하지는 않습니다. 남편은 사회적, 경제적으로 상당한 위치에 있는 남성이라야 이 여성을 이끌 수 있으며 아니면 차라리 여성이 주도권을 쥐고 남편이 아내의 의견에 따라가는 부부관계가 형성되어야 집안이 평안할 것입니다.",
"남성은 양, 여성은 음이라 음양이 조화되었으며, 상생관계를 이루었습니다. 또한 흙과 금이 만났으니 날로 재산이 늘어가게 됩니다. 
아내는 남편을 위해 알뜰하고 정성어린 반려자가 되어 줄 것이요, 남편은 아내에게 아낌 없는 사랑을 베풀어 주게 되며, 성격적으로도 매우 잘 조화되어 주변으로부터 '잉꼬부부'라는 평을 들을 것입니다. 이처럼 좋은 궁합이니 부부가 되는 것을 망설일 필요가 없습니다. 

구체적으로 이 남성은 개성이 강하고 활동력이 왕성하며 결단력과 추진력이 남보다 뛰어 납니다. 그래서 사회활동에서 누구에게도 굽히지 않으며, 성깔이 대단해 보여 남이 함부로 깔보지 못합니다. 그러나 내면의 마음은 약해서 차마 모진 일을 못하고 뒤가 무르며, 누가 집요하게 파고들면 쩔쩔매는 외강내유형의 사람입니다. 아마 이런 점이 이 남성을 좋아하게 되는 매력일 것입니다. 
가정에서도 아내를 아끼고 자녀를 사랑하는 사람으로서 천하를 호령하는 권세가라고 해도 아내한테는 왠지 약해져서 꼼짝 못합니다. 즉 강한 자에게는 강하고 약한 자에게는 약한 타입의 사람입니다. 단, 이 남성에게 결점이 있다면 입바른 말을 잘해서 괜한 적을 만드는 수가 있고, 무모한 일을 잘하며 매사 자기 판단만 고수하고 남의 충고를 받아들이지 않아 독선적인 면이 있습니다. 

반면, 이 여성은 총명하고 약고 깜짝하며, 다소 신경질적이나 재치가 번득이는 사람입니다. 또한 보수적인 면이 있으면서도, 현대적인 것도 취하고, 가정적이어서 알뜰하고 절약성이 강한 주부상으로 조금도 흠이 없습니다. 단, 남편에게 정도 이상으로 간섭하는 경향이 있으나, 명분상 남편의 위신을 세워 주며, 타인이 그것을 느낄 수 있도록 정성을 기울입니다. 그리고 사람을 대할 때 앞에서는 그를 추켜 주고 비위를 맞추나 진심이 아닌 경우가 많습니다. 즉, 자신에게 유리한 사람에게는 자세도 낮추고 겸손하여 상대의 호감을 사려고 노력하지만 그렇지 않으면 사귀지 않습니다. 
이러한 이해타산은 생활을 하면서도 나타나 궁해도 궁한 체하지 않고 과시하기를 좋아하며, 명예나 이익 관리에 지혜로울 정도로 처신합니다. 따라서 이 여성을 아내로 맞이한다면, 아내의 재치와 순발력, 총명한 두뇌를 잘 수용하고 결점을 잘 타일러 간다면 최상의 반려자가 될 것입니다.",
"두 사람의 결합은 매우 시끄러운 가정이 될 것이서 이런 만남은 그리 좋은 궁합이 아닙니다. 
남녀가 모두 금(金)이요, 음양이 모두 양이어서 강쇠와 강쇠가 부딪치면 소리가 나듯이 마찬가지로 잦은 충돌을 빚을 수가 있습니다. 그러나 드물게는 세상이 깜짝 놀랄 만한 성공을 거두는 수도 있으므로, 만약 이미 부부가 되었다면 아무래도 남성 쪽에서 양보하는 자세로 살아가는 것이 바람직 할 것입니다. 

구체적으로 이 납성은 개성이 강하고 활동력이 왕성하며 결단력과 추진력이 남보다 뛰어 납니다. 그래서 사회활동에서 누구에게도 굽히지 않으며, 성깔이 대단해 보여 남이 함부로 깔보지 못합니다. 그러나 내면의 마음은 약해서 차마 모진 일을 못하고 뒤가 무르며, 누가 집요하게 파고들면 쩔쩔매는 외강내유형의 사람입니다. 아마 이런 점이 이 남성을 좋아하게 되는 매력일 것입니다. 
가정에서도 아내를 아끼고 자녀를 사랑하는 사람으로서 천하를 호령하는 권세가라고 해도 아내한테는 왠지 약해져서 꼼짝 못합니다. 즉 강한 자에게는 강하고 약한 자에게는 약한 타입의 사람입니다. 단, 이 남성에게 결점이 있다면 입바른 말을 잘해서 괜한 적을 만드는 수가 있고, 무모한 일을 잘하며 매사 자기 판단만 고수하고 남의 충고를 받아들이지 않아 독선적인 면이 있습니다. 

반면, 이 여성은 성격이 강하고 솔직하며, 개성이 있고 생활력이 강합니다. 
특히 분위기에 흔들리지 않고 감언이설에 잘 넘어가지 않으며, 명분을 좋아해서 명분 없는 일은 설사 유혹에 이끌릴지라도 절대 행하지 않습니다. 그리고 개방적이며 이상보다 현실에 충실하고 시대의 흐름에 민감합니다. 
반면 바람기가 있는 것 같으면서도 방종하지 않고, 사치와 허영에 빠지지 않으며, 자기 관리에 철저하여 감정에 치우쳐 과오를 범하지 않으며, 정조관념도 강합니다. 결혼해서는 흑 남편이 잘못하면 그것을 눈감아 주지 않고 트집잡고, 바가지도 잘 긁어 대며, 남편의 바람기를 용납하지 않습니다. 
따라서 웬만한 남성은 이 여성에게 쩔쩔매게 되고, 남편을 공처가로 만들기 쉽습니다. 그러나 이해심은 남성 못지않아서 금세 풀어지며, 가정을 위해 최대한의 노력을 아끼지 않을 믿음직스러운 아내의 상입니다.",
"두 사람의 음양이 잘 조화되었으므로 다른 조건만 좋으면 부부가 되어도 무방합니다. 즉, 남자는 양이면서 금이고, 여자는 음이면서 금이어서 비록 같은 쇠끼리 만났지만 여성이 남성의 마음을 잘 읽고 재치와 애교가 있는 만큼 지혜롭게 가정의 화목을 유지할 것입니다. 
반면, 부부간에 냉담한 경향이 있으므로 훈훈한 분위기는 없겠으나 서로의 본분을 지키는 정도로 무리 없이 살아가는 대는 충분하므로 가능하면 제츠처를 써서라도 자녀들과 더불어 웃고 즐기는 가정 분위기를 형성하는 데 노력한다면 남의 모범이 되는 가정을 이룰 수 있습니다. 

구체적으로 이 남성은 개성이 강하고 황동력이 왕성하며 결단력과 추진력이 남보다 뛰어 납니다. 그래서 사회활동에서 누구에게도 굽히지 않으며, 성깔이 대단해 보여 남이 함부로 깔보지 못합니다. 그러나 내면의 마음은 약해서 차마 모진 일을 못하고 뒤가 무르며, 누가 집요하게 파고들면 쩔쩔매는 외강내유형의 사람입니다. 아마 이런 점이 이 남성을 좋아하게 되는 매력일 것입니다. 
가정에서도 아내를 아끼고 자녀를 사랑하는 사람으로서 천하를 호령하는 권세가라고 해도 아내한테는 왠지 약해져서 꼼짝 못합니다. 즉 강한 자에게는 강하고 약한 자에게는 약한 타입의 사람입니다. 단, 이 남성에게 결점이 있다면 입바른 말을 잘해서 괜한 적을 만드는 수가 있고, 무모한 일을 잘하며 매사 자기 판단만 고수하고 남의 충고를 받아들이지 않아 독선적인 면이 있습니다. 

반면, 이 여성은 약고 재치가 있으며 친절하면서도 남성 못지않은 이해심과 아량으로 때로는 좋은 일을 위해서 다소의 손해도 불사합니다. 그리고 특별한 용모를 갖추지 않았더라도 사람을 끄는 매력이 있어 아무리 수수한 차림새라도 야해 보이고 바람기가 있어 보이며, 부담감이 없게 느껴지는 여성이어서 남성들의 유혹을 많이 받게 됩니다. 
가정을 아름답게 꾸미는 데 취미와 소질이 있고, 평범한 삶보다 이상적인 생활환경, 삶의 멋을 추구하는 타입이어서 세상의 이목이나 경제적 구애가 없다고 가정할 때 이 여성은 멋진 연애를 하고 싶고, 결혼 후에도 가장 호화롭고 사치스러운 삶을 영위하고자 할 것입니다. 그리고 서비스가 만점이라서 남편한테 베푸는 애정과 서비스는 그 누구도 따라오지 못합니다. 
좋아하는 남성상은 의젓하고 개성 있고 주관이 뚜렷한 남성을 좋아하며, 자신이 남성을 지배하기를 원하지 않으며, 남편으로 섬기고 싶어합니다. 그렇지 않으면 소위 제비족인 남성에게 유혹 당할 우려가 있습니다.",
"뭇사람들에게 존경 받는 한 쌍의 다정한 부부가 될 수 있는 결합입니다. 
남자는 양이자 금이며, 여자는 양이자 수이어서 서로 상생관계입니다. 비록 같은 양이 만나 대립의 상이 있지만 이 경우는 그렇지 않습니다. 금은 물을 얻어 깨끗해지고, 물은 금을 얻어 생성하는 게 오행의 이치이기 때문에 만약 두 사람이 결혼 한다면 이상하리만큼 모든 일이 순조롭고, 혹은 높은 뜻을 세웠다면 세상에 이름도 떨칠 수 있습니다. 
슬기롭고 자상한 아내, 스케일이 큰 남편이 의기투합해서 어떤 어려운 일이라도 능히 해낼 수 있습니다. 게다가 멋과 낭만까지 즐기며 살아가는 부부가 될 것입니다. 

구체적으로 이 남성은 개성이 강하고 활동력이 왕성하며 결단력과 추진력이 남보다 뛰어 납니다. 그래서 사회활동에서 누구에게도 굽히지 않으며, 성깔이 대단해 보여 남이 함부로 깔보지 못합니다. 그러나 내면의 마음은 약해서 차마 모진 일을 못하고 뒤가 무르며, 누가 집요하게 파고들면 쩔쩔매는 외강내유형의 사람입니다. 아마 이런 점이 이 남성을 좋아하게 되는 매력일 것 입니다. 
가정에서도 아내를 아끼고 자녀를 사랑하는 사람으로서 천하를 호령하는 권세가라고 해도 아내한테는 왠지 약해져서 꼼짝 못합니다. 즉 강한 자에게는 강하고 약한 자에게는 약한 타입의 사람입니다. 단, 이 남성에게 결점이 있다면 입바른 말을 잘해서 괜한 적을 만드는 수가 있고, 무모한 일을 잘하며 매사 자기 판단만 고수하고 남의 충고를 받아들이지 않아 독선적인 면이 있습니다. 

반면, 이 여성은 명랑하고 활발하며 부끄러움을 타지 않고 시원스럽습니다. 또한 성깔도 있고 억센 듯하지만 여성이 갖추어야 할 애교와 매력도 있습니다. 즉, 여성이면서도 배짱이 있고 폭 넓은 아량과 남을 위해 봉사하고 이해하는데 인색하지 않으며, 웬만한 일은 스스로 해결하며 무슨 일에나 태도가 분명합니다. 혹 낭만적인 면이 있어 기분에 따라서 씀씀이가 크지만 계획 없는 낭비는 하지 않으며 써야 할 일이면 손이 크다는 평을 들을 만큼 멋지게 쓰는 타입입니다. 
만일 이 여성에게 경제력만 허용된다면 평소에 꿈꾸던 이상을 실현하여 낙원 같은 가정을 만들어 놓을 것입니다. 단, 남편을 이끌려 하고 시시한 남성은 깔보는 경향이 있으나, 일단 결혼한 뒤에는 그 남편의 인격 여하를 막론하고 아내로서의 본분을 다할 것입니다. 그리고 명분을 존중하여 도리에 어긋나는 행동은 절대로 하지 않는 부인상입니다.",
"음양이 잘 조화되고 금과 물이 만났으니 상생이어서 나무랄 데 없이 좋은 궁합입니다. 
그러나 부부의 금슬이 너무 좋다 보면 필요 이상의 신경을 써서 공연한 질투까지 생길 우려가 있습니다. 그러므로 남편은 아내의 성격을 잘 알아서 아내의 자존심을 상하게 하지 말고 애정을 베풀면 아내는 누구에게도 뒤떨어지지 않는 현모양처가 되어 줄 것입니다. 또한 여성의 입장에서는 남편이 혹 실수를 했더라도 포용력 있는 태도를 취하는 것이 좋습니다. 세심하지 못한 남편을 일일이 탓하려 들면 좋은 애정에 금이 갈 우려가 있기 때문입니다. 

구체적으로 이 납성은 개성이 강하고 활동력이 왕성하며 결단력과 추진력이 남보다 뛰어 납니다. 그래서 사회 활동에서 누구에게도 굽히지 않으며, 성깔이 대단해 보여 남이 함부로 깔보지 못합니다. 그러나 내면의 마음은 약해서 차마 모진 일을 못하고 뒤가 무르며, 누가 집요하게 파고들면 쩔쩔매는 외강내유형의 사람입니다. 아마 이런 점이 이 남성을 좋아하게 되는 매력일 것입니다. 
가정에서도 아내를 아끼고 자녀를 사랑하는 사람으로서 천하를 호령하는 권세가라고 해도 아내한테는 왠지 약해져서 꼼짝 못합니다. 즉 강한 자에게는 강하고 약한 자에게는 약한 타입의 사람입니다. 단, 이 남성에게 결점이 있다면 입바른 말을 잘해서 괜한 적을 만드는 수가 있고, 무모한 일을 잘하며 매사 자기 판단만 고수하고 남의 충고를 받아들이지 않아 독선적인 면이 있습니다. 

반면, 이 여성은 내성적이고 부끄러움을 잘 타며 얌전해서 한국적인 여성상입니다. 그래서 어른들이 가장 좋아할 만한 며느리감이며, 설사 말괄량이 모습을 보인다고 해도 겉보기만 그럴 뿐 막상 자기가 좋아하는 남성 앞에서는 어쩔 수 없이 수줍음을 탑니다. 
애정관은 순정파로 한번 누구를 사랑하면 딴마음을 두지 않고 진심으로 헌신적인 애정을 베풀며, 혹 남성이 자기를 싫어해도 씹게 단념하지 않습니다. 때문에 만약 남성으로부터 배신을 당하면 자기가 정을 준 만큼 증오하고 저주하게 됩니다. 따라서 이 여성과 교제중인 남성들은 만약 일시적으로 사귈 예정이라면 아예 상처를 주지 않는 것이 좋을 것입니다. 
남성은 이런 여성을 아내로 맞이한다면 복입니다. 희생적인 봉사정신과 순정, 현모양처의 조건을 다 갖춘 사람과 결혼한다면, 부자면 말할 것도 없고 비록 궁해도 아껴만 준다면 불평 없이 알뜰하고 성실하게 살아가는 아내가 될 것이기 때문입니다."),
array("두 사람이 부부로 맺어질 경우는 일생 금슬이 좋고 헤어지는 일이 없이 해로할 수 있는 이상적인 만남입니다. 
남자는 음이자 금이요, 여자는 양이자 목이어서, 남녀 음양은 생극관계로 이 배합은 정배합입니다. 남성은 인내력이 부족하고, 침착하지 못한 경향이 있으나 이런 남편을 여성은 잘 리드할 것이며, 남편에게 좀 못마땅한 점이 있어도 자기를 잘 따라주는 까닭에 부인은 불만이 없습니다. 설사 다소 여성의 입장에서 손해를 본다고 해도 이 남성을 만나는 게 운명적으로 유리하며, 피차 더할 나위 없이 좋은 궁합입니다. 

구체적으로 이 남성은 모양새가 있고, 거부감을 느끼게 하지 않는 좋은 인상으로 누구에게나 사귀고 싶은 타입의 사람입니다. 그리고 거만하지 않으며, 폭 넓은 이해력도 있으나 주관이 뚜렷하지 않고 의지력이 약한 경향이 있습니다. 또한 보수적인 경향이 있어 아내가 사회활동 하는 것을 좋아하지 않습니다. 한번 어떤 여성에게 정이 들면 쏙 빠겨 버리며, 비록 그 여성한테 결점이 있더라도 그것을 보지 못하며, 그 결점이 발견되더라도 상관하지 않습니다. 그러나 일단 헤어지거나 상대 여성이 자기를 헐뜯으면 냉정해져서 미련조차 두지 않으며 새로운 연인이 생기면 과거의 인연은 싹 잊어버리고 마는 성격입니다. 
짧건 길건 이 남성은 여성을 사귀는 동안 온갖 정성을 다 기울여 여성을 위해 주고 정열을 쏟으며, 미지 근한 연애는 하지 않으며, 어떤 여성한테 빠지면 주변의 이목 따위는 고려하지 않고 오직 애인과 아내에게만 신경을 쓰고, 기뻐하는 일이면 무엇이든 다 해주려고 하는 사람입니다. 

반면 이 여성은 명랑하고 활발하며 외향적이고 생활력이 매우 강합니다. 
그래서 본래 남에게 위축되지 않는 성격으로 부끄럼을 타지 않으며, 이해심이 많으나 반면, 자존심과 자부심이 무척 강하여 결혼해서 설사 남편이 바람을 피우거나 무관심하게 대해도 드러내 놓고 질투를 하거나 투정을 부리지는 않습니다. 아니 겁내지 않는다는 표현이 맞습니다. 즉 '나 혼자도 잘 살 수 있다'는 자신감이 있기 때문입니다. 그렇다고 가정에서 남편을 무시하거나 하지 않으며, 단 애정의 포로가 되어 울고불고하지 않으며, 바람을 피우지도 않습니다. 
또한 검소하게 살면서 한푼 두푼 저축하는 사람이므로 의존적이고 낭비벽이 있거나 결단력이 부족한 남성의 아내로 좋습니다. ",
"그런대로 나쁘지 않은 궁합입니다. 
남성은 음이자 금이고 여성은 음이자 목이어서 서로 상극관계라 나쁠 것 같으나 남성이 여성을 극하는 것은 부부의 위계가 제대로 된 배합입니다. 단, 두 사람이 모두 음이라는 점에서 편배합을 이루어 약간의 대립할 우려가 있어 부부로 맺어질 경우 간혹 충돌이 예상됩니다. 그러나 마음씨가 착한 여성이 슬기롭게 참고 양보함으로써 원만한 가정을 이룰 것이며 남편쪽에서 폭 넓은 이해심으로 아내의 마음을 편하게 해준다면 더욱 단란하고 화목한 부부관계가 될 것입니다. 

구체적으로 이 남성은 모양새가 있고, 거부감을 느끼게 하지 않는 좋은 인상으로 누구에게나 사귀고 싶은 타입의 사람입니다. 그리고 거만하지 않으며, 폭 넓은 이해력도 있으나 주관이 뚜렷하지 않고 의지력이 약한 경향이 있습니다. 또한 보수적인 경향이 있어 아내가 사회활동 하는 것을 좋아하지 않습니다. 
한번 어떤 여성에게 정이 들면 쏙 빠져 버리며, 비록 그 여성한테 결점이 있더라도 그를 보지 못하며, 그 결점이 발견되더라도 상관하지 않습니다. 그러나 일단 헤어지거나 상대 여성이 자기를 헐뜯으면 냉정해져서 미련조차 두지 않으며 새로운 연인이 생기면 과거의 인연은 싹 잊어버리고 마는 성격입니다. 
짧건 길건 이 남성은 여성을 사귀는 동안 온갖 정성을 다 기울여 여성을 위해 주고 정열을 쏟으며, 미지 근한 연애는 하지 않으며, 어떤 여성한테 빠지면 주변의 이목 따위는 고려하지 않고 오직 애인과 아내에게만 신경을 쓰고, 기뻐하는 일이면 무엇이든 다 해주려고 하는 사람입니다. 

반면, 이 여성은 현모양처의 표상으로, 누구라도 이 여성을 아내로 맞이한다면 행복한 남성이라 해도 지나친 말이 아닐 것입니다. 
활발하고 명랑하면서도 버릇없거나 거칠지 않고, 얌전하면서도 꽁하거나 고집스러운 타입이 아닙니다. 오히려 너무 여성적이고 평범하기에 개성이 없는 것 같으나 그 자체가 바로 이 여성의 장점이며, 튀는 매력은 없어도 싫증이 나지 않는 사람입니다. 또한 살림살이를 운영함에 있어서, 쓸 때는 쓰면서도, 아낄 때는 아끼고, 즉, 낭비를 하거나 인색하지도 않으며, 가정 주부로서의 사명을 다합니다. 결코 분위기에 휩싸여 시간을 망각하는 일도 없으며, 배우자가 커다란 실수를 하여도, 자신의 잘못을 솔직하게 시인하고 용서를 빈다면 스스럼없이 용서해 줄 그런 여인입니다. 
결론적으로 이 여성은 아내로서 엄마로서의 도리를 다할 수 있는 바탕이 되어있는 이상적인 주부라고 하겠습니다.",
"그리 좋은 궁합은 아니나 이렇게 만나고도 화목하게 잘사는 부부들이 많습니다. 이것은 다름아닌 합이 들어 서로 좋아하도록 되어 있기 때문입니다. 
남성은 음이자 금이고, 여성은 양이자 불로서, 남녀의 위계가 정반대인 배합으로, 즉 여성이 남성을 극하고, 남성은 여성의 극을 받는 입장입니다. 또한 남성이 여성한테 반하기 쉬우며 다만, 부부로 맺어질 경우 남성은 가정의 주도권을 여성에 맡기고 기분 좋게 따라 줄 각오가 되어 있어야 행복한 가정을 꾸려나갈 것입니다. 

구체적으로 이 남성은 모양새가 있고, 거부감을 느끼게 하지 않는 좋은 인상으로 누구에게나 사귀고 싶은 타입의 사람입니다. 그리고 거만하지 않으며, 폭 넓은 이해력도 있으나 주관이 뚜렷하지 않고 의지력이 약한 경향이 있습니다. 또한 보수적인 경향이 있어 아내가 사회활동 하는 것을 좋아하지 않습니다. 
한번 어떤 여성에게 정이 들면 쏙 빠져 버리며, 비록 그 여성한테 결점이 있더라도 그것을 보지 못하며, 그 결점이 발견되더라도 상관하지 않습니다. 그러나 일단 헤어지거나 상대 여성이 자기론 헐뜯으면 냉정해져서 미련조차 두지 않으며 새로운 연인이 생기면 과거의 인연은 싹 잊어버리고 마는 성격입니다. 
짧건 길건 이 남성은 여성을 사귀는 동안 온갖 정성을 다 기울여 여성을 위해 주고 정열을 쏟으며, 미지 근한 연애는 하지 않으며, 어떤 여성한테 빠지면 주변의 이목 따위는 고려하지 않고 오직 애인과 아내에게만 신경을 쓰고, 기뻐하는 일이면 무엇이든 다 해주려고 하는 사람입니다. 

반면, 이 여성의 외형은 세련미가 있으나, 다소 건방져 보이기도 하고 신경질적이며 까다롭게 보이지만 내면은 겁이 많고 연약하며 순진한 면이 있습니다. 따라서 일단 연애를 하거나 아내로 맞이하면 하루가 다르게 새로운 매력에 이끌리게 될 것입니다. 솔직하고 명랑하며, 애교로서 남편의 마음을 사로잡을 것이며, 살림을 알뜰하게 꾸려 나가고 남편의 사업이나 출세에 적극적인 협력자가 되어 줄 것 입니다. 
또한 이 여성은 마음에 드는 남성이 발견되면 먼저 용감하게 사랑을 고백하는 대담성도 있으나, 우물쭈물 시간만 끄는 남성은 흥미가 없어 합니다, 즉, 남성이 적극적으로 과감하게 프로포즈해 주기를 바라는 한편, 로맨틱한 감상은 좋아하지 않는 형으로 달콤한 애정 표현이나 유혹 따위에는 넘어가질 않습니다. 그리고 연애와 결혼은 다르다는 생각을 갖고 있으므로, 연애 상대자로서의 남성은 잘생기고, 세련된 남성을 선택하나, 결혼 상대자는 경제력이 있거나 사회적으로 어느 정도 위치에 있어야만 마음이 움직이게 됩니다. 그러나 화목한 가정을 가꾸려면 경제력 보다는 원만한 성격의 남성을 만나야 합니다. 
결론적으로 이 여성은 평생을 함께 살아도 싫증이 나지 않을 만큼 귀여운 아내감 입니다.",
"남녀 궁합에 있어 가장 꺼리는 경우가 여성이 남성을 극하면서도 음양이 같은 것입니다. 그런데 두 사람의 배합이 여기에 해당합니다. 따라서 운명적 작용이나 성격적으로도 맞지 않으므로 서로 만나면 거부감이 생기고, 특히 여성 편에서 남성을 깔보게 되어 있습니다. 
그러므로 만약 연애 시절에는 좋아한다고 해서 부부로 맺어진다면 충돌이 빈번할 것이며 서로 상대방의 결점만 부각되어 날이 갈수록 싫증이 나고 멀어질 가능성이 있습니다. 따라서 많은 인내와 이해가 없다면 일생동안 해로하기가 어려울 것입니다. 

구체적으로 이 남성은 모양새가 있고, 거부감을 느끼게 하지 않는 좋은 인상으로 누구에게나 사귀고 싶은 타입의 사람입니다. 그리고 거만하지 않으며, 폭 넓은 이해력도 있으나 주관이 뚜렷하지 않고 의지력이 약한 경향이 있습니다. 또한 보수적인 경향이 있어 아내가 사회활동 하는 것은 좋아하지 않습니다. 
한번 어떤 여성에게 정이 들면 쏙 빠져 버리며, 비록 그 여성한테 결점이 있더라도 그것을 보지 못하며, 그 결점이 발견되더라도 상관하지 않습니다. 그러나 일단 헤어지거나 상대 여성이 자기를 헐뜯으면 냉정해져서 미련조차 두지 않으며, 새로운 연인이 생기면 과거의 인연은 싹 잊어버리고 마는 성격입니다. 
짧건 길건 이 남성은 여성을 사귀는 동안 온갖 정성을 다 기울여 여성을 위해 주고 정열을 쏟으며, 미지 근한 연애는 하지 않으며, 어떤 여성한테 빠지면 주변의 이목 따위는 고려하지 않고 오직 애인과 아내에게만 신경을 쓰고, 기뻐하는 일이면 무엇이든 다 해주려고 하는 사람입니다. 

반면, 이 여성은 활발하고 외향적이면서 인정이 많습니다. 또 좋고 싫은 것이 분명해서, 누구든 한 번 좋아하면 가식 없이 따르고, 한 번 미워하면 노골적으로 싫은 것을 나타냅니다. 그리고 마음이 약해서 남의 어려운 청을 거절하지 못하며, 미혼시절에 별로 좋아하지 않는 남성에게 차마 냉정하게 대하지 못하는 약점 때문에 당하지 않아도 될 곤욕을 당하거나, 심지어는 끈질긴 구애를 거절하지 못해 결혼까지 하게 될 수도 있습니다. 따라서 이 점에 주의해야 평생 동안 후회가 없을 것입니다. 
반면 결혼해서는 생활력이 강하여 남편 일을 잘 거들고 맞벌이도 주저하지 않습니다. 이 여성을 배우자로 맞이했거나 하려는 남성은 상대의 자존심을 상하게 하는 말을 해서는 안되며, 진심어린 애정의 표시를 하십시오. 그것이 전달된다면 아내는 남편을 위해 어떤 일도 불사할 수 있는 아름다운 성격의 소유자입니다.",
"음양이 잘 조화되었으므로 확고한 부부로 맺어질 수 있습니다. 
남성은 음이고 여성은 양이어서 조화된 배합이며, 흙과 금이 만났기에 상생관계라고 할 수 있습니다. 여성, 즉 아내 입장에서 남편에게 못마땅한 점이 있더라도 싫지 않으므로 능히 소화시킬 뿐 아니라 애정을 동반한 동정심이 발하여 남편에게 잘 대해줄 것입니다. 
또한 남편은 노련하고 침착한 아내가 든든하여 의지하고 싶어지고 아내의 간섭이나 리드가 싫지 않으므로 남편의 입장에서 매우 편하게 살아갈 수 있는 아내를 만난 좋은 배합입니다. 

구체적으로 이 남성은 모양새가 있고, 거부감을 느끼게 하지 않는 좋은 인상으로 누구에게나 사귀고 싶은 타입의 사람입니다. 그리고 거만하지 않으며, 폭 넓은 이해력도 있으나 주관이 뚜렷하지 않고 의지력이 약한 경향이 있습니다. 또한 보수적인 경향이 있어 아내가 사회활동 하는 것을 좋아하지 않습니다. 
한번 어떤 여성에게 정이 들면 쏙 빠져 버리며, 비록 그 여성한테 결점이 있더라도 그것을 보지 못하며, 그 결점이 발견되더라도 상관하지 않습니다. 그러나 일단 헤어지거나 상대 여성이 자기를 헐뜯으면 냉정해져서 미련조차 두지 않으며, 새로운 연인이 생기면 과거의 인연은 싹 잊어버리고 마는 성격입니다. 
짧건 길건 이 성은 여성을 사귀는 동안 온갖 정성을 다 기울여 여성을 위해 주고 정열을 쏟으며, 미지근한 연애는 하지 않으며, 어떤 여성한테 빠지면 주변의 이목 따위는 고려하지 않고 오직 애인과 아내에게만 신경을 쓰고, 기뻐하는 일이면 무엇이든 다 해주려고 하는 사람입니다 

반면, 이 여성은 똑똑하고 대담하며 노련한 여장부격인 사람으로, 부드럽고 애교스럽거나 야한 맛을 풍기지는 않으나 세련되고 침착하며, 개성이 강해서 분위기에 잘 말려들지 않고 남의 꼬임에도 넘어가지 않습니다. 그래서 남성이 유혹하기에 가장 힘들고 다루기 어려운 타입의 여성형입니다. 그러나 좋아하는 사람에게는 깊은 애정을 쏟으며, 설사 금전적으로 손해를 보더라도 애정을 쏟기도 합니다. 이처럼 애정면에서 적극적이어서 누가 먼저 프로포즈하건 사귐이 빠르게 진행되며, 시일을 기다리면서 이것저것 재지 않고 즉흥적인 판단을 내립니다. 
반면 좋아하는 남성상은 강한 남성미 보다는, 곱고 단아하면서도 유약해 보이는 남성을 좋아하며, 정조 그 자체를 대단하게 여기지는 않으나 고고하고 도도한 성격 탓에 함부로 몸을 허락하는 행동을 하지는 않습니다. 
남편은 사회적, 경제적으로 상당한 위치에 있는 남성이라야 이 여성을 이끌 수 있으며 아니면 차라리 여성이 주도권을 쥐고 남편이 아내의 의견에 따라가는 부부관계가 형성되어야 집안이 평안할 것입니다.",
"남성은 음이자 금이고, 여성은 음이자 흙으로 음양의 조화는 이루지 못했으나 상생궁합입니다. 또한 성격면에서 서로 호흡이 잘 맞으므로 비교적 좋은 궁합입니다. 
단, 다른 사람들에게 두 사람은 왠지 찬바람이 돌고 박정한 느낌마저 들 수 있으므로 결혼 후에는 좀더 폭 넓은 안목을 가지고 두 부부만 존재하는 사회가 아니라는 점을 깨달아 원만한 대인관계를 이루면 더할 나위 없겠습니다. 

구체적으로 이 남성은 모양새가 있고, 거부감을 느끼게 하지 않는 좋은 인상으로 누구에게나 사귀고 싶은 타입의 사람입니다. 그리고 거만하지 않으며, 폭 넓은 이해력도 있으나 주관이 뚜렷하지 않고 의지력이 약한 경향이 있습니다. 
또한 보수적인 경향이 있어 아내가 사회활동 하는 것을 좋아하지 않습니다. 한번 어떤 여성에게 정이 들면 쏙 빠겨 버리며, 비록 그 여성한테 결점이 있더라도 그것을 보지 못하며, 그 결점이 발견되더라도 상관하지 않습니다. 그러나 일단 헤어지거나 상대 여성이 자기를 헐뜯으면 냉정해져서 미련조차 두지 않으며 새로운 연인이 생기면 과거의 인연은 싹 잊어버리고 마는 성격입니다. 
짧건 길건 이 남성은 여성을 사귀는 동안 온갖 정성을 다 기울여 여성을 위해 주고 정열을 쏟으며, 미지근한 연애는 하지 않으며, 어떤 여성한테 빠지면 주변의 이목 따위는 고려하지 않고 오직 애인과 아내에게만 신경을 쓰고, 기뻐하는 일이면 무엇이든 다 해주려고 하는 사람입니다. 

반면, 이 여성은 총명하고 약고 깜짝하며, 다소 신경질적이나 재치가 번득이는 사람입니다. 또한 보수적인 면이 있으면서도, 현대적인 것도 취하고, 가정적이어서 알뜰하고 절약성이 강한 주부상으로 조금도 흠이 없습니다. 
단, 남편에게 정도 이상으로 간섭하는 경향이 있으나, 명분상 남편의 위신을 세워 주며, 타인이 그것을 느낄 수 있도록 정성을 기울입니다. 그리고 사람을 대할 때 앞에서는 그를 추켜 주고 비위를 맞추나 진심이 아닌 경우가 많습니다. 즉, 자신에게 유리한 사람에게는 자세도 낮추고 겸손하여 상대의 호감을 사려고 노력하지만 그렇지 않으면 사귀지 않습니다. 이러한 이해타산은 생활을 하면서도 나타나 궁해도 궁한 체하지 않고 과시하기를 좋아하며, 명예나 이익 관리에 지혜로울 정도로 처신합니다. 
따라서 이 여성을 아내로 맞이한다면, 아내의 재치와 순발력, 총명한 두뇌를 잘 수용하고 결점을 잘 타일러 간다면 최상의 반려자가 될 것입니다.",
"좋을 것도 없지만 그렇다고 해서 나쁜 궁합도 아닙니다. 
남성은 음이고 금이며, 여성은 양이고 금이어서 서로 쇠끼리 부딪혀 소리가 난다고 해서 좋게 여겨지진 않습니다. 그러나 이 경우는 음양이 조화를 이루었기 때문에 나쁜 궁합은 아닌 것 입니다. 
만약 부부로 인연을 맺는다면 남편은 아내에게 의존해야 하고, 아내는 남편을 달래면서 요령 있게 살아야 부부관계가 원만하겠습니다. 또한 아내가 다소 남편을 아래로 보고, 남편은 아내가 벅차 어쩔 수 없이 아내에게 양보하게 되나 의지력이 약하고 귀가 얇은 남성 입장에서는 억세고 야무진 이 여성을 아내로 맞이하는 것이 다행인지도 모릅니다. 

구체적으로 이 남성은 모양새가 있고, 거부감을 느끼게 하지 않는 좋은 인상으로 누구에게나 사귀고 싶은 타입의 사람입니다. 그리고 거만하지 않으며, 폭 넓은 이해력도 있으나 주관이 뚜렷하지 않고 의지력이 약한 경향이 있습니다. 
또한 보수적인 경향이 있어 아내가 사회활동 하는 것을 좋아하지 않습니다. 한번 어떤 여성에게 정이 들면 쏙 빠겨 버리며, 비록 그 여성한테 결점이 있더라도 그것을 보지 못하며, 그 결점이 발견되더라도 상관하지 않습니다. 그러나 일단 헤어지거나 상대 여성이 자기를 헐뜯으면 냉정해져서 미련조차 두지 않으며, 새로운 연인이 생기면 과거의 인연은 싹 잊어버리고 마는 성격입니다. 
짧건 길건 이 남성은 여성을 사귀는 동안 온갖 정성을 다 기울여 여성을 위해 주고 정열을 쏟으며, 미지 근한 연애는 하지 않으며, 어떤 여성한테 빠지면 주변의 이목 따위는 고려하지 않고 오직 애인과 아내에게만 신경을 쓰고, 기뻐하는 일이면 무엇이든 다 해주려고 하는 사람입니다. 

반면, 이 여성은 성격이 강하고 솔직하며, 개성이 있고 생활력이 강합니다. 특히 분위기에 흔들리지 않고 감언이설에 잘 넘어가지 않으며, 명분을 좋아해서 명분 없는 일은 설사 유혹에 이끌릴지라도 절대 행하지 않습니다. 그리고 개방적이며 이상보다 현실에 충실하고 시대의 흐름에 민감합니다. 
반면 바람기가 있는 것 같으면서도 방종하지 않고, 사치와 허영에 빠지지 않으며, 자기 관리에 철저하여 감정에 치우쳐 과오를 범하지 않으며, 정조관념도 강합니다. 결혼해서는 혹 남편이 잘못하면 그것을 눈감아 주지 않고 트집잡고, 바가지도 잘 긁어대며, 남편의 바람기를 용납하지 않습니다. 
따라서 웬만한 남성은 이 여성에게 쩔쩔매게 되고, 남편을 공처가로 만들기 쉽습니다. 그러나 이해심은 남성 못지않아서 금세 풀어지며, 가정을 위해 최대한의 노력을 아끼지 않을 믿음직스러운 아내의 상입니다.",
"같은 음금(金)끼리 만났으므로 별로 좋은 관계는 아닙니다. 
두 남녀가 마음이 맞을 때는 이 세상에 다시 없이 좋은 상대를 만난 것처럼 사랑을 열렬히 하지만 사랑이 식은 뒤에는 냉랭한 분위기가 지속되기 쉽습니다. 따라서 이런 남녀관계는 연애 상대는 되어도 결혼상대로는 좋지 못하며, 설사 부부가 되어 의좋게 살아갈지라도 보수성이 짙은 남편과 자유분방한 아내라서 의견 차이를 좁히기 어렵습니다. 게다가 두 남녀는 의처증, 의부증이 생길 우려가 있어 서로 상대를 피곤하게 할 수 있으며, 특히 남성보다 여성편에서 불만이 더 많을 수 있습니다. 

구체적으로 이 남성은 모양새가 있고, 거부감을 느끼게 하지 않는 좋은 인상으로 누구에게나 사귀고 싶은 타입의 사람입니다. 그리고 거만하지 않으며, 폭 넓은 이해력도 있으나 주잔이 뚜렷하지 않고 의지력이 약한 경 향이 있습니다. 또한 보수적인 경향이 있어 아내가 사회황동 하는 것을 좋아하지 않습니다. 한번 어떤 여성에게 정이 들면 쏙 빠겨 버리며, 비록 그 여성한테 결점이 있더라도 그것을 보지 못하며, 그 결점이 발견되더라도 상관하지 않습니다. 
그러나 일단 헤어지거나 상대 여성이 자기를 헐뜯으면 냉정해져서 미련조차 두지 않으며 새로운 연인이 생기면 과거의 인연은 싹 잊어버리고 마는 성격입니다. 짧건 길건 이 남성은 여성을 사귀는 동안 온갖 정성을 다 기울여 여성을 위해 주고 정열을 쏟으며, 미지근한 연애는 하지 않으며, 어떤 여성한테 빠지면 주변의 이목 따위는 고려하지 않고 오직 애인과 아내에게만 신경을 쓰고, 기뻐하는 일이면 무엇이든 다 해주려고 하는 사람입니다. 

반면, 이 여성은 약고 재치가 있으며 친절하면서도 남성 못지않은 이해심과 아량으로 때로는 좋은 일을 위해서 다소의 손해도 불사합니다. 그리고 특별한 용모를 갖추지 않았더라도 사람을 끄는 매력이 있어 아무리 수수한 차림새라도 야해 보이고 바람기가 있어 보이며, 부담감이 없게 느껴지는 여성이어서 남성들의 유혹을 많이 받게 됩니다. 
가정을 아름답게 꾸미는데 취미와 소질이 있고, 평범한 삶보다 이상적인 생황환경, 삶의 멋을 추구하는 타입이어서 세상의 이목이나 경제적 구애가 없다고 가정할 때 이 여성은 멋진 연애를 하고 싶고, 결혼 후에도 가장 호화롭고 사치스러운 삶을 영위하고자 할 것입니다. 그리고 서비스가 만점이라서 남편한테 베푸는 애정과 서비스는 그 누구도 따라오지 못합니다. 
좋아하는 남성상은 의젓하고 개성 있고 주관이 뚜렷한 남성을 좋아하며, 자신이 남성을 지배하기를 원하지 않으며, 남편으로 섬기고 싶어합니다. 그렇지 않으면 소위 제비족인 남성에게 유혹당할 우려가 있습니다.",
"두 남녀의 성격차이는 비록 심해도 서로 좋아하여 호흡이 잘 맞는 부부가 될 것입니다. 
남성이 음이고, 여성은 양에 해당하여 음양이 잘 조화되었으며, 또한 금과 물은 상생관계를 이루었기 때문입니다. 남편은 아내가 믿음직하고 사랑스러워 어떠한 요구도 다 들어주고 싶은 마음이 생기게 되며, 아내의 억세고 괄괄한 성격도 부담감이 없이 자연스럽게 느껴집니다. 
또한 여성의 입장에서는 평소 바라던 남편감은 아니라고 생각되어도 남편에게 왠지 정이 가고 권태롭지 않기 때문에 이 배합은 행복한 가정을 영위할 수 있습니다. 

구체적으로 이 남성은 모양새가 있고, 거부감을 느끼게 하지 않는 좋은 인상으로 사귀고 싶은 타입의 사람입니다. 그리고 거만하지 않으며, 폭 넓은 이해력도 있으나 주관이 뚜렷하지 않고 의지력이 약한 경향이 있습니다. 또한 보수적인 경향이 있어 아내가 사회활동 하는 것을 좋아하지 않습니다. 
한번. 어떤 여성에게 정이 들면 쏙 빠져 버리며, 비록 그 여성한테 결점이 있더라도 그것을 보지 못하며, 그 결점이 발견되더라도 상관하지 않습니다. 그러나 일단 헤어지거나 상대 여성이 자기를 헐뜯으면 냉정해져서 미련조차 두지 않으며, 새로운 연인이 생기면 과거의 인연은 싹 잊어버리고 마는 성격입니다. 
짧건 길건 이 남성은 여성을 사귀는 동안 온갖 정성을 다 기울여 여성을 위해 주고 정열을 쏟으며, 미지 근한 연애는 하지 않으며, 어떤 여성한테 빠지면 주변의 이목 따위는 고려하지 않고 오직 애인과 아내에게만 신경을 쓰고, 기뻐하는 일이면 무엇이든 다 해주려고 하는 사람입니다. 

반면, 이 여성은 명랑하고 활발하며 부끄러움을 타지 않고 시원스럽습니다. 또한 성깔도 있고 억센 듯하지만 여성이 갖추어야 할 애교와 매력도 있습니다. 즉, 여성이면서도 배짱이 있고 폭 넓은 아량과 남을 위해 봉사하고 이해하는데 인색하지 않으며, 웬만한 일은 스스로 해결하며 무슨 일에나 태도가 분명합니다. 혹 낭만적인 면이 있어 기분에 따라서 씀씀이가 크지만 계획 없는 낭비는 하지 않으며 써야 할 일이면 손이 크다는 평을 들을 만큼 멋지게 쓰는 타입입니다 . 
만일 이 여성에게 경제력만 허용된다면 평소에 꿈꾸던 이상을 실현하여 낙원 같은 가정을 만들어 놓을 것입니다. 단, 남편을 이끌려 하고 시시한 남성은 깔보는 경향이 있으나, 일단 결혼한 뒤에는 그 남편의 인격 여하를 막론하고 아내로서의 본분을 다할 것입니다. 그리고 명분을 존중하여 도리에 어긋나는 행동은 절대로 하지 않는 부인상입니다.",
"남성은 오행이 금이고, 여성은 오행이 물이어서 상생관계를 이루니 크게 좋지도 나쁘지도 않습니다. 따라서 부부로 맺어질 경우 서로 싫어한다거나 운명상의 나쁜 결과는 없습니다. 
다만 두 사람의 성격상 상대를 어려워해서 서로 인격을 존중하면서 조심스럽게 살아가다가 어쩌다 오해가 생기거나 한번 불화가 생기면 냉랭한 분위기가 오래 지속될 우려가 있습니다. 그러므로 남편이 먼저 아내의 서운한 마음을 풀어주도록 노력해야 합니다. 

구체적으로 이 남성은 모양새가 있고, 거부감을 느끼게 하지 않는 좋은 인상으로 누구에게나 사귀고 싶은 타입의 사람입니다. 그리고 거만하지 않으며, 폭 넓은 이해력도 있으나 주관이 뚜렷하지 않고 의지력이 약한 경향이 있습니다. 또한 보수적인 경향이 있어 아내가 사회활동 하는 것을 좋아하지 않습니다. 
한번 어떤 여성에게 정이 들면 쏙 빠겨 버리며, 비록 그 여성한테 결점이 있더라도 그것을 보지 못하며, 그 결점이 발견되더라도 상관하지 않습니다. 그러나 일단 헤어지거나 상대 여성이 자기를 헐뜯으면 냉정해져서 미련조차 두지 않으며, 새로운 연인이 생기면 과거의 인연은 싹 잊어버리고 마는 성격입니다. 
짧건 길건 이 남성은 여성을 사귀는 동안 온갖 정성을 다 기울여 여성을 위해 주고 정열을 쏟으며, 미지 근한 연애는 하지 않으며, 어떤 여성한테 빠지면 주변의 이목 따위는 고려하지 않고 오직 애인과 아내에게만 신경을 쓰고, 기뻐하는 일이면 무엇이든 다 해주려고 하는 사람입니다. 

반면, 이 여성은 내성적이고 부끄러움을 잘 타며 얌전해서 한국적인 여성상입니다. 그래서 어른들이 가장 좋아할 만한 며느리감이며, 설사 말괄량이 모습을 보인다고 해도 겉보기만 그럴 뿐 막상 자기가 좋아하는 남성 앞에서는 어쩔 수 없이 수줍음을 탑니다. 
애정관은 순정파로 한번 누구를 사랑하면 딴마음을 두지 않고 진심으로 헌신적인 애정을 베풀며, 혹 남성이 자기론 싫어해도 입게 단념하지 않습니다 때문에 만약 남성으로부터 배신을 당하면 자기가 정을 준 만큼 증오하고 저주하게 됩니다. 따라서 이 여성과 교제중인 남성들은 만약 일시적으로 사귈 예정이라면 아예 상처를 주지 않는 것이 좋을 것입니다. 
남성은 이런 여성을 아내로 맞이한다면 복입니다. 희생적인 봉사정신과 순정, 현모양처의 조건을 다 갖춘 사람과 결혼한다면, 부자면 말할 것도 없고 비록 궁해도 아껴만 준다면 불평 없이 알뜰하고 성실하게 살아가는 아내가 될 것이기 때문입니다."),
array("남자는 양이고 물이며, 여자는 양이고 목이어서 음양의 배합을 이루지 못했으나 상생관계 입니다. 
또한 두 사람 모두가 타고난 성격이 원만하고 너그러워 아내가 남편에게 무엇이든지 요구하면 무리가 없는 한 남편은 기꺼이 받아들여 즐겁게 살아가는 부부 관계가 될 깃입니다. 그런데 묘한 것은 비교적 애교가 없고 노련하며 어른 티가 나는 이 여성이 남편에게는 부담을 느끼지 않아 억지도 쓰고 싶고 어리광도 부리고 싶은 마음이 들며, 남편은 아내의 이런 점을 매우 좋아하게 되어 좋은 남녀관계로 이루어질 궁합입니다.

구체적으로 이 남성은 급할 때는 불같이 급하고 느릴 때는 한없이 느긋하여 급한 사람인지 느린 사람인지 분간하기 어려운 사람입니다. 그러나 분명한 것은 환경과 분위기에 따라 적절한 처세를 하는 유형이며, 성질이 나기 전에는 사람이 좋고, 자기 손해도 불사하면서 후한 인심을 베풀지만 한번 성질이 나면 위아래나 예의 따위는 무시하고 행동하는 사람입니다. 
반면, 얄팍한 잔꾀는 부리지 못하며 도리어 남의 꾀에 속는 수가 있으며, 실속보다는 체면, 가정 보다 사회에 비중을 두어 아내의 입장에서는 불만스럽고 짜증이 나도 그런 남편이 밉거나 권태롭지는 않을 것입니다. 이 남성은 자기 잘못이 있으면 슬기롭게 시인하고 쩔쩔매는 약한 면이 있으며, 바로 이 점이 이 남성의 인간미라고 할 수 있습니다. 

반면 이 여성은 명랑하고 활발하며 외향적이고 생활력이 매우 강합니다. 
그래서 본래 남에게 위축되지 않는 성격으로 부끄럼을 타지 않으며, 이해심이 많으나 반면, 자존심과 자부심이 무척 강하여 결혼해서 설사 남편이 바람을 피우거나 무관심하게 대해도 드러내 놓고 질투를 하거나 투정을 부리지는 않습니다. 아니 겁내지 않는다는 표현이 맞습니다. 즉 '나 혼자도 잘 살 수 있다'는 자신감이 있기 때문입니다. 그렇다고 가정에서 남편을 무시하거나 하지 않으며, 단, 애정의 포로가 되어 울고불고하지 않으며, 바람을 피우지도 않습니다. 
또한 검소하게 살면서 한푼 두푼 저축하는 사람이므로 의존적이고 낭비벽이 있거나 결단력이 부족한 남성의 아내로 좋습니다.",
"두 사람은 서로의 마음과 마음이 매우 잘 통하는 정배합 그 이상으로 이상적인 커플이며, 좋은 궁합입니다. 
남성은 양이고 여성은 음이므로 남녀 음양이 잘 조화가 되었으며, 또한 물과 나무의 만남으로 상생관계를 이룬 배합입니다. 또한 두 사람은 부부이기도 하면서 서로를 잘 알아주는 지기관계도 되므로 평범한 부부관계를 넘어 좋은 결합이라고 하겠습니다. 

구체적으로 이 남성은 급할 때는 불같이 급하고 느릴 때는 한없이 느긋하여 급한 사람인지 느린 사람인지 분간하기 어려운 사람입니다. 그러나 분명한 것은 환경과 분위기에 따라 적절한 처세를 하는 유형이며, 성질이 나기 전에는 사람이 좋고, 자기 손해도 불사하면서 후한 인심을 베풀지만 한번 성질이 나면 위아래나 예의 따위는 무시하고 행동하는 사람입니다. 
반면, 얄팍한 잔꾀는 부리지 못하며 도리어 남의 꾀에 속는 수가 있으며, 실속보다는 체면, 가정 보다 사회에 비중을 두어 아내의 입장에서는 불만스럽고 짜증이 나도 그런 남편이 밉거나 권태롭지는 않을 것입니다. 이 남성은 자기 잘못이 있으면 슬기롭게 시인하고 쩔쩔매는 약한 면이 있으며, 바로 이 점이 이 남성의 인간미라고 할 수 있습니다. 

반면, 이 여성은 현모양처의 표상으로, 누구라도 이 여성을 아내로 맞이한다면 행복한 남성이라 해도 지나친 말이 아닐 것입니다, 활발하고 명랑하면서도 버릇없거나 거칠지 않고, 얌전하면서도 꽁하거나 고집스러운 타입이 아닙니다. 오히려 너무 여성적이고 평범하기에 개성이 없는 것 같으나 그 자체가 바로 이 여성의 장점이며, 뒤는 매력은 없어도 싫증이 나지 않는 사람입니다. 또한 살림살이를 운영함에 있어서, 쓸 때는 쓰면서도, 아낄 때는 아끼고, 즉, 낭비를 하거나 인색하지도 않으며, 가정 주부로서의 사명을 다합니다. 결코 분위기에 휩싸여 시간을 망각하는 일도 없으며, 배우자가 커다란 실수를 하여도, 자신의 잘못을 솔직하게 시인하고 용서를 빈다면 스스럼없이 용서해 줄 그런 여인입니다. 
결론적으로 이 여성은 아내로서 엄마로서의 도리를 다할 수 있는 바탕이 되어있는 이상적인 주부라고 하겠습니다.",
"두 사람의 궁합을 음양과 오형의 관계로 보면 양 대 양이 만났으며, 부딪히는 형국이라 매우 불길한 것 같습니다. 
그러나 남성이 여성을 극하는 관계로서 편배합을 이루었으므로, 이런 만남도 나쁘지는 않습니다. 서로 자존심이 강해도 상대방의 성격을 잘 알아서 자존심을 상하게 하지 않을 것이며, 남편은 아내의 괄괄한 성격을 능히 조화시킬 수 있고, 아내는 남편을 깔보지 못합니다. 그러므로 성격적으로 잘 맞는 것은 아니지만 큰 충돌이 없이 원만한 가정을 영위할 것 입니다.

구체적으로 이 남성은 급할 때는 불같이 급하고 느릴 때는 한없이 느긋하여 급한 사람인지 느린 사람인지 분간하기 어려운 사람입니다. 그러나 분명한 것은 환경과 분위기에 따라 적절한 처세를 하는 유형이며, 성질이 나기 전에는 사람이 좋고, 자기 손해도 불사하면서 후한 인심을 베풀지만 한번 성질이 나면 위 아래나 예의 따위는 무시하고 행동하는 사람입니다. 
반면, 얄팍한 잔꾀는 부리지 못하며 도리어 남의 꾀에 속는 수가 있으며, 실속보다는 체면, 가정 보다 사회에 비중을 두어 아내의 입장에서는 불만스럽고 짜증이 나도 그런 남편이 밉거나 권태롭지는 않을 것입니다. 이 남성은 자기 잘못이 있으면 슬기롭게 시인하고 쩔쩔매는 약한 면이 있으며, 바로 이 점이 이 남성의 인간미라고 할 수 있습니다. 

반면, 이 여성의 외형은 세련미가 있으나, 다소 건방져 보이기도 하고 신경질적이며 까다롭게 보이지만, 내면은 겁이 많고 연약하며 순진한 면이 있습니다. 따라서 일단 연애를 하거나 아내로 맞이하면 하루가 다르게 새로운 매력에 이끌리게 될 것입니다. 
솔직하고 명랑하며, 애교로서 남편의 마음을 사로잡을 것이며, 살림을 알뜰하게 꾸려 나가고 남편의 사업이나 출세에 적극적인 협력자가 되어 줄 것 입니다. 또한 이 여성은 마음에 드는 남성이 발견되면 먼저 용감하게 사랑을 고백하는 대담성도 있으나, 우물쭈물 시간만 끄는 남성은 흥미가 없어 합니다. 즉, 남성이 적극적으로 과감하게 프로포즈해 주기를 바라는 한편, 로맨틱한 감상은 좋아하지 않는 형으로 달콤한 애정 표현이나 유혹 따위에는 넘어가질 않습니다. 그리고 연애와 결혼은 다르다는 생각을 갖고 있으므로, 연애 상대자로서의 남성은 잘생기고, 세련된 남성을 선택하나, 결혼 상대자는 경제력이 있거나 사회적으로 어느 정도 위치에 있어야만 마음이 움직이게 됩니다. 그러나 화목한 가정을 가꾸려면 경제력 보다는 원만한 성격의 남성을 만나야 합니다. 
결론적으로 이 여성은 평생을 함께 살아도 싫증이 나지 않을 만큼 귀여운 아내감 입니다.",
"물론 성격상 차이는 많으나 아내는 남편을 깔보지 못해 남편을 따라가는 자세로 살아가겠으며, 남편은 아내를 잘 이끌어 갈 것입니다. 때문에 두 사람의 결합에서 남성보다 여성 쪽에서 이런 배합을 만나는 게 다행입니다. 
비록 간간이 의견 대립은 있으나 일단 부부로서 맺어지면 절대로 파탄에 이르지 않고, 또한 두 남녀가 천명을 누릴 때까지 해로할 궁합입니다. 

구체적으로 이 남성은 급할 때는 불같이 급하고 느릴 때는 한없이 느긋하여 급한 사람인지 느린 사람인지 분간하기 어려운 사람입니다. 그러나 분명한 것은 환경과 분위기에 따라 적절한 처세를 하는 유형이며, 성질이 나기 전에는 사람이 좋고, 자기 손해도 불사하면서 후한 인심을 베풀지만 한번 성질이 나면 위아래나 예의 따위는 무시하고 행동하는 사람입니다. 
반면, 얄팍한 잔꾀는 부리지 못하며 도리어 남의 외에 속는 수가 있으며, 실속보다는 체면, 가정 보다 사회에 비중을 두어 아내의 입장에서는 불만스럽고 짜증이 나도 그런 남편이 밉거나 권태롭지는 않을 것입니다. 이 남성은 자기 잘못이 있으면 슬기롭게 시인하고 쩔쩔매는 약한 면이 있으며, 바로 이 점이 이 남성의 인간미라고 할 수 있습니다. 

반면, 이 여성은 활발하고 외향적이면서 인정이 많습니다. 또 좋고 싫은 것이 분명해서, 누구든 한 번 좋아하면 가식 없이 따르고, 한 번 미워하면 노골적으로 싫은 것을 나타냅니다. 그리고 마음이 약해서 남의 어려운 청을 거절하지 못하며, 미혼시절에 별로 좋아하지 않는 남성에게 차마 냉정하게 대하지 못하는 약점 때문에 당하지 않아도 될 곤욕을 당하거나, 심지어는 끈질긴 구애를 거절하지 못해 결혼까지 하게 될 수도 있습니다. 따라서 이 점에 주의해야 평생 동안 후회가 없을 것입니다. 
반면 결혼해서는 생활력이 강하여 남편 일을 잘 거들고 맞벌이도 주저하지 않습니다. 이 여성을 배우자로 맞이했거나 하려는 남성은 상대의 자존심을 상하게 하는 말을 해서는 안되며, 진심어린 애정의 표시를 하십시오. 그것이 전달된다면 아내는 남편을 위해 어떤 일도 불사할 수 있는 아름다운 성격의 소유자입니다.",
"두 남녀의 관계는 연애 정도의 사귐이라면 무방하나 부부가 되는 것은 바람직하다고 보기 어렵습니다. 왜냐하면 두 사람 관계는 양과 양이 만났으며, 여성이 남성을 극하는 상극관계 이기 때문입니다. 이런 오행의 이치로 인해 이 남성에게 이 여성은 가장 벅차고 다루기 힘든 상대이며, 상대적으로 이 여성이 가장 만만히 보이는 남성이 바로 이 남성입니다. 물론 남성과 여성의 인격적인 수준에 따라 반대가 될 수도 있으나 대체로 위와 같은 경향이 있습니다. 
때문에 또한 두 사람의 나이 차이가 많으면 부부가 되어도 무방합니다. 남성은 연상의 아내, 여성은 연하의 남편과 결혼한다면 남성이 아내를 의지하고 아내의 리드대로 살아가는 이런 형태가 원하는 삶이 될 수도 있습니다. 

구체적으로 이 남성은 급할 때는 불같이 급하고 느릴 때는 한없이 느긋하여 급한 사람인지 느린 사람인지 분간하기 어려운 사람입니다. 
그러나 분명한 것은 환경과 분위기에 따라 적절한 처세를 하는 유형이며, 성질이 나기 전에는 사람이 좋고, 자기 손해도 불사하면서 후한 인심을 베풀지만 한번 성질이 나면 위 아래나 예의 따위는 무시하고 행동하는 사람입니다. 
반면, 얄팍한 잔꾀는 부리지 못하며 도리어 남의 피에 속는 수가 있으며, 실속보다는 체면, 가정 보다 사회에 비중을 두어 아내의 입장에서는 불만스럽고 짜증이 나도 그런 남편이 밉거나 권태롭지는 않을 것입니다. 이 남성은 자기 잘못이 있으면 슬기롭게 시인하고 쩔쩔매는 약한 면이 있으며, 바로 이 점이 이 남성의 인간미라고 할 수 있습니다. 

반면, 이 여성은 똑똑하고 대담하며 노련한 여장부격인 사람으로, 부드럽고 애교스럽거나 야한 맛을 풍기지는 않으나 세련되고 침착하며, 개성이 강해서 분위기에 잘 말려들지 않고 남의 꼬임에도 넘어가지 않습니다. 그래서 남성이 유혹하기에 가장 힘들고 다루기 어려운 타입의 여성형입니다. 
그러나 좋아하는 사람에게는 깊은 애정을 쏟으며, 설사 금전적으로 손해를 보더라도 애정을 쏟기도 합니다. 이처럼 애정면에서 적극적이어서 누가 먼저 프로포즈하건 사귐이 빠르게 진행되며, 시일 을 기다리면서 이것저것 재지 않고 즉흥적인 판단을 내립니다. 
반면 좋아하는 남성상은 강한 남성미 보다는, 곱고 단아하면서도 유약해 보이는 남성을 좋아하며, 정조 그 자체를 대단하게 여기지는 않으나 고고하고 도도한 성격 탓에 함부로 몸을 허락하는 행동을 하지는 않습니다. 남편은 사회적, 경제적으로 상당한 위치에 있는 남성이라야 이 여성을 이끌 수 있으며 아니면 차라리 여성이 주도권을 쥐고 남편이 아내의 의견에 따라가는 부부관계가 형성되어야 집안이 평안할 것입니다. ",
"두 사람의 음양의 조화는 잘 이루었으나 여성이 흙이요, 남성이 물이어서 상극궁합입니다. 
그러나 남성이 허황되고 낭비벽이 심해 실속 없는 사람이라면 바로 이 여성과 같은 사람을 만나야 살림이 잘 될 것입니다. 왜냐하면 이 여성의 간간하고 야무진 성격이 남편의 이런 점을 용납하지 않으므로 남편은 아내에게 심한 견제를 당해 허황된 짓이나 낭비를 하지 못하게 되기 때문입니다. 
경제적인 측면에서 보면 여성은 남성에게 도움을 주는 아내가 되겠으나 애정면은 비교적 냉담할 것입니다. 결론적으로 매사에 야무지지 못하고 허술한 남성 그리고 낭비벽이 심한 남성이라면 이 여성을 택하여 결혼하는 게 좋습니다. 

구체적으로 이 납성은 급할 때는 불같이 급하고 느릴 때는 한없이 느긋하여 급한 사람인지 느린 사람인지 분간하기 어려운 사람입니다. 그러나 분명한 것은 환경과 분위기에 따라 적절한 처세를 하는 유형이며, 성질이 나기 전에는 사람이 좋고, 자기 손해도 불사하면서 후한 인심을 베풀지만 한번 성질이 나면 위아래나 예의 따위는 무시하고 행동하는 사람입니다. 
반면, 얄팍한 잔꾀는 부리지 못하며 도리어 남의 꾀에 속는 수가 있으며, 실속보다는 체면, 가정 보다 사회에 비중을 두어 아내의 입장에서는 불만스럽고 짜증이 나도 그런 남편이 밉거나 권태롭지는 않을 것입니다. 이 남성은 자기 잘못이 있으면 슬기롭게 시인하고 쩔쩔매는 약한 면이 있으며, 바로 이 점이 이 남성의 인간미라고 할 수 있습니다. 

반면, 이 여성은 총명하고 약고 깜짝하며, 다소 신경질적이나 재치가 번득이는 사람입니다. 또한 보수적인 면이 있으면서도, 현대적인 것도 취하고, 가정적이어서 알뜰하고 절약성이 강한 주부상으로 조금도 흠이 없습니다. 단, 남편에게 정도 이상으로 간섭하는 경향이 있으나, 명분상 남편의 위신을 세워 주며, 타인이 그것을 느낄 수 있도록 정성을 기울입니다. 
그리고 사람을 대할 때 앞에서는 그를 추켜 주고 비위를 맞추나 진심이 아닌 경우가 많습니다. 즉, 자신에게 유리한 사람에게는 자세도 낮추고 겸손하여 상대의 호감을 사려고 노력하지만 그렇지 않으면 사귀지 않습니다. 이러한 이해타산은 생활을 하면서도 나타나 궁해도 궁한 체하지 않고 과시하기를 좋아하며, 명예나 이익 관리에 지혜로울 정도로 처신합니다. 
따라서 이 여성을 아내로 맞이한다면, 아내의 재치와 순발력, 총명한 두뇌를 잘 수용하고 결점을 잘 타일러 간다면 최상의 반려자가 될 것입니다.",
"두 사람의 운명적 작용은 나쁘지 않지만 각자 살아가는 방법이 달라서 이를 조화시키는데 어려움이 있겠습니다. 
남녀 모두 양이며, 오행 관계는 금과 물로서 상생관계를 이루었습니다. 그러나 남성은 분위기나 흐름에 휩싸여 환락을 추구하려는 경향이 있으나 아내는 안전과 명분, 실익을 추구하는 성격이어서 각기 생활철학이 달라 자주 대립하게 될 것입니다. 그러나 아내의 결점과 남편의 결점을 서로 견제하면서 보충해 나가면 극단적인 불행에 까지 이르는 궁합은 아니므로 구태여 이런 만남을 피할 것까지는 없습니다. 또한 아내는 남편의 위신을 세워 주고, 남편은 아내의 충고나 견제를 즐겁게 받아들이면 훌륭한 가정이 될 것 입니다. 

구체적으로 이 남성은 급할 때는 불같이 급하고 느릴 때는 한없이 느긋하여 급한 사람인지 느린 사람인지 분간하기 어려운 사람입니다. 그러나 분명한 것은 환경과 분위기에 따라 적절한 처세를 하는 유형이며, 성질이 나기 전에는 사람이 좋고, 자기 손해도 불사하면서 후한 인심을 베풀지만 한번 성질이 나면 위아래나 예의 따위는 무시하고 행동하는 사람입니다. 
반면, 얄팍한 잔꾀는 부리지 못하며 도리어 남의 꾀에 속는 수가 있으며 , 실속보다는 체면, 가정 보다 사회에 비중을 두어 아내의 입장에서는 불만스럽고 짜증이 나도 그런 남편이 밉거나 권태롭지는 않을 것입니다. 이 남성은 자기 잘못이 있으면 슬기롭게 시인하고 쩔쩔매는 약한 면이 있으며, 바로 이 점이 이 남성의 인간미라고 할 수 있습니다. 

반면, 이 여성은 성격이 강하고 솔직하며, 개성이 있고 생활력이 강합니다. 
특히 분위기에 흔들리지 않고 감언이설에 잘 넘어가지 않으며, 명분을 좋아해서 명분 없는 일은 설사 유혹에 이끌릴지라도 절대 행하지 않습니다. 그리고 개방적이며 이상보다 현실에 충실하고 시대의 흐름에 민감합니다. 
반면 바람기가 있는 것 같으면서도 방종하지 않고, 사치와 허영에 빠지지 않으며, 자기 관리에 철저하여 감정에 치우쳐 과오를 범하지 않으며, 정조관념도 강합니다. 결혼해서는 혹 남편이 잘못하면 그것을 눈감아 주지 않고 트집잡고, 바가지도 잘 긁어대며, 남편의 바람기를 용납하지 않습니다. 
따라서 웬만한 남성은 이 여성에게 쩔쩔매게 되고, 남편을 공처가로 만들기 쉽습니다. 그러나 이해심은 남성 못지않아서 금세 풀어지며, 가정을 위해 최대한의 노력을 아끼지 않는 믿음직스러운 아내의 상입니다.",
"매우 좋은 궁합입니다. 
남녀 음양의 배합이 잘 이루어진데다 금과 물이 만나 상생을 이루었으니 정배합이나 다름없는 길격 궁합입니다. 뿐만 아니라 두 사람은 처음 만나는 순간부터 오래 사귀었던 사람처럼 친근감이 들고 좋아 하게 될 것입니다. 
특히 남성이 여성을 더 좋아하게 되며, 서로 장단점을 알게 되어도 단점은 소화시켜 버립니다. 그리고 결혼 후에도 남편과 아내로서 서로 결점을 일깨워 주면서 일생 동안 큰 충돌 없이 다정하게 살아갈 것이므로 다소의 조건은 나쁘더라도 구애 받지 말고 결합해도 좋겠습니다. 

구체적으로 이 남성은 급할 때는 불같이 급하고 느릴 때는 한없이 느긋하여 급한 사람인지 느린 사람인지 분간하기 어려운 사람입니다. 그러나 분명한 것은 환경과 분위기에 따라 적절한 처세를 하는 유형이며, 성질이 나기 전에는 사람이 좋고, 자기 손해도 불사하면서 후란 인심을 베풀지만 한번 성질이 나면 위아래나 예의 따위는 무시하고 행동하는 사람입니다. 
반면, 얄팍한 잔꾀는 부리지 못하며 도리어 남의 꾀에 속는 수가 있으며, 실속보다는 체면, 가정 보다 사회에 비중을 두어 아내의 입장에서는 불만스럽고 짜증이 나도 그런 남편이 밉거나 권태롭지는 않을 것입니다. 이 남성은 자기 잘못이 있으면 슬기롭게 시인하고 쩔쩔매는 약한 면이 있으며, 바로 이 점이 이 남성의 인간미라고 할 수 있습니다. 

반면, 이 여성은 약고 재치가 있으며 친절하면서도 남성 못지않은 이해심과 아량으로 때로는 좋은 일을 위해서 다소의 손해도 불사합니다. 그리고 특별한 용모를 갖추지 않았더라도 사람을 끄는 매력이 있어 아무리 수수한 차림새라도 야해 보이고 바람기가 있어 보이며, 부담감이 없게 느껴지는 여성이어서 남성들의 유혹을 많이 받게 됩니다. 
가정을 아름답게 꾸미는 데 취미와 소질이 있고, 평범한 삶보다 이상적인 생황환경, 삶의 멋을 추구하는 타입이어서 세상의 이목이나 경제적 구애가 없다고 가정할 때 이 여성은 멋진 연애를 하고 싶고, 결혼 후에도 가장 호화롭고 사치스러운 삶을 영위하고자 할 것입니다. 그리고 서비스가 만점이라서 남편한테 베푸는 애정과 서비스는 그 누구도 따라오지 못합니다. 
좋아하는 남성상은 의젓하고 개성 있고 주관이 뚜렷한 남성을 좋아하며, 자신이 남성을 지배하기를 원하지 않으며, 남편으로 섬기고 싶어합니다. 그렇지 않으면 소위 제비족인 남성에게 유혹당할 우려가 있습니다.",
"남녀가 똑같은 양과 물이 만난 격입니다. 
두 사람은 성격상의 공통점이 있어 연애관계라면 서로 단념하기 힘든 애정이 이루어질 것이며, 기분이 맞을 때는 어떤 곳이라도 같이 가고 싶은 마음이 들것입니다. 
그러나 부부관계란 기분만 맞는다고 해서 좋은 궁합이라고 할 수 없습니다. 두 사람의 관계는 왠지 서로가 상대를 깔보게 될 염려가 있으며, 뿐만 아니라 한번 불화가 생기면 양보심이 없이 끝장을 보려 할 것입니다. 그러나 운명적으로 불행은 없는 궁합이므로 여성이 모성애로 남편을 이끌면 남편은 진정어린 아내의 애정에 약해져서 순수히 따르겠습니다. 

구체적으로 이 남성은 급할 때는 불같이 급하고 느릴 때는 한없이 느긋하여 급한 사람인지 느린 사람인지 분간하기 어려운 사람입니다. 그러나 분명한 것은 환경과 분위기에 따라 적절한 처세를 하는 유형이며, 성질이 나기 전에는 사람이 좋고, 자기 손해도 불사하면서 후한 인심을 베풀지만 한번 성질이 나면 위아래나 예의 따위는 무시하고 행동하는 사람입니다.
반면, 얄팍한 잔꾀는 부리지 못하며 도리어 남의 꾀에 속는 수가 있으며, 실속보다는 체면, 가정 보다 사회에 비중을 두어 아내의 입장에서는 불만스럽고 짜증이 나도 그런 남편이 밉거나 권태롭지는 않을 것입니다. 이 남성은 자기 잘못이 있으면 슬기롭게 시인하고 쩔쩔매는 약한 면이 있으며, 바로 이 점이 이 남성의 인간미라고 할 수 있습니다. 

반면, 이 여성은 명랑하고 활발하며 부끄러움을 타지 않고 시원스럽습니다. 또한 성깔도 있고 억센 듯하지만 여성이 갖추어야 할 애교와 매력도 있습니다. 즉, 여성이면서도 배짱이 있고 폭 넓은 아량과 남을 위해 봉사하고 이해하는데 인색하지 않으며, 웬만한 일은 스스로 해결하며 무슨 일에나 태도가 분명합니다. 혹 낭만적인 면이 있어 기분에 따라서 씀씀이가 크지만 계획 없는 낭비는 하지 않으며 써야 할 일이면 손이 크다는 평을 들을 만큼 멋지게 쓰는 타입입니다. 
만일 이 여성에게 경제력만 허용된다면 평소에 꿈꾸던 이상을 실현하여 낙원 같은 가정을 만들어 놓을 것입니다 단, 남편을 이끌려 하고 시시한 남성은 깔보는 경향이 있으나, 일단 결혼한 뒤에는 그 남편의 인격 여하를 막론하고 아내로서의 본분을 다할 것입니다. 그리고 명분을 존중하여 도리에 어긋나는 행동은 절대로 하지 않는 부인상입니다. ",
"남녀의 음양이 바르게 조화되었고 물과 물의 만남이라 길격궁합 입니다. 그러므로 납성은 아내를 이끌고 아내는 또 그것을 좋아할 것입니다. 단, 남편은 아내의 자존심을 상하게 한다거나 딴 곳에 눈을 돌리는 짓 따위는 절대로 해서는 안됩니다. 감정이 예민하고 자존심과 질투심이 유달리 강한 아내이기 때문에 하찮은 일에도 민감하고 충격을 크게 받을 수 있기 때문입니다. 
반면 아내는 남편이 자신을 위하는 진심만 느끼면 온갖 정성을 다 기울여 남편에 대한 봉사를 아끼지 않을 것이므로, 이런 부부관계의 행. 불행의 책임은 남편이 아내에게 어떻게 하느냐에 달려있다고 보겠습니다. 

구체적으로 이 남성은 급할 때는 불같이 급하고 느릴 때는 한없이 느긋하여 급한 사람인지 느린 사람인지 분간하기 어려운 사람입니다. 그러나 분명한 것은 환경과 분위기에 따라 적절한 처세를 하는 유형이며, 성질이 나기 전에는 사람이 좋고, 자기 손해도 불사하면서 후한 인심을 베풀지만 한번 성질이 나면 위아래나 예의 따위는 무시하고 행동하는 사람입니다. 
반면, 얄팍한 잔꾀는 부리지 못하며 도리어 남의 꾀에 속는 수가 있으며, 실속보다는 체면, 가정 보다 사회에 비중을 두어 아내의 입장에서는 불만스럽고 짜증이 나도 그런 남편이 밉거나 권태롭지는 않을 것입니다. 이 남성은 자기 잘못이 있으면 슬기롭게 시인하고 쩔쩔매는 약한 면이 있으며, 바로 이 점이 이 남성의 인간미라고 할 수 있습니다. 

반면, 이 여성은 내성적이고 부끄러움을 잘 타며 얌전해서 한국적인 여성상입니다. 그래서 어른들이 가장 좋아할 만한 며느리감이며, 설사 말괄량이 모습은 보인다고 해도 겉보기만 그럴 뿐 막상 자기가 좋아하는 남 앞에서는 어쩔 수 없이 수줍음을 탑니다. 
애정관은 순정파로 한번 누구를 사랑하면 딴 마음은 두지 않고 진심으로 헌신적인 애정을 베풀며, 혹 남성이 자기를 싫어해도 쉽게 단념하지 않습니다. 때문에 만약 남성으로부터 배신을 당하면 자기가 정을 준 만큼 증오하고 저주하게 됩니다. 따라서 이 여성과 교제중인 남성들은 만약 일시적으로 사귈 예정이라면 아예 상처를 주지 않는 게 좋을 것입니다. 
남성은 이런 여성을 아내로 맞이한다면 복입니다. 희생적인 봉사정신과 순정, 현모양처의 조건을 다 갖춘 사람과 결혼한다면, 부자면 말할 것도 없고 비록 궁해도 아껴만 준다면 불평 없이 알뜰하고 성실하게 살아가는 아내가 될 것이기 때문입니다."),
array("두 사람의 관계는 음과 양, 물과 나무의 만남이어서 음양이 잘 조화되었고 상생궁합이며, 성격의 완급과 강약의 조화를 이루어 좋습니다.
급하고 이기적이면서 얌전하고 단정한 남성과 봉사적이고 노련하고 너그럽고 여유 있는 여성이 부부가 되는 것은 이상적인 관계입니다. 뿐만 아니라 약간 게으르고 소극적이고 의존적인 남편을 부지런하고 적극적이고 활동적인 아내가 리드하여 살림을 잘 꾸려나갈 것입니다. 단, 여유 있는 가정에서는 남편이 아내의 사회 참여를 반대할 것이고, 아내는 남편의 간섭에 불만스러워 할 수 있습니다.

구체적으로 이 남성은 예민하고 재치가 있으며 언행이 단정하고 사람을 대하는 매너가 좋아 자존심이 강해도 자신을 낮추고 남을 높임으로써 상대의 인격을 존중합니다. 불같이 급하면서도 거칠거나 무모한 짓은 하지 않으며, 모든 면에 상식과 재능이 있어서 팔방미인이란 별명을 듣습니다. 그래서인지 이 남성과는 밤을 새우며 이야기해도 싫증이 나지 않습니다. 
그러나 겉보기와 달리 내면은 이기적이고 냉정하며 가정적으로 책임감이 부족하거나 아니면 정반대로 다정다감하여 아내나 자식에게 깊은 애정을 쏟는 상반된 두 가지 인간성을 볼 수 있습니다. 게다가 의심도 많고 보수적이므로 아내의 사회활동을 환영하지 않을 것입니다. 

반면 이 여성은 명랑하고 활발하며 외향적이고 생활력이 매우 강합니다. 그래서 본래 남에게 위축되지 않는 성격으로 부끄럼을 타지 않으며, 이해심이 많으나 반면, 자존심과 자부심이 무척 강하여 결혼해서 설사 남편이 바람을 피우거나 무관심하게 대해도 드러내 놓고 질투를 하거나 투정을 부리지는 않습니다. 아니 겁내지 않는다는 표현이 맞습니다. 즉 '나 혼자도 잘 살 수 있다'는 자신감이 있기 때문입니다. 
그렇다고 가정에서 남편을 무시하거나 하지 않으며, 단 애정의 포로가 되어 울고불고하지 않으며, 바람을 피우지도 않습니다. 또한 검소하게 살면서 한푼 두푼 저축하는 사람이므로 의존적이고 낭비벽이 있거나 결단력이 부족한 남성의 아내로 좋습니다.",
"두 사람의 오행이 물과 나무로서 상생궁합입니다. 
양과 양의 대립은 급하나 쉽게 풀어지고, 음과 음의 대립은 원만하나 찬바람이 일고 오래 갈 수 있습니다. 그러나 두 사람의 결합은 비교적 큰소리가 밖으로 새어 나오지 않는 부부생황이 될 것입니다. 
여성으로서 조건은 다 갖춘 이 여성에게 남편은 큰소리칠 일이 없을 것이며, 성실하고 상냥한 아내가 가정의 분위기를 잘 살려 단란하고 평화로운 가정이 될 것입니다. 단, 남성이 불같이 급하고 참을성이 없으므로 좀 느긋한 아내가 답답하게 생각될 지도 모르나, 이것은 남편의 단점이므로 아내를 나무라서는 안되며, 이 점에 유의하여 아내의 자존심을 상하지 않게 해야 합니다. 

구체적으로 이 남성은 예민하고 재치가 있으며 언행이 단정하고 사람을 대하는 매너가 좋아 자존심이 강해도 자신을 낮추고 남을 높임으로써 상대의 인격을 존중합니다. 
불같이 급하면서도 거칠거나 무모한 짓은 하지 않으며, 모든 면에 상식과 재능이 있어서 팔방미인이란 별명을 듣습니다. 그래서인지 이 남성과는 밤을 새우며 이야기해도 싫증이 나지 않습니다. 그러나 겉보기와 달리 내면은 이기적이고 냉정하며 가정적으로 책임감이 부족하거나 아니면 정반대로 다정다감하여 아내나 자식에게 깊은 애정을 쏟는 상반된 두 가지 인간성을 볼 수 있습니다. 게다가 의심도 많고 보수적이므로 아내의 사회활동을 환영하지 않을 것입니다. 

반면, 이 여성은 현모양처의 표상으로, 누구라도 이 여성을 아내로 맞이한다면 행복한 남성이라 해도 지나친 말이 아닐 것입니다. 
활발하고 명랑하면서도 버릇없거나 거칠지 않고, 얌전하면서도 꽁하거나 고집스러운 타입이 아닙니다. 오히려 너무 여성적이고 평범하기에 개성이 없는 것 같으나 그 자체가 바로 이 여성의 장점이며, 튀는 매력은 없어도 싫증이 나지 않는 사람입니다. 또한 살림살이를 운영함에 있어서, 쓸 때는 쓰면서도, 아낄 때는 아끼고, 즉, 낭비를 하거나 인색하지도 않으며, 가정 주부로서의 사명을 다합니다. 결코 분위기에 휩싸여 시간을 망각하는 일도 없으며, 배우자가 커다란 실수를 하여도, 자신의 잘못을 솔직하게 시인하고 용서를 빈다면 스스럼없이 용서해 줄 그런 여인입니다. 
결론적으로 이 여성은 아내로서 엄마로서의 도리를 다할 수 있는 바탕이 되어있는 이상적인 주부라고 하겠습니다.",
"남녀의 성격을 고려하지 않는다면 정배합이 되어 가장 좋은 결합이며, 궁합상으로는 매우 좋습니다. 
단, 각자 별난 성격을 지녔을 가능성이 있으므로, 한쪽에 잘못이 있어서가 아니라 서로 조금만 언짢은 말만 들어도 참지 못하고 감정을 표현하기 때문에 걸핏하면 충돌이 생길지도 모릅니다. 그러나 묘한 것은 여성이 이 남성에게는 결국 한풀 꺾이게 되는데, 그것은 아내라는 본분 때문에 참기 보다 심리적으로 이길 수 없는 즉, 깔볼 수 없는 그 무엇인가가 작용하기 때문이며, 이것이 바로 오행의 원리입니다. 어쨌든 두 사람은 좋은 결합이므로 서로 양보하고 이해하는 아량을 베풀면 좋은 부부관계가 될 것입니다. 

구체적으로 이 남성은 예민하고 재치가 있으며 언행이 단정하고 사람을 대하는 매너가 좋아 자존심이 강해도 자신을 낮추고 남을 높임으로써 상대의 인격을 존중합니다. 
불같이 급하면서도 거칠거나 무모한 짓은 하지 않으며, 모든 면에 상식과 재능이 있어서 팔방미인이란 별명을 듣습니다. 그래서인지 이 남성과는 밤을 새우며 이야기해도 싫증이 나지 않습니다. 그러나 겉보기와 달리 내면은 이기적이고 냉정하며 가정적으로 책임감이 부족하거나 아니면 정반대로 다정다감하여 아내나 자식에게 깊은 애정을 쏟는 상반된 두 가지 인간성을 볼 수 있습니다. 게다가 의심도 많고 보수적이므로 아내의 사회활동을 환영하지 않을 것입니다. 

반면, 이 여성의 외형은 세련미가 있으나, 다소 건방져 보이기도 하고 신경질적이며 까다롭게 보이지만, 내면은 겁이 많고 연약하며 순진한 면이 있습니다. 따라서 일단 연애를 하거나 아내로 맞이하면 하루가 다르게 새로운 매력에 이끌리게 될 것입니다. 
솔직하고 명랑하며, 애교로서 남편의 마음을 사로잡을 것이며, 살림을 알뜰하게 꾸려 나가고 남편의 사업이나 출세에 적극적인 협력자가 되어 줄 것 입니다. 또한 이 여성은 마음에 드는 남성이 발견되면 먼저 용감하게 사랑을 고백하는 대담성도 있으나, 우물쭈물 시간만 끄는 남성은 흥미가 없어 합니다. 즉, 남성이 적극적으로 과감하게 프로포즈해 주기를 바라는 한편, 로맨틱한 감상은 좋아하지 않는 형으로 달콤한 애정 표현이나 유혹 따위에는 넘어가질 않습니다. 그리고 연애와 결혼은 다르다는 생각을 갖고 있으므로, 연애 상대자로서의 남성은 잘 생기고, 세련된 남성을 선택하나, 결혼 상대자는 경제력이 있거나 사회적으로 어느 정도 위치에 있어야만 마음이 움직이게 됩니다. 그러나 화목한 가정을 가꾸려면 경제력 보다는 원만한 성격의 남성을 만나야 합니다. 
결론적으로 이 여성은 평생을 함께 살아도 싫증이 나지 않을 만큼 귀여운 아내감 입니다.",
"남녀가 모두 음에 속하고 남성이 여성을 극하는 오행관계인 편배합이며, 성격 차가 심해 찬성할 만한 결합이 못됩니다. 
보수적이고 깐깐하고 사무적이며 이기적이기 쉬운 남편에게 자유분방하고 예의와 격식에 구애 받기 싫어하는 아내는 남편의 주문을 수용하기가 어려울 것입니다. 혹 남성이 세심하고 다정다감하여 아내의 가려운 부분까지 알아서 관심 어린 애정을 베푸는 사람이라면 무한히 행복할 것입니다. 그러나 그렇지 못하면 성격상의 차이 때문에 원만한 부부 생활을 영위하기가 어려울 것입니다. 

구체적으로 이 남성은 예민하고 재치가 있으며 언행이 단정하고 사람을 대하는 매너가 좋아 자존심이 강해도 자신을 낮추고 남을 높임으로써 상대의 인격을 존중합니다. 
불같이 급하면서도 거칠거나 무모한 짓은 하지 않으며, 모든 면에 상식과 재능이 있어서 팔방미인이란 별명을 듣습니다. 그래서인지 이 남성과는 밤을 새우며 이야기해도 싫증이 나지 않습니다. 그러나 겉보기와 달리 내면은 이기적이고 냉정하며 가정적으로 책임감이 부족하거나 아니면 정반대로 다정다감하여 아내나 자식에게 깊은 애정을 쏟는 상반된 두 가지 인간성을 볼 수 있습니다. 게다가 의심도 많고 보수적이므로 아내의 사회활동을 환영하지 않을 것입니다. 

반면, 이 여성은 활발하고 외향적이면서 인정이 많습니다. 또 좋고 싫은 것이 분명해서 누구든 한 번 좋아하면 가식 없이 따르고, 한 번 미워하면 노골적으로 싫은 것을 나타냅니다. 그리고 마음이 약해서 남의 어려운 청을 거절하지 못하며, 미혼시절에 별로 좋아하지 않는 남성에게 차마 냉정하게 대하지 못하는 약점 때문에 당하지 않아도 될 곤욕을 당하거나, 심지어는 끈질긴 구애를 거절하지 못해 결혼까지 하게 될 수도 있습니다. 따라서 이 점에 주의해야 평생 동안 후회가 없을 것입니다. 
반면 결혼해서는 생활력이 강하여 남편 일을 잘 거들고 맞벌이도 주저하지 않습니다. 이 여성을 배우자로 맞이했거나 하려는 남성은 상대의 자존심을 상하게 하는 말을 해서는 안되며, 진심어린 애정의 표시를 하십시오. 그것이 전달된다면 아내는 남편을 위해 어떤 일도 불사할 수 있는 아름다운 성격의 소유자입니다.",
"음양이 조화를 이룬 가운데 여성이 남성을 극하는 상극궁합입니다. 이를 반배합이라 하며, 상극관계이면서도 서로 좋아하는 형상입니다. 
남성은 아내가 어머니처럼 든든하고, 여성은 남편에게 모성애와 같은 애정을 느낍니다. 또한 아내는 남편의 일거일동이 싫지가 않고 남편은 아내의 억센 듯한 노련함이 믿음직스럽기만 할 것입니다. 또한 만약 연상의 아내, 연하의 남편이 부부로서 맺어진다면 더욱 다정한 부부가 될 것입니다. 

구체적으로 이 남성은 예민하고 재치가 있으며 언행이 단정하고 사람을 대하는 매너가 좋아 자존심이 강해도 자신을 낮추고 남을 높임으로써 상대의 인격을 존중합니다. 
불같이 급하면서도 거칠거나 무모한 짓은 하지 않으며, 모든 면에 상식과 재능이 있어서 팔방미인이란 별명을 듣습니다. 그래서인지 이 남성과는 밤을 새우며 이야기해도 싫증이 나지 않습니다. 그러나 겉보기와 달리 내면은 이기적이고 냉정하며 가정적으로 책임감이 부족하거나 아니면 정반대로 다정다감하여 아내나 자식에게 깊은 애정을 쏟는 상반된 두 가지 인간성을 볼 수 있습니다. 게다가 의심도 많고 보수적이므로 아내의 사회활동을 환영하지 않을 것입니다. 

반면, 이 여성은 똑똑하고 대담하며 노련한 여장부격인 사람으로, 부드럽고 애교스럽거나 야한 맛은 풍기지는 않으나 세련되고 침착하며, 개성이 강해서 분위기에 잘 말려들지 않고 남의 꼬임에도 넘어가지 않습니다. 그래서 남성이 유혹하기에 가장 힘들고 다루기 어려운 타입의 여성형입니다. 그러나 좋아하는 사람에게는 깊은 애정을 쏟으며, 설사 금전적으로 손해를 보더라도 애정을 쏟기도 합니다. 이처럼 애정면에서 적극적이어서 누가 먼저 프로포즈하건 사귐이 빠르게 진행되며, 시일 을 기다리면서 이것저것 재지 않고 즉흥적인 판단을 내립니다. 
반면, 좋아하는 남성상은 강한 남성미 보다는, 곱고 단아하면서도 유약해 보이는 남성을 좋아하며, 정조 그 자체를 대단하게 여기지는 않으나 고고하고 도도한 성격 탓에 함부로 몸을 허락하는 행동을 하지는 않습니다. 
남편은 사회적, 경제적으로 상당한 위치에 있는 남성이라야 이 여성을 이끌 수 있으며 아니면 차라리 여성이 주도권을 쥐고 남편이 아내의 의견에 따라가는 부부관계가 형성되어야 집안이 평안할 것입니다.",
"남성과 여성이 모두 음이며, 물과 흙의 만남으로 여성이 남성을 극하는 상입니다. 즉 같은 양끼리, 음끼리의 극은 매우 꺼리게 되는 것이고, 설사 서로 좋아하게 될지라도 음양오행이 모두 대립 관계이므로 불리한 배합입니다.
따라서 서로 의존하려 하고 책임을 미루며 압박감을 느끼게 되므로, 중도에 헤어지기 쉽고, 그렇지 않으면 냉각된 분위기의 가정이 되기 입습니다.  

구체적으로 이 남성은 예민하고 재치가 있으며 언행이 단정하고 사람을 대하는 매너가 좋아 자존심이 강해도 자신을 낮추고 남을 높임으로써 상대의 인격을 존중합니다. 
불같이 급하면서도 거칠거나 무모한 짓은 하지 않으며, 모든 면에 상식과 재능이 있어서 팔방미인이란 별명을 듣습니다. 그래서인지 이 남성과는 밤을 새우며 이야기해도 싫증이 나지 않습니다. 그러나 겉보기와 달리 내면은 이기적이고 냉정하며 가정적으로 책임감이 부족하거나 아니면 정반대로 다정다감하여 아내나 자식에게 깊은 애정을 쏟는 상반된 두 가지 인간성을 볼 수 있습니다. 게다가 의심도 많고 보수적이므로 아내의 사회활동을 환영하지 않을 것입니다.  

반면, 이 여성은 총명하고 약고 깜찍하며, 다소 신경질적이나 재치가 번득이는 사람입니다. 또한 보수적인 면이 있으면서도, 현대적인 것도 취하고, 가정적이어서 알뜰하고 절약성이 강한 주부상으로 조금도 흠이 없습니다. 단, 남편에게 정도 이상으로 간섭하는 경향이 있으나, 명분상 남편의 위신을 세워 주며, 타인이 그것을 느낄 수 있도록 정성을 기울입니다. 
그리고 사람을 대할 때 앞에서는 그를 추켜 주고 비위를 맞추나 진심이 아닌 경우가 많습니다. 즉, 자신에게 유리한 사람에게는 자세도 낮추고 겸손하여 상대의 호감을 사려고 노력하지만 그렇지 않으면 사귀지 않습니다. 이러한 이해타산은 생활을 하면서도 나타나 궁해도 궁한 체하지 않고 과시하기를 좋아하며, 명예나 이익 관리에 지혜로울 정도로 처신합니다. 
따라서 이 여성을 아내로 맞이한다면, 아내의 재치와 순발력, 총명한 두뇌를 잘 수용하고 결점을 잘 타일러 간다면 최상의 반려자가 될 것입니다.",
"남성이 음이고 여성이 양이어서 바림직한 결합을 이루었으며, 금과 물이 만났으니 아내가 남편을 생해 주는 오행관계를 이루어 길격궁합입니다. 
또한 남편이 소극적이고 보수적이며 나태한 면이 있더라도 이 여성은 능히 남편을 이끌어 나갈 수 있습니다. 그리고 부지런하고 적극적인 아내의 등쌀에 못 이겨 남성은 아내와 호흡을 맞추게 됩니다. 다만 서로가 질투심이 강한 부부이므로, 오해 받을 만한 일만 삼가면 무난하겠습니다. 

구체적으로 이 남성은 예민하고 재치가 있으며 언행이 단정하고 사람을 대하는 매너가 좋아 자존심이 강해도 자신을 낮추고 남을 늘임으로써 상대의 인격을 존중합니다. 
불같이 급하면서도 거칠거나 무모한 짓은 하지 않으며, 모든 면에 상식과 재능이 있어서 팔방미인이란 별명을 듣습니다. 그래서인지 이 남성과는 밤을 새우며 이야기해도 싫증이 나지 않습니다. 그러나 겉보기와 달리 내면은 이기적이고 냉정하며 가정적으로 책임감이 부족하거나 아니면 정반대로 다정다감하여 아내나 자식에게 깊은 애정을 쏟는 상반된 두 가지 인간성을 볼 수 있습니다. 게다가 의심도 많고 보수적이므로 아내의 사회활동을 환영하지 않을 것입니다. 

반면, 이 여성은 성격이 강하고 솔직하며, 개성이 있고 생활력이 강합니다. 특히 분위기에 흔들리지 않고 감언이설에 잘 넘어가지 않으며, 명분을 좋아 해서 명분 없는 일은 설사 유혹에 이끌릴지라도 절대 행하지 않습니다. 그리고 개방적이며 이상보다 현실에 충실하고 시대의 흐름에 민감합니다. 
반면 바람기가 있는 것 같으면서도 방종하지 않고, 사치와 허영에 빠지지 않으며, 자기 관리에 철저하여 감정에 치우쳐 과오를 범하지 않으며, 정조관념도 강합니다. 결혼해서는 혹 남편이 잘못하면 그것을 눈감아 주지 않고 트집잡고, 바가지도 잘 긁어대며, 남편의 바람기를 용납하지 않습니다. 
따라서 웬만한 남성은 이 여성에게 쩔쩔매게 되고, 남편을 공처가로 만들기 쉽습니다. 그러나 이해심은 남성 못지않아서 금세 풀어지며, 가정을 위해 최대한의 노력을 아끼지 않을 믿음직스러운 아내의 상입니다.",
"남성과 여성이 음 대 음이요, 금과 물로 상생을 이루었으므로 음양은 조화를 이루지 못했지만, 오행은 좋습니다. 그러나 나쁜 궁합은 아니더라도 이 부부가 일생을 같이 하는데 있어 문제가 되는 것은 두 사람 모두 의처증과 의부증이 있을 수 있습니다. 이것은 바람기 있는 남녀가 만나면 서로 그것을 잘 알기 때문에 괜한 것까지 신경을 쓰게 될 가능성이 있으며, 너무 정이 좋아서도 그렇겠지만 두 사람 모두 신경이 예민하기 때문이기도 합니다.
그러나 그러면서도 호흡이 맞을 때는 어느 남녀보다 다정다감하여 남들이 부러워할 만큼 아기자기한 삶을 누리는 예도 많습니다.

구체적으로 이 남성은 예민하고 재치가 있으며 언행이 단정하고 사람을 대하는 매너가 좋아 자존심이 강해도 자신을 낮추고 남을 높임으로써 상대의 인격을 존중합니다. 
불같이 급하면서도 거칠거나 무모한 짓은 하지 않으며, 모든 면에 상식과 재능이 있어서 팔방미인이란 별명을 듣습니다. 그래서인지 이 남성과는 밤을 새우며 이야기해도 싫증이 나지 않습니다. 그러나 겉보기와 달리 내면은 이기적이고 냉정하며 가정적으로 책임감이 부족하거나 아니면 정반대로 다정다감하여 아내나 자식에게 깊은 애정을 쏟는 상반된 두 가지 인간성을 볼 수 있습니다. 게다가 의심도 많고 보수적이므로 아내의 사회활동은 환영하지 않을 것입니다.

반면, 이 여성은 약고 재치가 있으며 친절하면서도 남성 못지않은 이해심과 아량으로 때로는 좋은 일을 위해서 다소의 손해도 불사합니다. 그리고 특별한 용모를 갖추지 않았더라도 사람을 끄는 매력이 있어 아무리 수수한 차림새라도 야해 보이고 바람기가 있어 보이며, 부담감이 없게 느껴지는 여성이어서 남성들의 유혹을 많이 받게 됩니다. 
가정을 아름답게 꾸미는 데 치미와 소질이 있고, 평범한 삶보다 이상적인 생활환경, 삶의 멋을 추구하는 타입이어서 세상의 이목이나 경제적 구애가 없다고 가정할 때 이 여성은 멋진 연애를 하고 싶고, 결혼 후에도 가장 호화롭고 사치스러운 삶을 영위하고자 할 것입니다. 그리고 서비스가 만점이라서 남편한테 베푸는 애정과 서비스는 그 누구도 따라오지 못합니다. 
좋아하는 남성상은 의젓하고 개성 있고 주관이 뚜렷한 남성을 좋아하며, 자신이 남성을 지배하기를 원하지 않으며, 남편으로 섬기고 싶어합니다. 그렇지 않으면 소위 제비족인 남성에게 유혹당할 우려가 있습니다.",
"이 결합은 남편이 아내의 리드에 따라야만 평화로운 가정생활을 영위할 수 있습니다. 
즉 남성은 음이자 물이요, 여성은 양이자 물이어서, 물은 서로 만나면 하나로 합쳐져 흐르게 됩니다. 그런데 적은 물이 큰물을 따라 흐르는 법이지 큰 물이 작은 물을 따라 흐르지는 않는 것처럼 비교적 영리하고 상식이 풍부한 남성이지만 감정과 편견에 치우칠 우려가 있으므로 노련하고 포용력 있는 아내의 의견을 따라야만 서로 거부감이 없는 부부관계가 될 것입니다. 
따라서 남편이 독선적인 생각을 고집한다면 얼마 못 가서 파국에 이를 염려가 있습니다. 

구체적으로 이 남성은 예민하고 재치가 있으며 언행이 단정하고 사람을 대하는 매너가 좋아 자존심이 강해도 자신을 낮추고 남을 높임으로써 상대의 인격을 존중합니다. 
불같이 급하면서도 거칠거나 무모한 짓은 하지 않으며, 모든 면에 상식과 재능이 있어서 팔방미인이란 별명을 듣습니다. 그래서인지 이 남성과는 밤을 새우며 이야기해도 싫증이 나지 않습니다. 
그러나 겉보기와 달리 내면은 이기적이고 냉정하며 가정적으로 책임감이 부족하거나 아니면 정반대로 다정다감하여 아내나 자식에게 깊은 애정을 솎는 상반된 두 가지 인간성을 볼 수 있습니다. 게다가 의심도 많고 보수적이므로 아내의 사회활동을 환영하지 않을 것입니다. 

반면, 이 여성은 명랑하고 활발하며 부끄러움을 타지 않고 시원스럽습니다. 또한 성깔도 있고 억센듯하지만 여성이 갖추어야 할 애교와 매력도 있습니다. 즉, 여성이면서도 배짱이 있고 폭 넓은 아량과 남을 위해 봉사하고 이해하는데 인색하지 않으며, 웬만한 일은 스스로 해결하며 무슨 일에나 태도가 분명합니다. 혹 낭만적인 면이 있어 기분에 따라서 씀씀이가 크지만 계획 없는 낭비는 하지 않으며, 써야 할 일이면 손이 크다는 평을 들을 만큼 멋지게 쓰는 타입입니다. 
만일 이 여성에게 경제력만 허용된다면 평소에 꿈꾸던 이상을 실현하여 낙원 같은 가정을 만들어 놓을 것입니다. 단, 남편을 이끌려 하고 시시한 남성은 깔보는 경향이 있으나, 일단 결혼한 뒤에는 그 남편의 인격 여하를 막론하고 아내로서의 본분을 다할 것입니다. 그리고 명분을 존중하여 도리에 어긋나는 행동은 절대로 하지 않는 부인상입니다.",
"남성과 여성이 모두 음이며, 물이라 성격적으로 매우 잘 맞을 것 같으나 실제로는 그렇지 않습니다. 여성은 본래 음의 본성을 지녔으나 남성은 남성적인 특성을 지녀야 남녀가 화합을 이루게 되는 것입니다. 
따라서 음인 남성은 양인 여성과의 결합을 요하게 됩니다. 그런데 두 사람은 모두 같은 음이므로 이 부부관계는 침울하고 냉랭한 느낌이 들어 좋지 않으며, 만약 두 남녀가 받기만 원하고 솔선해서 베풀려는 마음이 없으면 좋지 않은 관계가 되기 쉽습니다. 

구체적으로 이 남성은 예민하고 재치가 있으며 언행이 단정하고 사람을 대하는 매너가 좋아 자존심이 강해도 자신을 낮추고 남을 높임으로써 상대의 인격을 존중합니다. 
불같이 급하면서도 거칠거나 무모한 짓은 하지 않으며, 모든 면에 상식과 재능이 있어서 팔방미인이란 별명을 듣습니다. 그래서인지 이 남성과는 밤을 새우며 이야기해도 싫증이 나지 않습니다. 그러나 겉보기와 달리 내면은 이기적이고 냉정하며 가정적으로 책임감이 부족하거나 아니면 정반대로 다정다감하여 아내나 자식에게 깊은 애정을 쏟는 상반된 두 가지 인간성을 볼 수 있습니다. 게다가 의심도 많고 보수적이므로 아내의 사회활동을 환영하지 않을 것입니다. 

반면, 이 여성은 내성적이고 부끄러움을 잘 타며 얌전해서 한국적인 여성상입니다. 그래서 어른들이 가장 좋아할 만한 며느리감이며, 설사 말괄량이 모습을 보인다고 해도 겉보기만 그럴 뿐 막상 자기가 좋아하는 남성 앞에서는 어쩔 수 없이 수줍음을 탑니다. 
애정관은 순정파로 한번 누구를 사랑하면 딴마음을 두지 않고 진심으로 헌신적인 애정을 베풀며, 혹 남성이 자기를 싫어해도 입게 단념하지 않습니다. 때문에 만약 남성으로부터 배신을 당하면 자기가 정을 준 만큼 증오하고 저주하게 됩니다. 따라서 이 여성과 교제중인 남성들은 만약 일시적으로 사귈 예정이라면 아예 상처를 주지 않는 게 좋을 것입니다. 
남성은 이런 여성을 아내로 맞이한다면 복입니다. 희생적인 봉사정신과 순정, 현모양처의 조건을 다 갖춘 사람과 결혼한다면, 부자면 말할 것도 없고 비록 궁해도 아껴만 준다면 불평 없이 알뜰하고 성실하게 살아가는 아내가 될 것이기 때문입니다.")

);

$arrGHInJisu = array(
	array("21122","32333","43433","43444","11121","54555","11121","11132","34433","43434"),
	array("32333","21122","43444","43433","21212","11121","54555","11121","43434","34433"),
	array("34433","43434","21122","32333","43433","43444","11121","54555","11121","21212"),
	array("43434","34433","32333","21122","43444","43433","21212","11121","54555","11121"),
	array("11121","21212","34433","43434","21122","32333","43433","43444","11121","54555"),
	array("54555","11121","43434","34433","32333","21122","43444","43433","21212","11121"),
	array("11121","54555","11121","21212","34433","43434","21122","32333","43433","43444"),
	array("21212","11121","54555","11121","43434","34433","32333","21122","43444","43433"),
	array("43433","43444","11121","54555","11121","21212","34433","43434","21122","32333"),
	array("43444","43433","21212","11121","54555","11121","43434","34433","32333","21122")
);

$arrGHGg = array(
	array(60,100,90,50,100,80,60,40,100,50,80,90),
	array(100,60,90,80,50,100,40,60,80,100,50,90),
	array(80,80,60,90,90,40,100,80,60,60,100,90),
	array(50,80,90,60,40,80,50,100,60,60,100,100),
	array(100,50,80,40,60,70,80,80,100,100,60,60),
	array(80,100,40,80,70,60,90,90,90,100,60,60),
	array(60,40,100,50,80,90,60,100,80,80,100,70),
	array(40,60,70,100,70,90,100,60,80,80,50,100),
	array(100,80,60,60,100,50,80,80,60,90,90,40),
	array(50,100,60,60,100,100,80,80,90,60,40,80),
	array(80,50,100,100,60,60,100,50,90,40,60,90),
	array(90,90,90,100,60,60,70,100,40,80,90,60)
);

$arrGHBlood = array(
	array(70,25,90,50),
	array(20,65,80,85),
	array(95,75,40,35),
	array(65,80,30,90)
);

$arrGHBloodText = array(
	array("남자 A형과 여자 A형
두 사람은
목적이 같으므로 잘 꾸려 나갈 수 있는 만남이다. 초기에는 서로에게 도움을 주면서 사이를 좁혀 나가지만 상대에게 본심을 내보이지 않는 스타일이기 때문에 시간이 지날수록 상대가 무엇을 생각하는지 알 수 없어질 수도 있다. 사귀는 기간이 길게 되면 완벽주의자답게 상대의 단점이 눈에 들어와 열정이 식는 경우도 있다. 가능하면 빨리 서로의 진심을 이야기할 수 있도록 하는 것이 좋겠다.
상대 파악하기
A형 남성은 기본적으로 신중한 편이다. 그것은 연애에 있어서도 그렇다. 충동적으로 사랑을 고백하거나 만난지 얼마 되지 않은 여성과 바로 사랑을 나누는 경우는 거의 없다. 맘에 드는 여성이 있으면 시간을 들여 조금씩 거리를 좁혀 나간다. 사랑의 말도 직접적이지 않고 우회적으로 표현하기 때문에 상대 여성이 알아채지 못하는 경우가 있다. 이는 상처 입는 것을 다른 혈액형의 사람에 비해 두 배 이상 두려워하기 때문이다. 고백을 했다가 거절 당하는 것을 두려워하는 편이다. 만약 이런 그와 관계를 진전시키고 싶다면 표시 나지 않도록 그에게 자신감을 심어주어야 한다. 데이트를 한 다음 '오늘 정말 즐거웠어'라고 한마디 해준다. 이렇게 신경을 써주면 그의 경계심이 풀어 질 것이다. 반면 여성이 갑자기 대담한 사랑 고백을 하면 오히려 역효과가 나서 그가 뒷걸음 치는 일도 있을 수 있다. 단, 생일이나 발렌타인데이 등은 잘 이용할 수 있어야 할 것이다. 선물 속에 자신의 기분을 전하는 카드를 써 넣으면 그의 마음에 들 수 있을 것이다. 주변 사람들과의 협조를 중시하는 A형은 인간관계에 대한 스트레스를 안고 있기 쉬우므로 조심스럽게 위로를 할 경우 감격해 할 것이다. A형은 감정을 밖으로 잘 드러내지 않으므로 잘 관찰해서 그의 기분의 변화를 감지하는 것이 중요하다. A형인 남성과 A형인 여성은 서로 비슷하기 때문에 큰 무리 없이 서로를 이해할 수 있으나 단순한 친구 관계로 끝날 수도 있다. A형 남성은 밝고 개성이 강한 여성을 좋아하는 경향이 있다. 그렇지만 신경질적이고 완벽주의자이기 때문에 사소한 일에도 세심히 신경을 쓰는 면이 있다. 그가 비록 개방적인 여성을 좋아한다고는 해도 기본적인 에티켓을 지키지 않는 경우는 좋지 않은 느낌을 줄 수도 있다. 가까운 여성일수록 더 신경을 써야 한다. 그렇다고 해서 그의 표정만 살피고 있을 필요는 없다. 필요한 곳에서 매너를 지켜주고 자기 마음대로 하는 행동은 가급적 삼가 하는 편이 좋다. 또 자존심에 상처를 주는 발언이나 행동도 큰 싸움의 원인이 될 수 있으므로 주의한다. 그는 프라이드가 강하고 완벽을 추구하기 때문에 사람 앞에서 창피를 주거나 사적인 일을 폭로한다면 크게 화를 낼 것이다. 만약 싸움이 벌어졌다면 여성이 먼저 사과를 하는 것이 사태 악화를 방지할 수 있다. 그의 나쁜 점을 지적해서 사과를 받으려고 하면 두 사람의 관계는 회복할 수 없는 관계로 될 수 있으므로 사과할 때는 구체적인 예를 들어 사과하는 것이 보다 효과적이다. A형은 논리적이기 때문에 이런 식으로 사과하면 같이 잘못을 시인하며 금방 수그러진다. A형 남성과 A형 여성은 닮은 꼴이기 때문에 싸우는 일이 적으나 일단 싸우면 둘 다 사과를 하는 경우가 별로 없기 때문에 관계가 악화될 가능성이 높다. 일단 누군가가 먼저 양보를 하는 것이 최선이다. A형의 남성은 예민하기 때문에 상대로부터 자극적이지 않은 편안함을 원한다. 단, 결혼 상대에게 높은 이상을 가지고 있을 뿐 아니라 신중한 타입이므로 이 여자라고 생각을 하고도 좀처럼 청혼하지 못하는 경우가 많다. 그러나 그의 가족에게 인사를 시켰다면 거의 결혼까지 결정했다고 생각해도 좋다. 반대로 여성이 적극적으로 가족을 만나고 싶다는 요구를 해도 좀처럼 받아주지 않는 경우는 문제가 있는 것이다. 그는 좀 빠르다고 판단하고 있다던가 좀 더 교제해 보아야 할 것이라든가 아니면 그녀와 결혼할 마음이 없다고 생각할 가능성이 크다. 그 정도로 A형은 항상 누군가를 위해 또는 무엇인가를 위해 사는 책임감 내지는 사명감을 가지고 있고 특히 가족을 소중히 하는 생각이 다른 사람보다 강하기 때문에 교재 중인 여성을 그의 부모에게 인사 시켰다는 것은 그가 결혼을 구체적으로 생각하기 시작했다고 하는 증거이다. 이런 A형이기 때문에 타인으로부터 자신의 가족에 대해 나쁜 말을 들으면 참지 못하며 사소한 비평에도 민감하기 때문에 주의하도록 한다. 가령 그가 자기 가족을 나쁘게 말하거나 비웃는다 해도 함께 비판 하는 것은 금물이다. 
성공의 노하우
A형 남성과 A형 여성은 둘 다 신중한 편이기 때문에 결혼까지 이르기에는 시간이 많이 소요될 가능성이 높다. 그러므로 서두르지 말고 천천히 때를 기다리는 지혜가 필요하다.",
"남자 A형과 여자 B형
두 사람은
사귀기 시작하면서 잠시 자신에게 없는 부분에 대해 서로 끌리게 되지만 시간이 더해감에 따라 서로간의 의사소통이 잘 이루어지지 않을 가능성이 있다. 기쁘거나 슬프거나 간에 이것을 표면으로 드러내지 않고 표현을 잘 하지 않는 A형 남성의 기분을 B형의 여성이 제대로 파악하지 못하는데 원인이 있다. 그냥 버려두지 말고 계속적으로 그의 속마음을 듣기위한 노력이 필요할 것이다. 
상대 파악하기
A형 남성은 기본적으로 신중한 편이다. 그것은 연애에 있어서도 그렇다. 충동적으로 사랑을 고백하거나 만난지 얼마 되지 않은 여성과 바로 사랑을 나누는 경우는 거의 없다. 맘에 드는 여성이 있으면 시간을 들여 조금씩 거리를 좁혀 나간다. 사랑의 말도 직접적이지 않고 우회적으로 표현하기 때문에 상대 여성이 알아채지 못하는 경우가 있다. 이는 상처 입는 것을 다른 혈액형의 사람에 비해 두 배 이상 두려워하기 때문이다. 고백을 했다가 거절 당하는 것을 두려워하는 편이다. 만약 이런 그와 관계를 진전시키고 싶다면 표시 나지 않도록 그에게 자신감을 심어주어야 한다. 데이트를 한 다음 '오늘 정말 즐거웠어'라고 한마디 해준다. 이렇게 신경을 써주면 그의 경계심이 풀어 질 것이다. 반면 여성이 갑자기 대담한 사랑 고백을 하면 오히려 역효과가 나서 그가 뒷걸음 치는 일도 있을 수 있다. 단, 생일이나 발렌타인데이 등은 잘 이용할 수 있어야 할 것이다. 선물 속에 자신의 기분을 전하는 카드를 써 넣으면 그의 마음에 들 수 있을 것이다. 주변 사람들과의 협조를 중시하는 A형은 인간관계에 대한 스트레스를 안고 있기 쉬우므로 조심스럽게 위로를 할 경우 감격해 할 것이다. A형은 감정을 밖으로 잘 드러내지 않으므로 잘 관찰해서 그의 기분의 변화를 감지하는 것이 중요하다. 이런 만남의 경우 B형 여성의 싹싹한 성격이 A형 남성의 딱딱함을 풀어주게 된다. A형 남성은 밝고 개성이 강한 여성을 좋아하는 경향이 있다. 그렇지만 신경질적이고 완벽주의자이기 때문에 사소한 일에도 세심히 신경을 쓰는 면이 있다. 그가 비록 개방적인 여성을 좋아한다고는 해도 기본적인 에티켓을 지키지 않는 경우는 좋지 않은 느낌을 줄 수도 있다. 가까운 여성일수록 더 신경을 써야 한다. 그렇다고 해서 그의 표정만 살피고 있을 필요는 없다. 필요한 곳에서 매너를 지켜주고 자기 마음대로 하는 행동은 가급적 삼가 하는 편이 좋다. 또 자존심에 상처를 주는 발언이나 행동도 큰 싸움의 원인이 될 수 있으므로 주의한다. 그는 프라이드가 강하고 완벽을 추구하기 때문에 사람 앞에서 창피를 주거나 사적인 일을 폭로한다면 크게 화를 낼 것이다. 만약 싸움이 벌어졌다면 여성이 먼저 사과를 하는 것이 사태 악화를 방지할 수 있다. 그의 나쁜 점을 지적해서 사과를 받으려고 하면 두 사람의 관계는 회복할 수 없는 관계로 될 수 있으므로 사과할 때는 구체적인 예를 들어 사과하는 것이 보다 효과적이다. A형은 논리적이기 때문에 이런 식으로 사과하면 같이 잘못을 시인하며 금방 수그러진다. B형 여성의 천성적으로 자기 중심적인 생각이나 행동이 소심하게 사소한 부분에 얽매이는 A형 남성에게 많이 신경 쓰이는 부분이 된다. 그러므로 B형 여성은 본인의 입장만 표출하지 말고 상대방 입장에서 생각하는 마음을 갖도록 하는 것이 중요하다. A형의 남성은 예민하기 때문에 상대로부터 자극적이지 않은 편안함을 원한다. 단, 결혼 상대에게 높은 이상을 가지고 있을 뿐 아니라 신중한 타입이므로 이 여자라고 생각을 하고도 좀처럼 청혼하지 못하는 경우가 많다. 그러나 그의 가족에게 인사를 시켰다면 거의 결혼까지 결정했다고 생각해도 좋다. 반대로 여성이 적극적으로 가족을 만나고 싶다는 요구를 해도 좀처럼 받아주지 않는 경우는 문제가 있는 것이다. 그는 좀 빠르다고 판단하고 있다던가 좀 더 교제해 보아야 할 것이라든가 아니면 그녀와 결혼할 마음이 없다고 생각할 가능성이 크다. 
성공의 노하우
그 정도로 A형은 항상 누군가를 위해 또는 무엇인가를 위해 사는 책임감 내지는 사명감을 가지고 있고 특히 가족을 소중히 하는 생각이 다른 사람보다 강하기 때문에 교재 중인 여성을 그의 부모에게 인사 시켰다는 것은 그가 결혼을 구체적으로 생각하기 시작했다고 하는 증거이다. 이런 A형이기 때문에 타인으로부터 자신의 가족에 대해 나쁜 말을 들으면 참지 못하며 사소한 비평에도 민감하기 때문에 주의하도록 한다. 가령 그가 자기 가족을 나쁘게 말하거나 비웃는다 해도 함께 비판 하는 것은 금물이다. 기분파적인 B형 여성의 성격때문에 그가 프로포즈를 망설이게 되는 원인이 되기도 한다.",
"남자 A형과 여자 O형
두 사람은
굉장히 신중한 성격의 A형 남성이 가장 쉽게 마음을 허락하게 되는 혈액형이 O형의 여성이다. O형의 편안하고 밝은 성격이 그에게 큰 매력으로 작용하게 된다. 남성쪽에서 여성을 감싸줄 수 있는 관계로 성립된다면 이상적인 연인이나 부부사이가 될 수 있지만, 여성의 너무 현실적인 행동이 어쩌면 타산적으로 보일 가능성이 있으므로 그런 경우에는 대화를 통해 오해를 풀 수 있도록 해야 한다. 그렇게만 해결된다면 항상 좋은 커플로 지낼 수 있다. 
상대 파악하기
A형 남성은 기본적으로 신중한 편이다. 그것은 연애에 있어서도 그렇다. 충동적으로 사랑을 고백하거나 만난지 얼마 되지 않은 여성과 바로 사랑을 나누는 경우는 거의 없다. 맘에 드는 여성이 있으면 시간을 들여 조금씩 거리를 좁혀 나간다. 사랑의 말도 직접적이지 않고 우회적으로 표현하기 때문에 상대 여성이 알아채지 못하는 경우가 있다. 이는 상처 입는 것을 다른 혈액형의 사람에 비해 두 배 이상 두려워하기 때문이다. 고백을 했다가 거절 당하는 것을 두려워하는 편이다. 만약 이런 그와 관계를 진전시키고 싶다면 표시 나지 않도록 그에게 자신감을 심어주어야 한다. 데이트를 한 다음 '오늘 정말 즐거웠어'라고 한마디 해준다. 이렇게 신경을 써주면 그의 경계심이 풀어 질 것이다. 반면 여성이 갑자기 대담한 사랑 고백을 하면 오히려 역효과가 나서 그가 뒷걸음 치는 일도 있을 수 있다. 단, 생일이나 발렌타인데이 등은 잘 이용할 수 있어야 할 것이다. 선물 속에 자신의 기분을 전하는 카드를 써 넣으면 그의 마음에 들 수 있을 것이다. 주변 사람들과의 협조를 중시하는 A형은 인간관계에 대한 스트레스를 안고 있기 쉬우므로 조심스럽게 위로를 할 경우 감격해 할 것이다. A형은 감정을 밖으로 잘 드러내지 않으므로 잘 관찰해서 그의 기분의 변화를 감지하는 것이 중요하다. 목적을 위해서 너무 적극적인 O형 여성의 성격이 조심스러운 A형에게는 부담스럽게 작용하여 반대의 효과를 볼 수 있다. 서두르는 것이 좋지 않게 작용할 수 있다. A형 남성은 밝고 개성이 강한 여성을 좋아하는 경향이 있다. 그렇지만 신경질적이고 완벽주의자이기 때문에 사소한 일에도 세심히 신경을 쓰는 면이 있다. 그가 비록 개방적인 여성을 좋아한다고는 해도 기본적인 에티켓을 지키지 않는 경우는 좋지 않은 느낌을 줄 수도 있다. 가까운 여성일수록 더 신경을 써야 한다. 그렇다고 해서 그의 표정만 살피고 있을 필요는 없다. 필요한 곳에서 매너를 지켜주고 자기 마음대로 하는 행동은 가급적 삼가 하는 편이 좋다. 또 자존심에 상처를 주는 발언이나 행동도 큰 싸움의 원인이 될 수 있으므로 주의한다. 그는 프라이드가 강하고 완벽을 추구하기 때문에 사람 앞에서 창피를 주거나 사적인 일을 폭로한다면 크게 화를 낼 것이다. 만약 싸움이 벌어졌다면 여성이 먼저 사과를 하는 것이 사태 악화를 방지할 수 있다. 그의 나쁜 점을 지적해서 사과를 받으려고 하면 두 사람의 관계는 회복할 수 없는 관계로 될 수 있으므로 사과할 때는 구체적인 예를 들어 사과하는 것이 보다 효과적이다. A형은 논리적이기 때문에 이런 식으로 사과하면 같이 잘못을 시인하며 금방 수그러진다. O형 여성의 단순하고 명쾌한 성격이 A형 남성을 끌리게 한다. 상식파인 그의 충고에 대해 여성이 귀찮게 여긴다면 다투게 될 수도 있다. 그런 경우에는 순수하게 귀를 기울이도록 하는 것이 좋다. A형의 남성은 예민하기 때문에 상대로부터 자극적이지 않은 편안함을 원한다. 단, 결혼 상대에게 높은 이상을 가지고 있을 뿐 아니라 신중한 타입이므로 이 여자라고 생각을 하고도 좀처럼 청혼하지 못하는 경우가 많다. 그러나 그의 가족에게 인사를 시켰다면 거의 결혼까지 결정했다고 생각해도 좋다. 반대로 여성이 적극적으로 가족을 만나고 싶다는 요구를 해도 좀처럼 받아주지 않는 경우는 문제가 있는 것이다. 그는 좀 빠르다고 판단하고 있다던가 좀 더 교제해 보아야 할 것이라든가 아니면 그녀와 결혼할 마음이 없다고 생각할 가능성이 크다. 
성공의 노하우
그 정도로 A형은 항상 누군가를 위해 또는 무엇인가를 위해 사는 책임감 내지는 사명감을 가지고 있고 특히 가족을 소중히 하는 생각이 다른 사람보다 강하기 때문에 교재 중인 여성을 그의 부모에게 인사 시켰다는 것은 그가 결혼을 구체적으로 생각하기 시작했다고 하는 증거이다. 이런 A형이기 때문에 타인으로부터 자신의 가족에 대해 나쁜 말을 들으면 참지 못하며 사소한 비평에도 민감하기 때문에 주의하도록 한다. 가령 그가 자기 가족을 나쁘게 말하거나 비웃는다 해도 함께 비판 하는 것은 금물이다. A형의 남성과 O형 여성은 좋아지면 바로 결혼하고 싶어하지만 좀처럼 확실하게 대답하지 않는 남성에게 여성이 안절부절 못하는 경향이 있다. 여성이 먼저 의사를 표시하는 것도 좋은 방법이 될 것이다.",
"남자 A형과 여자 AB형
두 사람은
사소한 일에도 신경을 쓰는 A형의 남성은 AB형 여성의 사물에 집착하지 않는 담백한 성격에 매력을 느끼게 된다. AB형인 여성이 그를 지탱해 준다면 잘 나가는 커플이 될 것이다. 그가 편안해지도록 배려를 하고 마음을 쓰면 결혼에 골인할 가능성이 높다. 단, AB형 여성이 가지고 있는 합리성이나 무미건조한 면이 그에게 불신감을 안겨줄 수 있는 경우가 있으므로 가급적이면 항상 성실한 태도를 보이는 것이 중요하다.
상대 파악하기
 A형 남성은 기본적으로 신중한 편이다. 그것은 연애에 있어서도 그렇다. 충동적으로 사랑을 고백하거나 만난지 얼마 되지 않은 여성과 바로 사랑을 나누는 경우는 거의 없다. 맘에 드는 여성이 있으면 시간을 들여 조금씩 거리를 좁혀 나간다. 사랑의 말도 직접적이지 않고 우회적으로 표현하기 때문에 상대 여성이 알아채지 못하는 경우가 있다. 이는 상처 입는 것을 다른 혈액형의 사람에 비해 두 배 이상 두려워하기 때문이다. 고백을 했다가 거절 당하는 것을 두려워하는 편이다. 만약 이런 그와 관계를 진전시키고 싶다면 표시 나지 않도록 그에게 자신감을 심어주어야 한다. 데이트를 한 다음 '오늘 정말 즐거웠어'라고 한마디 해준다. 이렇게 신경을 써주면 그의 경계심이 풀어 질 것이다. 반면 여성이 갑자기 대담한 사랑 고백을 하면 오히려 역효과가 나서 그가 뒷걸음 치는 일도 있을 수 있다. 단, 생일이나 발렌타인데이 등은 잘 이용할 수 있어야 할 것이다. 선물 속에 자신의 기분을 전하는 카드를 써 넣으면 그의 마음에 들 수 있을 것이다. 주변 사람들과의 협조를 중시하는 A형은 인간관계에 대한 스트레스를 안고 있기 쉬우므로 조심스럽게 위로를 할 경우 감격해 할 것이다. A형은 감정을 밖으로 잘 드러내지 않으므로 잘 관찰해서 그의 기분의 변화를 감지하는 것이 중요하다. AB형 여성의 깔끔한 성격이 신중한 A형의 남성에게 좋은 감정을 준다. 그러나 변덕이 심한 AB형의 일면이 드러나면 그에게 불신감을 안겨 줄 수 있으므로 조심한다. A형 남성은 밝고 개성이 강한 여성을 좋아하는 경향이 있다. 그렇지만 신경질적이고 완벽주의자이기 때문에 사소한 일에도 세심히 신경을 쓰는 면이 있다. 그가 비록 개방적인 여성을 좋아한다고는 해도 기본적인 에티켓을 지키지 않는 경우는 좋지 않은 느낌을 줄 수도 있다. 가까운 여성일수록 더 신경을 써야 한다. 그렇다고 해서 그의 표정만 살피고 있을 필요는 없다. 필요한 곳에서 매너를 지켜주고 자기 마음대로 하는 행동은 가급적 삼가 하는 편이 좋다. 또 자존심에 상처를 주는 발언이나 행동도 큰 싸움의 원인이 될 수 있으므로 주의한다. 그는 프라이드가 강하고 완벽을 추구하기 때문에 사람 앞에서 창피를 주거나 사적인 일을 폭로한다면 크게 화를 낼 것이다. 만약 싸움이 벌어졌다면 여성이 먼저 사과를 하는 것이 사태 악화를 방지할 수 있다. 그의 나쁜 점을 지적해서 사과를 받으려고 하면 두 사람의 관계는 회복할 수 없는 관계로 될 수 있으므로 사과할 때는 구체적인 예를 들어 사과하는 것이 보다 효과적이다. A형은 논리적이기 때문에 이런 식으로 사과하면 같이 잘못을 시인하며 금방 수그러진다. A형 남성과 AB형 여성은 싸움을 거의 하진 않는 좋은 커플이 될 수 있다. A형의 남성은 예민하기 때문에 상대로부터 자극적이지 않은 편안함을 원한다. 단, 결혼 상대에게 높은 이상을 가지고 있을 뿐 아니라 신중한 타입이므로 이 여자라고 생각을 하고도 좀처럼 청혼하지 못하는 경우가 많다. 그러나 그의 가족에게 인사를 시켰다면 거의 결혼까지 결정했다고 생각해도 좋다. 반대로 여성이 적극적으로 가족을 만나고 싶다는 요구를 해도 좀처럼 받아주지 않는 경우는 문제가 있는 것이다. 그는 좀 빠르다고 판단하고 있다던가 좀 더 교제해 보아야 할 것이라든가 아니면 그녀와 결혼할 마음이 없다고 생각할 가능성이 크다. 
성공의 노하우
그 정도로 A형은 항상 누군가를 위해 또는 무엇인가를 위해 사는 책임감 내지는 사명감을 가지고 있고 특히 가족을 소중히 하는 생각이 다른 사람보다 강하기 때문에 교재 중인 여성을 그의 부모에게 인사 시켰다는 것은 그가 결혼을 구체적으로 생각하기 시작했다고 하는 증거이다. 이런 A형이기 때문에 타인으로부터 자신의 가족에 대해 나쁜 말을 들으면 참지 못하며 사소한 비평에도 민감하기 때문에 주의하도록 한다. 가령 그가 자기 가족을 나쁘게 말하거나 비웃는다 해도 함께 비판 하는 것은 금물이다. AB형 여성은 비평하는 것을 좋아하기 때문에 그의 가족에 대해 실수를 하게 되는 경우도 생길 듯하니 항상 말조심을 하는 것이 좋을 것이다."),
	array("남자 B형과 여자 A형
두 사람은
처음부터 끝까지 모든 방면에서 대조적인 두 사람은 처음에는 신선한 느낌으로 교제를 시작하지만 결국에는 그런 성격 차이에 많은 어려움을 겪는다. 
상대 파악하기
매사에 있어서 맺고 끊는 것이 불분명한 B형의 남성에 대해 절도를 중요시하는 A형의 여성이 불만을 느끼게 되며 여성이 남성을 나무라면서 둘 사이가 벌어지기 시작한다. 이런 유형의 만남에서는 여성쪽에서 남성의 자유분방한 성격을 이해하는 것이 필요하고 여유를 갖고 그를 대한다. 처음에는 가벼운 친구관계에서 출발 하지만 사랑이 갑자기 끓어오르는 것이 B형의 연애 형태이다. 한 번 불이 붙으면 매일 상대방을 만나고 싶어하지만 기본적으로 자기 위주의 성격으로 자신이 상대를 속박하는 일은 있어도 자신이 속박 당하는 것을 아주 싫어하는 편이다. 아무리 사랑하는 사람이라도 자신의 태도나 행동에 대해 제한을 가하면 참지 못하는 성격이다. 그렇기 때문에 여성이 그에게 자신의 상황에 맞추도록 강요하거나 끈질기게 그의 스케줄을 묻는 것은 좋지 않은 결과를 초래할 수 있다. 가급적 주도권을 그에게 주는 편이 부드러운 진행을 유도한다. B형은 정에 약한 면이 있으므로 사랑하는 사람이 고민을 하거나 도움을 구할 경우 가까이 다가가는 방법을 취한다. 그의 시선을 자신 쪽으로 향하게 하고 싶다면 무언가 상담할 상황을 만드는 것도 하나의 방법이 될 수 있다. 또 B형은 자극을 좋아하기 때문에 표정이 풍부하고 개성이 강한 여성에게 끌리는 경향이 있다. 즐거운 대화가 가능하거나 자유분방하고 약간 의외적인 분위기를 가진 여성이 그의 눈에 매력적으로 비쳐진다. B형 남성과 A형 여성은 자신에게 부족한 부분을 상대방으로부터 얻게 되면서 서로 강하게 끌린다. 때때로 B형의 덜렁거리는 면이 눈에 거슬려도 잔소리를 하지 않는 것이 중요하다. 어떤 일이건 시작하면 몰두하게 되는 성격의 B형에게 그의 주의를 자기에게 돌리기 위해서 무리를 하는 것은 현명하지 못한 방법이다. B형은 일이나 취미생활에 빠져있을 때 누군가에 의해서 방해 받는 것을 아주 싫어하기 때문이다. 대화를 원한다면 그가 일에서 약간의 여유를 갖고 있을 때 가볍게 접근해서 시도하는 것이 방법이다. 그가 흥미롭게 이야기를 시작하는 것이 있다면 귀를 기울여 들어주는 것도 필요하다. B형은 자신을 무시하는 것에 상당한 불쾌감을 나타내며 특히 흥미를 갖고 이야기를 하는데 지루한 표정이나 따분해 한다면 화를 내는 경우가 많다. 이런 형의 사람은 자신의 이야기를 진지하게 들어주는 상대를 좋아하는 편이다. 그리고 한 번 화를 내면 의외로 정도가 심할 수도 있고 노골적으로 표현하는 경우도 있다. 이런 경우는 그가 진정될 때 까지 기다렸다가 이야기를 제안하는 방법이 좋으며, 이때 논리적으로 해결하는 것 보다는 정에 호소하며 그를 잘 구슬리는 방법을 택하면 무리 없이 좋은 관계를 지속할 수 있을 것이다. A형 여성에게 있어서 성격이 대조적인 B형 남성을 신선하게 느낀다. 그러나 그러한 차이가 원인이 되어 싸움이 잦을 수도 있으니 여유를 가지고 교제해 나가는 것이 중요하다고 할 수 있다. B형은 일반적인 통념이나 주위 사람들의 시선을 의식하지 않는 자기만의 스타일을 고집하는 형이다. 본인이 현재의 생활에 불만이 없다면 교제기간이 얼마이건 나이가 어떻든 크게 구애 받지 않고 생활하는 스타일이기 때문에 결혼 등에 의해서 자기 생활이 변화되는 것을 원하지 않는 경우도 있다. 또한 사물을 정확하게 구분 짓는 것이 서툰 편이기 때문에 결혼하려는 마음이 있어도 좀처럼 결혼에 골인할 수 없다. 
성공의 노하우
그의 마음을 결혼 쪽으로 돌리기 위해서는 그가 이상적으로 생각하는 자유롭고 즐거운 가정상을 가볍게 이야기하거나 상대를 최대한 존중하면서 생활할 수 있는 분위기를 강조하는 방법을 쓰는 것이 좋다. 그렇게 해도 흥미를 유발하지 않는 다면 그의 결혼에 대한 결심에 여러 가지 문제가 있는 것으로 생각할 수 있다. A형 여성은 좀 더 확실한 결론을 내고 싶어하지만 미온적인 태도를 보이는 그에게 크게 실망할 수 있다. 이때 그에게 따지거나 책임을 추궁하게 되면 오히려 결혼이 멀어질 수도 있으니 주의한다.",
"남자 B형과 여자 B형
두 사람은
이런 형의 커플은 대체로 처음에는 서로에 익숙하지 않지만 시간이 지남에 따라 좋은 관계로 발전되는 만남이다. 좋은 친구사이로 시작해서 연인 관계로 발전하는 경우가 많은 편이다. 
상대 파악하기
교제를 시작한 초기에는 둘 다 상대를 자신의 스타일에 맞추려고 하기 때문에 서로 반감을 사거나 다툼이 있지만 상대를 이해하기 시작하면서 좋은 관계로 유지될 수 있다. 처음에는 가벼운 친구관계에서 출발 하지만 사랑이 갑자기 끓어오르는 것이 B형의 연애 형태이다. 한 번 불이 붙으면 매일 상대방을 만나고 싶어하지만 기본적으로 자기 위주의 성격으로 자신이 상대를 속박하는 일은 있어도 자신이 속박 당하는 것을 아주 싫어하는 편이다. 아무리 사랑하는 사람이라도 자신의 태도나 행동에 대해 제한을 가하면 참지 못하는 성격이다. 그렇기 때문에 여성이 그에게 자신의 상황에 맞추도록 강요하거나 끈질기게 그의 스케줄을 묻는 것은 좋지 않은 결과를 초래할 수 있다. 가급적 주도권을 그에게 주는 편이 부드러운 진행을 유도한다. B형은 정에 약한 면이 있으므로 사랑하는 사람이 고민을 하거나 도움을 구할 경우 가까이 다가가는 방법을 취한다. 그의 시선을 자신 쪽으로 향하게 하고 싶다면 무언가 상담할 상황을 만드는 것도 하나의 방법이 될 수 있다. 또 B형은 자극을 좋아하기 때문에 표정이 풍부하고 개성이 강한 여성에게 끌리는 경향이 있다. 즐거운 대화가 가능하거나 자유분방하고 약간 의외적인 분위기를 가진 여성이 그의 눈에 매력적으로 비쳐진다. B형은 자극적인 것을 좋아하기 때문에 표정이 풍부하고 개성적인 여성에게 끌리는 경향이 있다. 즐겁게 대화를 나눌 수 있는 여성이나 자유분방하고 약간 모진 분위기를 가진 여성이 그의 눈에는 매력적으로 보여진다. B형의 남성과 여성은 서로를 가장 잘 이해하고 마음 편하게 지낼 수 있는 친구이다. 연애초기에는 서로의 스타일을 맞추지 않아 충돌 하는 경우도 있지만 익숙해지면서 좋은 관계로 발전한다. 어떤 일이건 시작하면 몰두하게 되는 성격의 B형에게 그의 주의를 자기에게 돌리기 위해서 무리를 하는 것은 현명하지 못한 방법이다. B형은 일이나 취미생활에 빠져있을 때 누군가에 의해서 방해 받는 것을 아주 싫어하기 때문이다. 대화를 원한다면 그가 일에서 약간의 여유를 갖고 있을 때 가볍게 접근해서 시도하는 것이 방법이다. 그가 흥미롭게 이야기를 시작하는 것이 있다면 귀를 기울여 들어주는 것도 필요하다. B형은 자신을 무시하는 것에 상당한 불쾌감을 나타내며 특히 흥미를 갖고 이야기를 하는데 지루한 표정이나 따분해 한다면 화를 내는 경우가 많다. 이런 형의 사람은 자신의 이야기를 진지하게 들어주는 상대를 좋아하는 편이다. 그리고 한 번 화를 내면 의외로 정도가 심할 수도 있고 노골적으로 표현하는 경우도 있다. 이런 경우는 그가 진정될 때 까지 기다렸다가 이야기를 제안하는 방법이 좋으며, 이때 논리적으로 해결하는 것 보다는 정에 호소하며 그를 잘 구슬리는 방법을 택하면 무리 없이 좋은 관계를 지속할 수 있을 것이다. AB형의 여성은 대체로 B형의 마음속을 잘 알고 있기 때문에 싸우는 경우는 드문 것이 보통이다. 하지만 그 점에 안심하고 있다가는 서로의 마음이 어긋나는 경우가 있으므로 주의해야 한다. 처음엔 같은 B형인 그와 충돌하는 일이 종종 일어나지만 교제가 길어짐에 따라 싸움도 적어진다. B형은 일반적인 통념이나 주위 사람들의 시선을 의식하지 않는 자기만의 스타일을 고집하는 형이다. 본인이 현재의 생활에 불만이 없다면 교제기간이 얼마이건 나이가 어떻든 크게 구애 받지 않고 생활하는 스타일이기 때문에 결혼 등에 의해서 자기 생활이 변화되는 것을 원하지 않는 경우도 있다. 또한 사물을 정확하게 구분 짓는 것이 서툰 편이기 때문에 결혼하려는 마음이 있어도 좀처럼 결혼에 골인할 수 없다. 
성공의 노하우
그의 마음을 결혼 쪽으로 돌리기 위해서는 그가 이상적으로 생각하는 자유롭고 즐거운 가정상을 가볍게 이야기하거나 상대를 최대한 존중하면서 생활할 수 있는 분위기를 강조하는 방법을 쓰는 것이 좋다. 그렇게 해도 흥미를 유발하지 않는 다면 그의 결혼에 대한 결심에 여러 가지 문제가 있는 것으로 생각할 수 있다. 둘 다 남의 이 목은 신경 쓰지 않는 자기 스타일을 고집하는 형이므로 결혼 시기를 잘 못 맞추는 일이 많다. 결혼하려면 어느 한 쪽이라도 꺾여야 할 필요가 있다.",
"남자 B형과 여자 O형
두 사람은
남자 B형과 여자 O형은 가장 밝고 즐거운 사이가 될 수 있는 커플이다. 
상대 파악하기
특히 여성이 남성을 감싸줄 수 있는 관계라면 더욱 좋은 관계가 된다. 또한 O형의 여성이 그를 항상 보조해줄 수 있다면 두 사람의 사이의 관계와 그의 일도 잘 풀리게 되는 사이이다. 단, 너무 자유분방한 B형의 그에게 O형 여성이 미처 따라가지 못할 가능성이 있기도 하다. 평소 여성은 본인의 생각을 확실히 표출하고 이해를 구해 두는 것이 중요할 것이다. 처음에는 가벼운 친구관계에서 출발 하지만 사랑이 갑자기 끓어오르는 것이 B형의 연애 형태이다. 한 번 불이 붙으면 매일 상대방을 만나고 싶어하지만 기본적으로 자기 위주의 성격으로 자신이 상대를 속박하는 일은 있어도 자신이 속박 당하는 것을 아주 싫어하는 편이다. 아무리 사랑하는 사람이라도 자신의 태도나 행동에 대해 제한을 가하면 참지 못하는 성격이다. 그렇기 때문에 여성이 그에게 자신의 상황에 맞추도록 강요하거나 끈질기게 그의 스케줄을 묻는 것은 좋지 않은 결과를 초래할 수 있다. 가급적 주도권을 그에게 주는 편이 부드러운 진행을 유도한다. B형은 정에 약한 면이 있으므로 사랑하는 사람이 고민을 하거나 도움을 구할 경우 가까이 다가가는 방법을 취한다. 그의 시선을 자신 쪽으로 향하게 하고 싶다면 무언가 상담할 상황을 만드는 것도 하나의 방법이 될 수 있다. 또 B형은 자극을 좋아하기 때문에 표정이 풍부하고 개성이 강한 여성에게 끌리는 경향이 있다. 즐거운 대화가 가능하거나 자유분방하고 약간 의외적인 분위기를 가진 여성이 그의 눈에 매력적으로 비쳐진다. B형은 자극적인 것을 좋아하기 때문에 표정이 풍부하고 개성적인 여성에게 끌리는 경향이 있다. 즐겁게 대화를 나눌 수 있는 여성이나 자유분방하고 약간 모진 분위기를 가진 여성이 그의 눈에는 매력적으로 보여진다. O형 여성 특유의 상대를 잘 치켜세우는 기술을 무기로 아부를 좋아하는 B형 남성을 기분 좋게 만드는 것으로 둘 사이의 거리를 좁힐 수 있다. 어떤 일이건 시작하면 몰두하게 되는 성격의 B형에게 그의 주의를 자기에게 돌리기 위해서 무리를 하는 것은 현명하지 못한 방법이다. B형은 일이나 취미생활에 빠져있을 때 누군가에 의해서 방해 받는 것을 아주 싫어하기 때문이다. 대화를 원한다면 그가 일에서 약간의 여유를 갖고 있을 때 가볍게 접근해서 시도하는 것이 방법이다. 그가 흥미롭게 이야기를 시작하는 것이 있다면 귀를 기울여 들어주는 것도 필요하다. B형은 자신을 무시하는 것에 상당한 불쾌감을 나타내며 특히 흥미를 갖고 이야기를 하는데 지루한 표정이나 따분해 한다면 화를 내는 경우가 많다. 이런 형의 사람은 자신의 이야기를 진지하게 들어주는 상대를 좋아하는 편이다. 그리고 한 번 화를 내면 의외로 정도가 심할 수도 있고 노골적으로 표현하는 경우도 있다. 이런 경우는 그가 진정될 때 까지 기다렸다가 이야기를 제안하는 방법이 좋으며, 이때 논리적으로 해결하는 것 보다는 정에 호소하며 그를 잘 구슬리는 방법을 택하면 무리 없이 좋은 관계를 지속할 수 있을 것이다. AB형의 여성은 대체로 B형의 마음속을 잘 알고 있기 때문에 싸우는 경우는 드문 것이 보통이다. 하지만 그 점에 안심하고 있다가는 서로의 마음이 어긋나는 경우가 있으므로 주의해야 한다. 오래 사귀다 보면 그의 제멋대로인 부분이 자꾸 거슬리게 된다. 처음의 마음을 잊지 않고 지속될 수록 해야 한다. B형은 일반적인 통념이나 주위 사람들의 시선을 의식하지 않는 자기만의 스타일을 고집하는 형이다. 본인이 현재의 생활에 불만이 없다면 교제기간이 얼마이건 나이가 어떻든 크게 구애 받지 않고 생활하는 스타일이기 때문에 결혼 등에 의해서 자기 생활이 변화되는 것을 원하지 않는 경우도 있다. 또한 사물을 정확하게 구분 짓는 것이 서툰 편이기 때문에 결혼하려는 마음이 있어도 좀처럼 결혼에 골인할 수 없다. 
성공의 노하우
그의 마음을 결혼 쪽으로 돌리기 위해서는 그가 이상적으로 생각하는 자유롭고 즐거운 가정상을 가볍게 이야기하거나 상대를 최대한 존중하면서 생활할 수 있는 분위기를 강조하는 방법을 쓰는 것이 좋다. 그렇게 해도 흥미를 유발하지 않는 다면 그의 결혼에 대한 결심에 여러 가지 문제가 있는 것으로 생각할 수 있다. 아부에 약한 B형 남성을 잘 치켜세워 주면 결혼에 골인할 가능성이 높은 편이다. 그리고 행복한 결혼생활을 보낼 수 있는 최상의 커플이다.",
"남자 B형과 여자 AB형
두 사람은
서로 상대방이 생각하고 있는 것을 이해하는 이상적인 커플이며 대등한 관계를 유지할 수 있다. 
상대 파악하기
이것은 B형도 AB형도 자신의 세계를 중시해 상대방을 속박하지 않기 때문이다.그러나 부딪히는 일이 없는 대신 자극이나 긴장감이 부족해 정열이 식을 수도 있다. 때로는 함께 같은 일을 즐기는 시간을 만들어 기분전환을 하는 것도 중요하다. 처음에는 가벼운 친구관계에서 출발 하지만 사랑이 갑자기 끓어오르는 것이 B형의 연애 형태이다. 한 번 불이 붙으면 매일 상대방을 만나고 싶어하지만 기본적으로 자기 위주의 성격으로 자신이 상대를 속박하는 일은 있어도 자신이 속박 당하는 것을 아주 싫어하는 편이다. 아무리 사랑하는 사람이라도 자신의 태도나 행동에 대해 제한을 가하면 참지 못하는 성격이다. 그렇기 때문에 여성이 그에게 자신의 상황에 맞추도록 강요하거나 끈질기게 그의 스케줄을 묻는 것은 좋지 않은 결과를 초래할 수 있다. 가급적 주도권을 그에게 주는 편이 부드러운 진행을 유도한다. B형은 정에 약한 면이 있으므로 사랑하는 사람이 고민을 하거나 도움을 구할 경우 가까이 다가가는 방법을 취한다. 그의 시선을 자신 쪽으로 향하게 하고 싶다면 무언가 상담할 상황을 만드는 것도 하나의 방법이 될 수 있다. 또 B형은 자극을 좋아하기 때문에 표정이 풍부하고 개성이 강한 여성에게 끌리는 경향이 있다. 즐거운 대화가 가능하거나 자유분방하고 약간 의외적인 분위기를 가진 여성이 그의 눈에 매력적으로 비쳐진다. B형은 자극적인 것을 좋아하기 때문에 표정이 풍부하고 개성적인 여성에게 끌리는 경향이 있다. 즐겁게 대화를 나눌 수 있는 여성이나 자유분방하고 약간 모진 분위기를 가진 여성이 그의 눈에는 매력적으로 보여진다. 서로의 기분에 잘 맞출 수 있는 관계이고 B형은 AB형을 받쳐주는 궁합이기 때문에 그에게 여러 문제에 대한 상담을 하게 되면 좀 더 진전할 수 있다. 어떤 일이건 시작하면 몰두하게 되는 성격의 B형에게 그의 주의를 자기에게 돌리기 위해서 무리를 하는 것은 현명하지 못한 방법이다. B형은 일이나 취미생활에 빠져있을 때 누군가에 의해서 방해 받는 것을 아주 싫어하기 때문이다. 대화를 원한다면 그가 일에서 약간의 여유를 갖고 있을 때 가볍게 접근해서 시도하는 것이 방법이다. 그가 흥미롭게 이야기를 시작하는 것이 있다면 귀를 기울여 들어주는 것도 필요하다. B형은 자신을 무시하는 것에 상당한 불쾌감을 나타내며 특히 흥미를 갖고 이야기를 하는데 지루한 표정이나 따분해 한다면 화를 내는 경우가 많다. 이런 형의 사람은 자신의 이야기를 진지하게 들어주는 상대를 좋아하는 편이다. 그리고 한 번 화를 내면 의외로 정도가 심할 수도 있고 노골적으로 표현하는 경우도 있다. 이런 경우는 그가 진정될 때 까지 기다렸다가 이야기를 제안하는 방법이 좋으며, 이때 논리적으로 해결하는 것 보다는 정에 호소하며 그를 잘 구슬리는 방법을 택하면 무리 없이 좋은 관계를 지속할 수 있을 것이다. AB형의 여성은 대체로 B형의 마음속을 잘 알고 있기 때문에 싸우는 경우는 드문 것이 보통이다. 하지만 그 점에 안심하고 있다가는 서로의 마음이 어긋나는 경우가 있으므로 주의해야 한다. B형은 일반적인 통념이나 주위 사람들의 시선을 의식하지 않는 자기만의 스타일을 고집하는 형이다. 본인이 현재의 생활에 불만이 없다면 교제기간이 얼마이건 나이가 어떻든 크게 구애 받지 않고 생활하는 스타일이기 때문에 결혼 등에 의해서 자기 생활이 변화되는 것을 원하지 않는 경우도 있다. 또한 사물을 정확하게 구분 짓는 것이 서툰 편이기 때문에 결혼하려는 마음이 있어도 좀처럼 결혼에 골인할 수 없다. 
성공의 노하우
그의 마음을 결혼 쪽으로 돌리기 위해서는 그가 이상적으로 생각하는 자유롭고 즐거운 가정상을 가볍게 이야기하거나 상대를 최대한 존중하면서 생활할 수 있는 분위기를 강조하는 방법을 쓰는 것이 좋다. 그렇게 해도 흥미를 유발하지 않는 다면 그의 결혼에 대한 결심에 여러 가지 문제가 있는 것으로 생각할 수 있다. 교제 기간이 길어질 가능성이 많은 커플이 되기 쉽다. 그러므로 너무 오래 끌다가 서로 권태감을 느끼기 전에 결혼을 하는 것이 좋을 듯 하다."),
	array("남자 O형과 여자 A형
두 사람은
O형인 남성에게 있어서 A형 여성은 이상적인 배우자 상이다. 그것은 작은 것은 신경을 쓰지 않으면서 개방적인 그의 성격을 상식적인 범위 내에서 세심한 부분까지 신경을 써주는 A형 여성이 보완을 해주기 때문이다. 이런 형의 커플은 순조롭게 사랑을 키워 나갈 수 있는 사이이다. 
상대 파악하기
단, A형 여성이 그의 덜렁대는 듯한 행동에 너무 잦게 간섭을 하게 되면 불편한 관계로 발전될 수도 있으니 가끔은 그를 추켜세우는 것도 좋은 방법이 될 것이다. 한번 이 여자이다라고 생각을 하면 망설임 없이 접근하는 스타일로 O형은 아주 정열가 다운 기질이 있다. 그런 만큼 독점욕도 대단하다. 그렇다고 해서 다른 남성을 개입시켜 그의 마음을 잡으려는 시도를 하는 것은 금물이다. 말을 돌려서 한다거나 유치한 방법을 택하는 것은 모처럼의 정열에 좋지 않은 영향을 미칠 수 있다. 감정의 표현이 솔직한 O형에게 효과적인 것은 직접적인 말이나 알기 쉬운 애정 표현이다. 그의 마음을 얻고 싶다면 자신에게 있어서 그는 특별한 존재라는 기분을 느낄 수 있도록 말이나 행동으로 강조해야 한다. 전형적인 O형 남성이 좋아하는 여성상은 성실함이다. 게다가 남성은 남성다워야 하고 여성은 여성스러워야 한다고 생각하기 때문에 그러한 여성에 끌리는 경향이 있다. 특히 마음이 강한 현모양처형이나 개성 있는 밝은 스타일에 약한 면이 있다. O형의 남성에게는 모든 일의 리드를 맡기고 그를 보조해 주는 관계가 원만할 것이다. 좋은 마음으로 한 충고가 그의 자존심을 건드리는 경우가 있으므로 주의하는 것이 좋다. 다른 사람에게 가르치거나 충고하는 것을 좋아하는 O형이지만 반대로 다른 사람에게 가르침을 받는 것은 아주 싫어하는 성격이다. 특히 자기가 자신 있다고 생각하는 분야에 대한 의견을 말할 때는 조심하지 않으면 문제가 크게 발생할 수도 있으니 주의한다. 직접적으로 가르치거나 하는 것이 아니더라도 강압적인 말 투나 설교 같은 어투는 삼가는 것이 좋다. O형은 감정 표현이 직선적이기 때문에 다툼이 있을 경우 걷잡을 수 없을 정도로 커지기 쉽다. 게다가 화가 난 상태에서는 논리적인 것이 통하지 않는다. 하지만 일단 상황이 정리된 후에는 뒤끝이 없으므로 이쪽에서 편하게 다가서면 별 문제 없이 잘 풀어지는 성격이다. 그러나 사과를 하면서 그에게도 약간의 잘못을 인정하게 만들려고 하는 것은 절대 삼가는 것이 좋다. 이성을 잃으면 논리가 통하지 않는 것이 O형이라는 것을 명심 하도록 한다. O형의 대범한 성격에 부딪쳐 싸우는 경우가 많을 수 있으니 세심하게 신경을 쓰는 자신의 성격을 조금 자제하는 것이 중요한다. O형은 로맨틱하여 표현이 풍부하고 이상적인 이야기를 많이 하는 편이다. 그러한 성격이 가장 잘 드러나는 것이 역시 연애이다. 좋아하는 여성에게는 적극적으로 접근하여 다정한 사랑의 말을 전한다. 그리고 결혼을 원하는 상대이다 라고 생각하면 주저 없이 프로포즈를 한다. 그렇지만 그 반면 현실적으로 판단 하는 경우도 있다. O형에게는 현실적인 면과 로맨틱한 면이 상반되어 공존하고 있기 때문에 상대가 쉽게 넘어올 것 같은 경우에는 단순한 연애상대로 결정하고 사귀는 일도 있다. 하지만 결혼 상대에 대해서는 현실적으로 현모양처형의 여성을 바라게 된다. 그렇기 때문에 그의 마음을 알아보기 위해서 때로는 자연스럽고 정신적인 데이트를 제안해 보는 것도 하나의 방법이다. 만일 그가 싫어한다면 두 사람의 관계는 육체적인 것만 추구하는 단순 연애 상대일 가능성이 있으므로 고려해봐야 할 상황일 것이다. 
성공의 노하우
그래도 그와 결혼을 원한다면 자신의 여성적인 면을 드러내어 보여줄 필요가 있다. 일반적으로 조신한 여성의 전형으로 편안한 가정요리를 만들어 보이거나 너무 까다롭지 않다는 면을 표나지 않게 어필할 필요가 있다. A형의 여성은 대체로 차분하고 안정적인 편이기 때문에 그가 단순 연애 상대로 사귀는 경우는 거의 없고 결혼상대로 생각하고 있을 가능성이 높다.",
"남자 O형과 여자 B형
두 사람은
밝으면서도 개성적인 여성 상을 좋아하는 O형의 남성은 자유분방한 B형의 여성에게 매력을 느낀다. O형의 그는 B형의 여성을 잘 감싸주는 편이다. 이런 커플의 경우 항상 그를 치켜세워준다면 결혼까지 발전하기 수월하다. 
상대 파악하기
단, 그가 일에 몰두하게 되면 불만을 느낀 여성이 다른 남성 쪽으로 흥미를 옮길 가능성도 있다. 양쪽 다 미래 지향적인 성격을 가졌다. 그이 사랑을 믿으면서 성실한 태도로 교제를 하는 것이 중요하다. 한번 이 여자이다라고 생각을 하면 망설임 없이 접근하는 스타일로 O형은 아주 정열가 다운 기질이 있다. 그런 만큼 독점욕도 대단하다. 그렇다고 해서 다른 남성을 개입시켜 그의 마음을 잡으려는 시도를 하는 것은 금물이다. 말을 돌려서 한다거나 유치한 방법을 택하는 것은 모처럼의 정열에 좋지 않은 영향을 미칠 수 있다. 감정의 표현이 솔직한 O형에게 효과적인 것은 직접적인 말이나 알기 쉬운 애정 표현이다. 그의 마음을 얻고 싶다면 자신에게 있어서 그는 특별한 존재라는 기분을 느낄 수 있도록 말이나 행동으로 강조해야 한다. 전형적인 O형 남성이 좋아하는 여성상은 성실함이다. 게다가 남성은 남성다워야 하고 여성은 여성스러워야 한다고 생각하기 때문에 그러한 여성에 끌리는 경향이 있다. 특히 마음이 강한 현모양처형이나 개성 있는 밝은 스타일에 약한 면이 있다. 서로 자기 주장이 강하기 때문에 교제 초기에는 대체적으로 어색한 편이다. 일단 여성이 한발 다가가는 것이 좋은 방법이다. 다른 사람에게 가르치거나 충고하는 것을 좋아하는 O형이지만 반대로 다른 사람에게 가르침을 받는 것은 아주 싫어하는 성격이다. 특히 자기가 자신 있다고 생각하는 분야에 대한 의견을 말할 때는 조심하지 않으면 문제가 크게 발생할 수도 있으니 주의한다. 직접적으로 가르치거나 하는 것이 아니더라도 강압적인 말 투나 설교 같은 어투는 삼가는 것이 좋다. O형은 감정 표현이 직선적이기 때문에 다툼이 있을 경우 걷잡을 수 없을 정도로 커지기 쉽다. 게다가 화가 난 상태에서는 논리적인 것이 통하지 않는다. 하지만 일단 상황이 정리된 후에는 뒤끝이 없으므로 이쪽에서 편하게 다가서면 별 문제 없이 잘 풀어지는 성격이다. 그러나 사과를 하면서 그에게도 약간의 잘못을 인정하게 만들려고 하는 것은 절대 삼가는 것이 좋다. 이성을 잃으면 논리가 통하지 않는 것이 O형이라는 것을 명심 하도록 한다. 자기 스타일을 고집하는 B형에게 무엇이든 가르치기 좋아하는 O형이 이런 저런 충고를 하다 그것이 원인이 되어 싸우게 되는 경우가 많다. 모처럼 충고를 해 준다면 따르도록 하는 것이 현명하다. O형은 로맨틱하여 표현이 풍부하고 이상적인 이야기를 많이 하는 편이다. 그러한 성격이 가장 잘 드러나는 것이 역시 연애이다. 좋아하는 여성에게는 적극적으로 접근하여 다정한 사랑의 말을 전한다. 그리고 결혼을 원하는 상대이다 라고 생각하면 주저 없이 프로포즈를 한다. 그렇지만 그 반면 현실적으로 판단 하는 경우도 있다. O형에게는 현실적인 면과 로맨틱한 면이 상반되어 공존하고 있기 때문에 상대가 쉽게 넘어올 것 같은 경우에는 단순한 연애상대로 결정하고 사귀는 일도 있다. 하지만 결혼 상대에 대해서는 현실적으로 현모양처형의 여성을 바라게 된다. 그렇기 때문에 그의 마음을 알아보기 위해서 때로는 자연스럽고 정신적인 데이트를 제안해 보는 것도 하나의 방법이다. 만일 그가 싫어한다면 두 사람의 관계는 육체적인 것만 추구하는 단순 연애 상대일 가능성이 있으므로 고려해봐야 할 상황일 것이다. 
성공의 노하우
그래도 그와 결혼을 원한다면 자신의 여성적인 면을 드러내어 보여줄 필요가 있다. 일반적으로 조신한 여성의 전형으로 편안한 가정요리를 만들어 보이거나 너무 까다롭지 않다는 면을 표나지 않게 어필할 필요가 있다. 단순히 생활감이 없어 보이는 것이 그로 하여금 결혼을 의식하지 못하게 할 수도 있다. 그러므로 가능하면 가정적인 면을 보이도록 노력해야 한다.",
"남자 O형과 여자 O형
두 사람은
처음에는 서로의 강한 개성에 관심을 끌지만 서로 비슷한 점이 많아 좀처럼 연애로 발전하기 쉽지 않다. 교제를 시작해도 서로간의 경쟁의식이 먼저 나타나기 때문에 다툼이 자주 일어날 수 있다. 그러나 연령차이가 많이 나거나 목적이 같을 경우에는 잘 꾸려 나갈 수 있을 것이다. 
상대 파악하기
둘 다 자기 주장이 강하기 때문에 가벼운 신체 접촉 등의 방법으로 애정을 오래 유지 시킬 수 있을 것이다. 한번 이 여자이다라고 생각을 하면 망설임 없이 접근하는 스타일로 O형은 아주 정열가 다운 기질이 있다. 그런 만큼 독점욕도 대단하다. 그렇다고 해서 다른 남성을 개입시켜 그의 마음을 잡으려는 시도를 하는 것은 금물이다. 말을 돌려서 한다거나 유치한 방법을 택하는 것은 모처럼의 정열에 좋지 않은 영향을 미칠 수 있다. 감정의 표현이 솔직한 O형에게 효과적인 것은 직접적인 말이나 알기 쉬운 애정 표현이다. 그의 마음을 얻고 싶다면 자신에게 있어서 그는 특별한 존재라는 기분을 느낄 수 있도록 말이나 행동으로 강조해야 한다. 전형적인 O형 남성이 좋아하는 여성상은 성실함이다. 게다가 남성은 남성다워야 하고 여성은 여성스러워야 한다고 생각하기 때문에 그러한 여성에 끌리는 경향이 있다. 특히 마음이 강한 현모양처형이나 개성 있는 밝은 스타일에 약한 면이 있다. O형 여성의 밝은 성격과 넘쳐 나는 개성에 이 남성은 강하게 끌리게 된다. 그로 하여금 여성을 감싸도록 만드는 것이 중요하다. 다른 사람에게 가르치거나 충고하는 것을 좋아하는 O형이지만 반대로 다른 사람에게 가르침을 받는 것은 아주 싫어하는 성격이다. 특히 자기가 자신 있다고 생각하는 분야에 대한 의견을 말할 때는 조심하지 않으면 문제가 크게 발생할 수도 있으니 주의한다. 직접적으로 가르치거나 하는 것이 아니더라도 강압적인 말 투나 설교 같은 어투는 삼가는 것이 좋다. O형은 감정 표현이 직선적이기 때문에 다툼이 있을 경우 걷잡을 수 없을 정도로 커지기 쉽다. 게다가 화가 난 상태에서는 논리적인 것이 통하지 않는다. 하지만 일단 상황이 정리된 후에는 뒤끝이 없으므로 이쪽에서 편하게 다가서면 별 문제 없이 잘 풀어지는 성격이다. 그러나 사과를 하면서 그에게도 약간의 잘못을 인정하게 만들려고 하는 것은 절대 삼가는 것이 좋다. 이성을 잃으면 논리가 통하지 않는 것이 O형이라는 것을 명심 하도록 한다. 서로 가르치고 싶어하는 스타일이므로 경쟁 관계가 되기 쉽다. 싸움은 상당히 과격한 경우가 많고 화해 시간도 꽤 걸리는 편이기 때문에 어느 한쪽이 먼저 사과를 하는 것이 중요하다. O형은 로맨틱하여 표현이 풍부하고 이상적인 이야기를 많이 하는 편이다. 그러한 성격이 가장 잘 드러나는 것이 역시 연애이다. 좋아하는 여성에게는 적극적으로 접근하여 다정한 사랑의 말을 전한다. 그리고 결혼을 원하는 상대이다 라고 생각하면 주저 없이 프로포즈를 한다. 그렇지만 그 반면 현실적으로 판단 하는 경우도 있다. O형에게는 현실적인 면과 로맨틱한 면이 상반되어 공존하고 있기 때문에 상대가 쉽게 넘어올 것 같은 경우에는 단순한 연애상대로 결정하고 사귀는 일도 있다. 하지만 결혼 상대에 대해서는 현실적으로 현모양처형의 여성을 바라게 된다. 그렇기 때문에 그의 마음을 알아보기 위해서 때로는 자연스럽고 정신적인 데이트를 제안해 보는 것도 하나의 방법이다. 만일 그가 싫어한다면 두 사람의 관계는 육체적인 것만 추구하는 단순 연애 상대일 가능성이 있으므로 고려해봐야 할 상황일 것이다. 
성공의 노하우
그래도 그와 결혼을 원한다면 자신의 여성적인 면을 드러내어 보여줄 필요가 있다. 일반적으로 조신한 여성의 전형으로 편안한 가정요리를 만들어 보이거나 너무 까다롭지 않다는 면을 표나지 않게 어필할 필요가 있다. 이런 형의 남성은 로맨틱하고 정열적인 연애를 바라기 때문에 단순히 애인 타입으로 여겨질 수도 있다. 결혼하고 싶다면 손수 요리를 해 어필하도록 한다.",
"남자 O형과 여자 AB형
두 사람은
O형의 남성은 지적이고 신비로운 AB형의 여성에게 동경심을 많이 느끼는 편이다. 하지만 기본 성격의 차이가 있기 때문에 교제가 진행되면서 충돌이 일어날 수도 있는 커플이다. 
상대 파악하기
특히 AB형 여성의 빈정거리는 듯한 행동이 그를 화나게 하는 일이 있으므로 대화 시 사소한 발언에도 주의를 하도록 한다. 그리고 이 커플의 경우는 자신과 성격이 많이 다른 상대방의 행동을 용서하면서 지낼 수 있는 마음가짐이 가장 중요하다. 한번 이 여자이다라고 생각을 하면 망설임 없이 접근하는 스타일로 O형은 아주 정열가 다운 기질이 있다. 그런 만큼 독점욕도 대단하다. 그렇다고 해서 다른 남성을 개입시켜 그의 마음을 잡으려는 시도를 하는 것은 금물이다. 말을 돌려서 한다거나 유치한 방법을 택하는 것은 모처럼의 정열에 좋지 않은 영향을 미칠 수 있다. 감정의 표현이 솔직한 O형에게 효과적인 것은 직접적인 말이나 알기 쉬운 애정 표현이다. 그의 마음을 얻고 싶다면 자신에게 있어서 그는 특별한 존재라는 기분을 느낄 수 있도록 말이나 행동으로 강조해야 한다. 전형적인 O형 남성이 좋아하는 여성상은 성실함이다. 게다가 남성은 남성다워야 하고 여성은 여성스러워야 한다고 생각하기 때문에 그러한 여성에 끌리는 경향이 있다. 특히 마음이 강한 현모양처형이나 개성 있는 밝은 스타일에 약한 면이 있다. 신비스러운 분위기로 그를 쉽게 매료시키게 된다. 그러나 AB형의 무미건조한 면이 로맨틱한 스타일의 O형에게는 받아 들이기 힘든 일이 될 수도 있다. 다른 사람에게 가르치거나 충고하는 것을 좋아하는 O형이지만 반대로 다른 사람에게 가르침을 받는 것은 아주 싫어하는 성격이다. 특히 자기가 자신 있다고 생각하는 분야에 대한 의견을 말할 때는 조심하지 않으면 문제가 크게 발생할 수도 있으니 주의한다. 직접적으로 가르치거나 하는 것이 아니더라도 강압적인 말 투나 설교 같은 어투는 삼가는 것이 좋다. O형은 감정 표현이 직선적이기 때문에 다툼이 있을 경우 걷잡을 수 없을 정도로 커지기 쉽다. 게다가 화가 난 상태에서는 논리적인 것이 통하지 않는다. 하지만 일단 상황이 정리된 후에는 뒤끝이 없으므로 이쪽에서 편하게 다가서면 별 문제 없이 잘 풀어지는 성격이다. 그러나 사과를 하면서 그에게도 약간의 잘못을 인정하게 만들려고 하는 것은 절대 삼가는 것이 좋다. 이성을 잃으면 논리가 통하지 않는 것이 O형이라는 것을 명심 하도록 한다. AB형의 여성은 대범하고 사소한 일에 얽매이지 않는 성격이기 때문에 O형인 그와 충돌하는 경우는 별로 없지만 지나치게 고집을 피우는 것은 좋지 않은 결과를 가져올 수도 있다. O형은 로맨틱하여 표현이 풍부하고 이상적인 이야기를 많이 하는 편이다. 그러한 성격이 가장 잘 드러나는 것이 역시 연애이다. 좋아하는 여성에게는 적극적으로 접근하여 다정한 사랑의 말을 전한다. 그리고 결혼을 원하는 상대이다 라고 생각하면 주저 없이 프로포즈를 한다. 그렇지만 그 반면 현실적으로 판단 하는 경우도 있다. O형에게는 현실적인 면과 로맨틱한 면이 상반되어 공존하고 있기 때문에 상대가 쉽게 넘어올 것 같은 경우에는 단순한 연애상대로 결정하고 사귀는 일도 있다. 하지만 결혼 상대에 대해서는 현실적으로 현모양처형의 여성을 바라게 된다. 그렇기 때문에 그의 마음을 알아보기 위해서 때로는 자연스럽고 정신적인 데이트를 제안해 보는 것도 하나의 방법이다. 만일 그가 싫어한다면 두 사람의 관계는 육체적인 것만 추구하는 단순 연애 상대일 가능성이 있으므로 고려해봐야 할 상황일 것이다. 
성공의 노하우
그래도 그와 결혼을 원한다면 자신의 여성적인 면을 드러내어 보여줄 필요가 있다. 일반적으로 조신한 여성의 전형으로 편안한 가정요리를 만들어 보이거나 너무 까다롭지 않다는 면을 표나지 않게 어필할 필요가 있다. AB형 여성이 생활감이 없어 보이는 것이 그로 하여금 결혼을 의식하지 못하게 할 수도 있다. 그러므로 때때로 가정적인 면을 보이도록 노력해야 한다."),
	array("남자 AB형과 여자 A형
두 사람은
AB형의 남성은 다부진 A형 여성을 귀엽게 느낀다. 그리고 자신이 잘 챙겨줄 거라는 생각으로 사귀기 시작한다. 여성의 입장에서는 마음껏 어리광을 피울 수 있다. 하지만 결과적으로 인간관계에 있어서 순수한 그는 그녀를 지키는데 너무 힘이 들어 관심을 일이나 취미쪽으로 바꿀 수도 있다. 그렇지만 사랑하는 마음이 없어지는 것은 아니기 때문에 걱정할 것은 없다. 
상대 파악하기
그리고 AB형의 남자는 잔소리 하는 것을 좋아하지 않기 때문에 주의하는 것이 좋다. AB형의 사랑은 취미가 같거나 대화가 통하는 친구 관계로부터 시작되는 경우가 많다. 그러므로 AB형은 기본적으로 연애에 대해서는 담백한 편이라서 이성을 잃을 정도로 상대에 푹 빠지거나 우유부단한 연애는 AB형의 철학과는 상반되는 것이다. 그렇기 때문에 아무리 사랑을 하더라도 일정한 거리를 유지하려는 경향이 있다. 여성은 그런 그를 냉정하다고 느끼기 쉽다. 데이트 중에는 귀찮은 행동 등을 피하고 깔끔한 분위기를 만드는 것이 효과적이다. 대화에 있어서도 취미에 관계되는 화제를 꺼내어서 지적인 분위기로 유도하도록 한다. AB형 남성은 현실적인 이야기 혹은 사생활이나 감정적인 문제를 별로 좋아하지 않는 편이고 특히 자기의 사랑을 확인하는 질문 등은 아주 싫어하는 편이다. 대체로 AB형은 자신의 감정을 표현하지 않기 때문에 무리하게 사랑한다는 말을 들으려고 하다가 반대로 기분이 망가져 버릴 수도 있으므로 주의를 하는 것이 좋다. AB형의 남성은 공통적인 화제를 가지고 있는 자신에게 별로 간섭 하는 것을 좋아하지 않고 외모를 중요시하는 사람이 많다. AB형의 남성과 A형 여성은 솔직하면서 부드럽게 교제가 이루어진다. AB형 남성이 A형 여성을 잘 받쳐주는 관계가 유지되면 최고의 커플이 될 수 있다. 통찰력과 분석력이 있는 AB형은 다른 사람의 성격을 파악해서 평가하는 것을 좋아하지만 정작 자신이 평가 받는 것은 싫어하는 스타일이다. 특히 성격적인 것에 대한 말을 들으면 아주 싫어하기 때문에 조심할 필요가 있다. 항상 즐거운 분위기를 유지하기 위해서는 무거운 화제는 피하고 가볍고 부담 없는 대화를 즐기는 것이 바람직한 방법이다. 그리고 AB형은 배신 당하는 것에 아주 민감한 편이다. 가끔은 아주 사소한 오해로 배신 당했다고 느껴 그것의 원인으로 두 사람이 사이가 벌어지는 일도 생긴다. AB형의 남성이 그런 이유 등으로 화가 났을 경우 정에 호소한다고 해도 별 효과가 없다. 감정 문제를 다루는데 서툰 그와 화해를 하기 위해서는 친구 등을 통해 중재를 시키는 것이 보다 효과적이다. AB형은 제3자의 의견에는 냉정하게 귀를 기울인다. 따라서 그의 성격에 대해 비판하는 것은 하지 않는 것이 좋다. 사소한 한마디가 사랑이 깨지는 원인으로 작용할 수 있기 때문이다. 유희적인 분위기를 가진 AB형의 남성은 연애도 스마트한 편이고 데이트 중에 너무 현실적인 주제로 대화 하는 것을 좋아하지 않는다. 그렇기 때문에 구체적인 장래 생활 계획 등을 세우지 않아 결혼에 전혀 관심이 없는 것으로 오해할 수 있다. 
성공의 노하우
AB형은 연애 상대와 결혼 상대를 구분해 사귀는 경향이 있다. 애인 상대에게는 외모를, 배우자에게는 가정 생활의 가능성을 고려하게 된다. 그러므로 내가 주부가 되면 얼마나 잘 할 것 같으냐는 식으로 물어봄으로써 그가 결혼을 인식할 수 있도록 유도 하는 것도 한 방법이 될 수 있다. 이런 경우 평가가 낮게 된다면 데이트 상대로만 남을 지도 모르는 일이다. 그리고 좋게 평가를 받았다고 해도 AB형이 결단을 내리는 데 많이 주저하게 된다는 것이다. 이런 그가 결혼까지 결심하기 위해서는 주위 사람들의 의견이 큰 역할을 하는 경우가 많다. 그의 가족이나 친구들을 자기 편으로 만드는 작전을 세운다. 객관적인 의견을 중시하는 그는 신뢰하는 사람들에게 잘 어울리는 부부가 될 것이라는 소리를 들으면 결혼할 기분이 생기게 된다. 또 노골적으로 자꾸 강조하는 것은 싫어하는 편이지만 어떠한 경우에도 당신편이 되어줄게 라는 사랑의 말에는 크게 감동하게 된다. 적절한 시기에 이러한 말로 그의 결단을 유도하는 것도 하나의 방법이 될 수 있다. A형 여성은 그가 구체적으로 결혼이야기를 꺼내지 않는 것에 대해 불신감이나 섭섭한 감정을 느낄 수도 있지만 그를 진정으로 좋아 한다면 믿고 기다리도록 한다.",
"남자 AB형과 여자 B형
두 사람은
AB형의 남성은 함께 있어도 귀찮게 하지 않고 간섭하지 않는 B형의 여성에게 매력을 느끼는 일이 많다. 대화가 재미있고 흥미롭게 즐거운 데이트를 계속하면 사이 좋은 커플로 발전할 수 있다. 
상대 파악하기
단, B형의 자기 중심적인 성격이 표면에 드러난다면 그의 기분이 상하는 경우도 있으니 주의한다. 그에게 리드를 하도록 하고 여성이 포근히 감싸 안는 입장이 된다면 결혼을 해도 잘 되는 만남이다. AB형의 사랑은 취미가 같거나 대화가 통하는 친구 관계로부터 시작되는 경우가 많다. 그러므로 AB형은 기본적으로 연애에 대해서는 담백한 편이라서 이성을 잃을 정도로 상대에 푹 빠지거나 우유부단한 연애는 AB형의 철학과는 상반되는 것이다. 그렇기 때문에 아무리 사랑을 하더라도 일정한 거리를 유지하려는 경향이 있다. 여성은 그런 그를 냉정하다고 느끼기 쉽다. 데이트 중에는 귀찮은 행동 등을 피하고 깔끔한 분위기를 만드는 것이 효과적이다. 대화에 있어서도 취미에 관계되는 화제를 꺼내어서 지적인 분위기로 유도하도록 한다. AB형 남성은 현실적인 이야기 혹은 사생활이나 감정적인 문제를 별로 좋아하지 않는 편이고 특히 자기의 사랑을 확인하는 질문 등은 아주 싫어하는 편이다. 대체로 AB형은 자신의 감정을 표현하지 않기 때문에 무리하게 사랑한다는 말을 들으려고 하다가 반대로 기분이 망가져 버릴 수도 있으므로 주의를 하는 것이 좋다. AB형의 남성은 공통적인 화제를 가지고 있는 자신에게 별로 간섭 하는 것을 좋아하지 않고 외모를 중요시하는 사람이 많다. B형 여성이 AB형 남성을 잘 보조해 줄 수 있다면 둘의 관계가 잘 될 가능성이 높다. 상대방의 생각을 서로 이해하는 커플로 발전될 수 있다. 통찰력과 분석력이 있는 AB형은 다른 사람의 성격을 파악해서 평가하는 것을 좋아하지만 정작 자신이 평가 받는 것은 싫어하는 스타일이다. 특히 성격적인 것에 대한 말을 들으면 아주 싫어하기 때문에 조심할 필요가 있다. 항상 즐거운 분위기를 유지하기 위해서는 무거운 화제는 피하고 가볍고 부담 없는 대화를 즐기는 것이 바람직한 방법이다. 그리고 AB형은 배신 당하는 것에 아주 민감한 편이다. 가끔은 아주 사소한 오해로 배신 당했다고 느껴 그것의 원인으로 두 사람이 사이가 벌어지는 일도 생긴다. AB형의 남성이 그런 이유 등으로 화가 났을 경우 정에 호소한다고 해도 별 효과가 없다. 감정 문제를 다루는데 서툰 그와 화해를 하기 위해서는 친구 등을 통해 중재를 시키는 것이 보다 효과적이다. AB형은 제3자의 의견에는 냉정하게 귀를 기울인다. B형의 여성은 분석을 좋아하는 AB형의 남성의 성격에 화가 날 수도 있다. 반대로 여성이 너무 자기 주장을 하면 그가 마음 상해 하는 경우가 많다. 그를 세워주면서 지내는 것이 원만한 관계를 유지 시켜주는 좋은 방법이 될 수 있다. 유희적인 분위기를 가진 AB형의 남성은 연애도 스마트한 편이고 데이트 중에 너무 현실적인 주제로 대화 하는 것을 좋아하지 않는다. 그렇기 때문에 구체적인 장래 생활 계획 등을 세우지 않아 결혼에 전혀 관심이 없는 것으로 오해할 수 있다. 
성공의 노하우
AB형은 연애 상대와 결혼 상대를 구분해 사귀는 경향이 있다. 애인 상대에게는 외모를, 배우자에게는 가정 생활의 가능성을 고려하게 된다. 그러므로 내가 주부가 되면 얼마나 잘 할 것 같으냐는 식으로 물어봄으로써 그가 결혼을 인식할 수 있도록 유도 하는 것도 한 방법이 될 수 있다. 이런 경우 평가가 낮게 된다면 데이트 상대로만 남을 지도 모르는 일이다. 그리고 좋게 평가를 받았다고 해도 AB형이 결단을 내리는 데 많이 주저하게 된다는 것이다. 이런 그가 결혼까지 결심하기 위해서는 주위 사람들의 의견이 큰 역할을 하는 경우가 많다. 그의 가족이나 친구들을 자기 편으로 만드는 작전을 세운다. 객관적인 의견을 중시하는 그는 신뢰하는 사람들에게 잘 어울리는 부부가 될 것이라는 소리를 들으면 결혼할 기분이 생기게 된다. 또 노골적으로 자꾸 강조하는 것은 싫어하는 편이지만 어떠한 경우에도 당신편이 되어줄게 라는 사랑의 말에는 크게 감동하게 된다. 적절한 시기에 이러한 말로 그의 결단을 유도하는 것도 하나의 방법이 될 수 있다. AB형의 그를 감싸주는 입장이 되는 것이 중요하다. 그러면 그로 하여금 결혼해서 잘 살 수 있을 것이라는 생각이 들게 할 수 있다.",
"남자 AB형과 여자 O형
두 사람은
연애에 담백한 AB형 남성에게 있어 정열적이고 솔직한 O형 여성은 상대하기 힘든 편이다. 
상대 파악하기
처음에는 서로에게 신선함을 느껴 교제를 시작해도 자주 기분이 엇갈리게 된다. 그에게 드라마틱한 애정표현이나 적극적인 신체 접촉 등은 피하는 것이 좋다. 또 AB형의 냉정한 태도를 보고 O형 여성이 자신을 사랑하고 있지 않다는 오해를 불러 일으키는 수도 있기 때문에 조심하도록 한다. AB형의 사랑은 취미가 같거나 대화가 통하는 친구 관계로부터 시작되는 경우가 많다. 그러므로 AB형은 기본적으로 연애에 대해서는 담백한 편이라서 이성을 잃을 정도로 상대에 푹 빠지거나 우유부단한 연애는 AB형의 철학과는 상반되는 것이다. 그렇기 때문에 아무리 사랑을 하더라도 일정한 거리를 유지하려는 경향이 있다. 여성은 그런 그를 냉정하다고 느끼기 쉽다. 데이트 중에는 귀찮은 행동 등을 피하고 깔끔한 분위기를 만드는 것이 효과적이다. 대화에 있어서도 취미에 관계되는 화제를 꺼내어서 지적인 분위기로 유도하도록 한다. AB형 남성은 현실적인 이야기 혹은 사생활이나 감정적인 문제를 별로 좋아하지 않는 편이고 특히 자기의 사랑을 확인하는 질문 등은 아주 싫어하는 편이다. 대체로 AB형은 자신의 감정을 표현하지 않기 때문에 무리하게 사랑한다는 말을 들으려고 하다가 반대로 기분이 망가져 버릴 수도 있으므로 주의를 하는 것이 좋다. AB형의 남성은 공통적인 화제를 가지고 있는 자신에게 별로 간섭 하는 것을 좋아하지 않고 외모를 중요시하는 사람이 많다. O형 여성의 정열적인 면이 지나치게 드러나면 그가 멀리할 가능성이 높다. 가벼운 신체 접촉이라도 함부로 요구하지 않도록 한다. 통찰력과 분석력이 있는 AB형은 다른 사람의 성격을 파악해서 평가하는 것을 좋아하지만 정작 자신이 평가 받는 것은 싫어하는 스타일이다. 특히 성격적인 것에 대한 말을 들으면 아주 싫어하기 때문에 조심할 필요가 있다. 항상 즐거운 분위기를 유지하기 위해서는 무거운 화제는 피하고 가볍고 부담 없는 대화를 즐기는 것이 바람직한 방법이다. 그리고 AB형은 배신 당하는 것에 아주 민감한 편이다. 가끔은 아주 사소한 오해로 배신 당했다고 느껴 그것의 원인으로 두 사람이 사이가 벌어지는 일도 생긴다. AB형의 남성이 그런 이유 등으로 화가 났을 경우 정에 호소한다고 해도 별 효과가 없다. 감정 문제를 다루는데 서툰 그와 화해를 하기 위해서는 친구 등을 통해 중재를 시키는 것이 보다 효과적이다. AB형은 제3자의 의견에는 냉정하게 귀를 기울인다. O형 여성의 털털한 성격이 오해를 불러 배신 당했다고 생각하는 AB형이기 때문에 사소한 약속이라도 확실히 지키려는 마음가짐을 갖도록 하는 것이 중요하다. 유희적인 분위기를 가진 AB형의 남성은 연애도 스마트한 편이고 데이트 중에 너무 현실적인 주제로 대화 하는 것을 좋아하지 않는다. 그렇기 때문에 구체적인 장래 생활 계획 등을 세우지 않아 결혼에 전혀 관심이 없는 것으로 오해할 수 있다. 
성공의 노하우
AB형은 연애 상대와 결혼 상대를 구분해 사귀는 경향이 있다. 애인 상대에게는 외모를, 배우자에게는 가정 생활의 가능성을 고려하게 된다. 그러므로 내가 주부가 되면 얼마나 잘 할 것 같으냐는 식으로 물어봄으로써 그가 결혼을 인식할 수 있도록 유도 하는 것도 한 방법이 될 수 있다. 이런 경우 평가가 낮게 된다면 데이트 상대로만 남을 지도 모르는 일이다. 그리고 좋게 평가를 받았다고 해도 AB형이 결단을 내리는 데 많이 주저하게 된다는 것이다. 이런 그가 결혼까지 결심하기 위해서는 주위 사람들의 의견이 큰 역할을 하는 경우가 많다. 그의 가족이나 친구들을 자기 편으로 만드는 작전을 세운다. 객관적인 의견을 중시하는 그는 신뢰하는 사람들에게 잘 어울리는 부부가 될 것이라는 소리를 들으면 결혼할 기분이 생기게 된다. 또 노골적으로 자꾸 강조하는 것은 싫어하는 편이지만 어떠한 경우에도 당신편이 되어줄게 라는 사랑의 말에는 크게 감동하게 된다. 적절한 시기에 이러한 말로 그의 결단을 유도하는 것도 하나의 방법이 될 수 있다. 너무 급하게 결혼 이야기를 꺼내는 것을 싫어하는 경우가 많다. 결혼을 앞당기려는 노력이 오히려 역효과를 불러올 수 있으므로 주의하도록 한다.",
"남자 AB형과 여자 AB형
두 사람은
서로의 리듬이 꼭 맞는 아주 좋은 커플이다. 
상대 파악하기
그러나 무미건조한 부분이 있는 AB형 커플이 서로 거리낌 없는 사이가 되면 불쾌한 일이 발생하고 말다툼이 자주 일어난다. 그 때문에 대체로 깊은 관계로 발전하기 쉽지 않다. 두 사람의 친밀도를 높이려면 같은 취미를 가지는 것이 최고다. 취미가 통하면서 나눌 수 있는 지적인 대화가 두 사람을 연결시켜 준다. 교제를 보다 오래 하기 위해서는 서로 서로를 간섭하지 않아야 한다. AB형은 기본적으로 연애에 대해서는 담백한 편이라서 이성을 잃을 정도로 상대에 푹 빠지거나 우유부단한 연애는 AB형의 철학과는 상반되는 것이다. 그렇기 때문에 아무리 사랑을 하더라도 일정한 거리를 유지하려는 경향이 있다. 여성은 그런 그를 냉정하다고 느끼기 쉽다. 데이트 중에는 귀찮은 행동 등을 피하고 깔끔한 분위기를 만드는 것이 효과적이다. 대화에 있어서도 취미에 관계되는 화제를 꺼내어서 지적인 분위기로 유도하도록 한다. AB형 남성은 현실적인 이야기 혹은 사생활이나 감정적인 문제를 별로 좋아하지 않는 편이고 특히 자기의 사랑을 확인하는 질문 등은 아주 싫어하는 편이다. 대체로 AB형은 자신의 감정을 표현하지 않기 때문에 무리하게 사랑한다는 말을 들으려고 하다가 반대로 기분이 망가져 버릴 수도 있으므로 주의를 하는 것이 좋다. AB형의 남성은 공통적인 화제를 가지고 있는 자신에게 별로 간섭 하는 것을 좋아하지 않고 외모를 중요시하는 사람이 많다. 그와는 좀처럼 연애관계로 발전하기 어렵다. 일이나 지적인 대화를 통해서 서로 친밀감을 키워 나가는 것이 중요하다. 통찰력과 분석력이 있는 AB형은 다른 사람의 성격을 파악해서 평가하는 것을 좋아하지만 정작 자신이 평가 받는 것은 싫어하는 스타일이다. 특히 성격적인 것에 대한 말을 들으면 아주 싫어하기 때문에 조심할 필요가 있다. 항상 즐거운 분위기를 유지하기 위해서는 무거운 화제는 피하고 가볍고 부담 없는 대화를 즐기는 것이 바람직한 방법이다. 그리고 AB형은 배신 당하는 것에 아주 민감한 편이다. 가끔은 아주 사소한 오해로 배신 당했다고 느껴 그것의 원인으로 두 사람이 사이가 벌어지는 일도 생긴다. AB형의 남성이 그런 이유 등으로 화가 났을 경우 정에 호소한다고 해도 별 효과가 없다. 감정 문제를 다루는데 서툰 그와 화해를 하기 위해서는 친구 등을 통해 중재를 시키는 것이 보다 효과적이다. AB형은 제3자의 의견에는 냉정하게 귀를 기울인다. AB형의 남성과 AB형의 여성은 서로 비판을 하는 혹독한 커플이다. 그러나 그렇게 험악한 분위기는 아니다. 반면 싸움이 일어나면 반드시 중재자가 필요할 정도로 심한 경우가 있다. 유희적인 분위기를 가진 AB형의 남성은 연애도 스마트한 편이고 데이트 중에 너무 현실적인 주제로 대화 하는 것을 좋아하지 않는다. 그렇기 때문에 구체적인 장래 생활 계획 등을 세우지 않아 결혼에 전혀 관심이 없는 것으로 오해할 수 있다. 
성공의 노하우
AB형은 연애 상대와 결혼 상대를 구분해 사귀는 경향이 있다. 애인 상대에게는 외모를, 배우자에게는 가정 생활의 가능성을 고려하게 된다. 그러므로 내가 주부가 되면 얼마나 잘 할 것 같으냐는 식으로 물어봄으로써 그가 결혼을 인식할 수 있도록 유도 하는 것도 한 방법이 될 수 있다. 이런 경우 평가가 낮게 된다면 데이트 상대로만 남을 지도 모르는 일이다. 그리고 좋게 평가를 받았다고 해도 AB형이 결단을 내리는 데 많이 주저하게 된다는 것이다. 이런 그가 결혼까지 결심하기 위해서는 주위 사람들의 의견이 큰 역할을 하는 경우가 많다. 그의 가족이나 친구들을 자기 편으로 만드는 작전을 세운다. 객관적인 의견을 중시하는 그는 신뢰하는 사람들에게 잘 어울리는 부부가 될 것이라는 소리를 들으면 결혼할 기분이 생기게 된다. 또 노골적으로 자꾸 강조하는 것은 싫어하는 편이지만 어떠한 경우에도 당신편이 되어줄게 라는 사랑의 말에는 크게 감동하게 된다. 적절한 시기에 이러한 말로 그의 결단을 유도하는 것도 하나의 방법이 될 수 있다. 둘 사이를 연결해 주는 중재자 같은 사람이 있으면 결혼도 무리 없이 진행된다. 또한 목적이 같다면 더욱 강하게 연결될 수 있다.")
);

$arrGHStar = array(
	array(1,6,3,2,1,5,3,7,0,2,4,6),
	array(2,1,7,4,5,1,6,6,7,0,7,3),
	array(4,7,1,7,4,6,0,5,3,2,0,7),
	array(6,4,2,1,6,4,5,0,7,3,7,0),
	array(1,6,3,7,0,5,3,5,1,2,6,7),
	array(4,0,2,3,5,1,5,4,6,0,7,3),
	array(4,5,0,6,4,2,0,6,3,2,1,5),
	array(6,3,5,1,2,3,2,1,7,3,5,0),
	array(1,2,3,7,0,5,3,7,1,2,4,6),
	array(5,0,6,3,4,0,6,4,2,1,5,3),
	array(4,2,0,7,4,5,1,2,3,6,0,7),
	array(2,4,2,0,4,6,5,1,5,4,7,1)	
);

$arrGHStarPoint = array(100,90,80,70,60,50,40,30);

$arrGHStarText = array(
"누구나 부러워하는 우주 최고, 최상의 궁합! 

연애 타입이나 가치관이 비슷한 두 사람은 세세함 부분까지 근본적으로 일치해 최고의 궁합을 자랑한다. 약간의 말다툼이나 싸움이 있어도 서로를 더욱 깊이 이해하고 더욱 가까워지는 결과를 가져온다. 특별히 표현하지 않아도 서로를 잘 알고 말하지 않아도 상대의 생각을 읽기 때문에 서로 너무나 편안하다. 단, 행복에 젖어 그 고마움을 잊기 쉬운 두 사람은 이런 행복이 무료하다고 생각할 수도 있다. 변화나 자극을 원해 간혹 바람을 피우는 사람도 있다. 물론 이런 행동은 천국에서 지옥으로 향하는 지름길이다.",
"닮아서 나도 모르게 끌리는 사이

너무 닮은 두 사람은 사랑을 표현하고 속삭이는 법, 행동하는 법 등이 모두 일치한다. 그래서 아주 친근하다. 의견 일치를 볼 때면 그 어떤 커플보다 죽이 척척 맞는다. 하지만 비슷한 면이 너무 많아 결점이나 약점, 서투른 면까지 같은 것이 가장 큰 문제다. 트러블이 생겼을 때 처음에는 서로 협력해 잘 해결해 나가려고 하지만 서로의 단점이 같아 결국 서로 상처만 받을 수 있다. 또한 너무 편해서 함부로 대하게 될 때가 많으니 주의할 것. 기본적인 예의를 갖추고 관계를 맺는 것이 중요하다.",
"닮았지만 너무 다른 내면이 문제

닮은 것 같지만 사실은 닮지 않은 커플. 겉으로 드러나는 행동이나 스타일, 좋아하는 타입 등이 비슷해 너무 잘 맞는다고 느끼지만 만날수록 다른 점을 확인하고 힘들어한다. 내면은 전혀 다른 두 사람이기 때문에 의견이 부딪히고 자기 주장이 강해지면서 주도권 싸움도 잦고 점점 불만이 쌓이게 된다. 게다가 ‘과거에는 이러지 않았는데’라는 강생각이 서로를 더욱 힘들게 만든다. 이 커플에게는 양보와 이해심이 더 많이 요구되며 상대와 나는 같을 수 없다는 것을 인정해야 원만한 관계가 유지된다.",
"여성이 리드, 공주 대접을 받는 커플

남자가 여자에게 반해 있는 상태. 여자가 무슨 행동을 해도 나무라지 못하고 넋을 놓고 바라보는 관계다. 여자가 나쁘다는 것을 알고 있으면서도 남자는 ‘내가 고치면 된다’라고 생각한다. 이유야 어쨌거나 안정적인 관계를 유지할 수 있는 커플이다. 여자도 남자가 공주 대접을 해주기 때문에 그의 품에서 편안하게 쉴 수 있다. 단, 두 사람 사이가 깊어질수록 남자가 상처를 많이 받는다. 여자의 기분에 따라 최상의 커플 혹은 최악의 커플이 될 수 있다.",
"남자가 이끌어가는 안정적인 커플

남자가 은근히 리드하고 여자가 내조를 하는 식으로 역할 분담이 확실하다. 남들이 보기에는 남자가 보수적이고 가부장적인 성격이 강하게 보일 수도 있지만 여자의 성향도 이끄는 대로 따르는 것을 원하기에 매우 안정적인 커플이다. 간혹 여자가 마음을 다치거나 답답해할 수 있지만 남자가 포용력이 크다면 크게 문제되지 않는다. 여자가 가끔 부리는 투정을 웃으며 받아줄 수 있는 사이라면 오케이. 물론 여자의 말에 귀 기울여주며 대화가 가능한 상태여야 여자의 스트레스를 줄여줄 수 있다. 슬기롭게 대처하지 못하면 여자는 잔소리꾼으로 전락하게 된다. ",
"서로의 다른 점에 끌리는 커플

둘 다 자신에게 없는 매력에 끌려 상대방에게 관심을 갖는다. 다르기 때문에 생길 수 있는 트러블만 방지하면 성격이 비슷한 커플보다 훨씬 이상적이다. 다른 점에 매력을 느끼는 사람들은 사귀는 시간이 길어질수록 그것이 단점으로 느껴져 받아들일 수 없게 되는 것이 가장 큰 문제점이다. 터프한 매력에 빠졌는데 이기적인 사람으로 느껴지거나, 과묵한 게 좋았는데 재미없는 사람으로 느껴지기 쉽다. 이를 극복하지 못하면 시간이 흐를수록 불행해질 뿐이다. 처음 그에게 관심을 가진 이유가 자신과 다르다는 것이었다는 것을 인정해야 좋은 관계를 유지할 수 있다.",
"서로 모자란 부분을 채워주는 사이

겉으로 보기에는 정반대의 타입. 서로의 가치관이 다르기 때문에 끈끈한 정은 없을 수도 있다. 그러나 자신이 가지지 못한 것을 상대방에게서 발견하고 배우고자 하는 욕심이 생기고 서로의 능력을 상호 보완하여 매우 이상적인 커플이 될 수 있다. 서로의 결점을 보충하고 단점이 보여도 서로가 다르다는 것은 인정하고 시작한 커플이라 큰 트러블은 없다. 단, 사고방식이 달라 어떤 일에 상처를 받는지 어떻게 위로하면 좋을지 모르는 경향이 있다. 어쭙잖은 말로 상대를 위로하면 더 깊은 상처를 만들게 되니 차분히 지켜보는 것이 좋다. ",
"모든 것이 맞지 않는 최악의 궁합

물과 기름 같은 관계. 맞는 부분이 전혀 없다. 사랑에 빠지는 것 자체가 기적이다. 두 사람이 서로에게 호감을 느꼈다면 그것은 호기심에 가깝다. 또한 타이밍이나 분위기 탓에 정신적인 면보다 몸이 먼저 끌렸을 수도 있다. 기본 성향부터 성격이나 가치관까지 모두 다르다. 상대방의 행동을 전혀 이해할 수 없고 만남의 시간이 길어질수록 서로 상처만 주고 사태를 더욱 악화시킨다. 섹스를 나누는 사이가 되었을 때, 강렬한 자극은 될 수 있어도 속 궁합은 전혀 맞지 않는다. 결혼을 생각한다면 많은 노력이 필요하다."

);

?>