<?
/*############################################################################################################
사주 정보
##############################################################################################################*/
$Saju_Chon = array("을", "병", "정", "무", "기", "경", "신", "임", "계", "갑");
$Saju_Gigi = array( "미", "신", "유", "술", "해", "자", "축", "인", "묘", "진", "사", "오" );
$Saju_ChonHan = array("乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸", "甲");

//***
$Saju_GigiHan = array( "未", "申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰", "巳", "午", "無" );

$Saju_GunGi = array("생", "욕", "대", "관", "왕", "쇠", "병", "사", "묘", "절", "태", "양");
$Saju_GunGi2 = array("양", "태", "절",  "묘","사",  "병", "쇠",  "왕",  "관", "대", "욕", "생");
$Saju_GunGiHan = array("生", "浴", "帶", "官", "旺", "衰", "病", "死", "墓", "絶", "胎", "養");
$Saju_GunGi2Han = array("養", "胎", "絶", "墓", "死", "病", "衰", "旺", "官", "帶", "浴", "生");
$Saju_ShinSal = array("겁살", "재살", "천살", "지살", "년살", "월살", "망신", "장성", "반안", "역마", "육해", "화개");
$Saju_ShinSalHan = array("劫殺", "災殺", "天殺", "地殺", "年殺", "月殺", "亡神", "將星", "攀鞍", "驛馬", "六害", "華蓋");
$Saju_6Chin = array("비견", "겁재", "식신", "상관", "편인", "인수", "편재", "정재", "편관", "정관");
$Saju_6ChinHan = array("比肩", "劫財", "食身", "傷官", "偏印", "印綏", "偏財", "正財", "偏官", "正官");
$Saju_OHang = array("목", "화", "토", "금", "수", "무");
$Saju_OHangHan = array( "木", "火", "土", "金", "水", "無");

//세운정보
$Saju_SaeUn = array(3,5,7,9,1,3,5,7,9,1);

/*############################################################################################################
육친 정보
##############################################################################################################*/
$Saju_6ChinChon0 = array( 0,9,8,7,6,5,4,3,2,1 );  //을
$Saju_6ChinChon1 = array( 3,0,1,8,9,6,7,4,5,2 );  //병
$Saju_6ChinChon2 = array( 2,1,0,9,8,7,6,5,4,3 );  //정
$Saju_6ChinChon3 = array( 5,2,3,0,1,8,9,6,7,4 );  //무
$Saju_6ChinChon4 = array( 4,3,2,1,0,9,8,7,6,5 );  //기
$Saju_6ChinChon5 = array( 7,5,4,2,3,0,1,8,9,6 );  //경
$Saju_6ChinChon6 = array( 6,5,4,3,2,1,0,9,8,7 );  //신
$Saju_6ChinChon7 = array( 9,6,7,4,5,2,3,0,1,8 );  //임
$Saju_6ChinChon8 = array( 8,7,6,5,4,3,2,1,0,9 );  //계
$Saju_6ChinChon9 = array( 1,8,9,6,7,4,5,2,3,0 );  //갑


$Saju_6ChinChon = array($Saju_6ChinChon0, $Saju_6ChinChon1, $Saju_6ChinChon2, $Saju_6ChinChon3, $Saju_6ChinChon4, $Saju_6ChinChon5, $Saju_6ChinChon6, $Saju_6ChinChon7, $Saju_6ChinChon8, $Saju_6ChinChon9);

//Saju_6ChinGG[일일천간번호][해당지지번호] = 해당 6친 번호가 나옴
$Saju_6ChinGG0 = array( 6,5,4,7,3,2,6,1,0,7,9,8 );  //을
$Saju_6ChinGG1 = array( 9,6,7,8,4,5,9,2,3,8,0,1 );  //병
$Saju_6ChinGG2 = array( 8,7,6,9,5,4,8,3,2,9,1,0 );  //정
$Saju_6ChinGG3 = array( 1,8,9,0,6,7,1,4,5,0,2,3 );  //무
$Saju_6ChinGG4 = array( 0,9,8,1,7,6,0,5,4,1,3,2 );  //기
$Saju_6ChinGG5 = array( 3,0,1,2,8,9,3,6,7,2,4,5 );  //경
$Saju_6ChinGG6 = array( 2,1,0,3,9,8,2,7,6,3,5,4 );  //신
$Saju_6ChinGG7 = array( 5,2,3,4,0,1,5,8,9,4,6,7 );  //임
$Saju_6ChinGG8 = array( 4,3,2,5,1,0,4,9,8,5,7,6 );  //계
$Saju_6ChinGG9 = array( 7,4,5,6,2,3,7,0,1,6,8,9 );  //갑

$Saju_6ChinGG = array($Saju_6ChinGG0, $Saju_6ChinGG1, $Saju_6ChinGG2, $Saju_6ChinGG3, $Saju_6ChinGG4, $Saju_6ChinGG5, $Saju_6ChinGG6, $Saju_6ChinGG7, $Saju_6ChinGG8, $Saju_6ChinGG9);


/*############################################################################################################
합.. 정보..
##############################################################################################################*/		
//천간의 숫자를 보냈을때..
function HapChon($v){
	switch($v){

		case 9:
			$dap = 4;   // 다른 천간의 수
			$dap2 = 2;			// 해당 오행의 수
			break;
		case 0:
			$dap = 5;   // 다른 천간의 수
			$dap2 = 3;			// 해당 오행의 수
			break;
		case 1:
			$dap = 6;   // 다른 천간의 수
			$dap2 = 4;			// 해당 오행의 수
			break;
		case 2:
			$dap = 7;   // 다른 천간의 수
			$dap2 = 0;			// 해당 오행의 수
			break;
		case 3:
			$dap = 8;   // 다른 천간의 수
			$dap2 = 1;			// 해당 오행의 수
			break;
		case 4:
			$dap = 9;   // 다른 천간의 수
			$dap2 = 2;			// 해당 오행의 수
			break;
		case 5:
			$dap = 0;   // 다른 천간의 수
			$dap2 = 3;			// 해당 오행의 수
			break;
		case 6:
			$dap = 1;   // 다른 천간의 수
			$dap2 = 4;			// 해당 오행의 수
			break;
		case 7:
			$dap = 2;   // 다른 천간의 수
			$dap2 = 0;			// 해당 오행의 수
			break;
		case 8:
			$dap = 3;   // 다른 천간의 수
			$dap2 = 1;			// 해당 오행의 수
			break;

	}

	return array($dap, $dap2);
}

//지지의 숫자를 보냈을때..
function HapGG($v){
	switch($v){
		case 0:
			$dap = 11;   // 다른 천간의 수
			$dap2 = 5;			// 해당 오행의 수
			break;
		case 1:
			$dap = 10;   // 다른 천간의 수
			$dap2 = 4;			// 해당 오행의 수
			break;
		case 2:
			$dap = 9;   // 다른 천간의 수
			$dap2 = 3;			// 해당 오행의 수
			break;
		case 3:
			$dap = 8;   // 다른 천간의 수
			$dap2 = 1;			// 해당 오행의 수
			break;
		case 4:
			$dap = 7;   // 다른 천간의 수
			$dap2 = 0;			// 해당 오행의 수
			break;
		case 5:
			$dap = 6;   // 다른 천간의 수
			$dap2 = 2;			// 해당 오행의 수
			break;
		case 6:
			$dap = 5;   // 다른 천간의 수
			$dap2 = 2;			// 해당 오행의 수
			break;
		case 7:
			$dap = 4;   // 다른 천간의 수
			$dap2 = 0;			// 해당 오행의 수
			break;
		case 8:
			$dap = 3;   // 다른 천간의 수
			$dap2 = 1;			// 해당 오행의 수
			break;
		case 9:
			$dap = 2;   // 다른 천간의 수
			$dap2 = 3;			// 해당 오행의 수
			break;
		case 10:
			$dap = 1;   // 다른 천간의 수
			$dap2 = 4;			// 해당 오행의 수
			break;
		case 11:
			$dap = 0;   // 다른 천간의 수
			$dap2 = 5;			// 해당 오행의 수
			break;

	}

	return array($dap, $dap2);
}


/*############################################################################################################
삼합에 대한 정보
##############################################################################################################*/
//지지의 숫자를 보냈을때..
function SamHapGG($v){
	switch($v){
	// 未 일때..
		case 0:
			$dap = 4;   // 다른 지지의 수1
			$dap2 = 8;			// 다른 지지의 수2
			$dap3 = 0;	//오행의 수
			break;
	
	// 申 일때..
		case 1:
			$dap = 5;   // 다른 지지의 수1
			$dap2 = 9;			// 다른 지지의 수2
			$dap3 = 4;	//오행의 수
			break;

	// 酉 일때..
		case 2:
			$dap = 6;   // 다른 지지의 수1
			$dap2 = 10;			// 다른 지지의 수2
			$dap3 = 3;	//오행의 수
			break;
	// 戌 일때..
		case 3:
			$dap = 7;   // 다른 지지의 수1
			$dap2 = 11;			// 다른 지지의 수2
			$dap3 = 1;	//오행의 수
			break;
	//亥 일때..
		case 4:
			$dap = 0;   // 다른 지지의 수1
			$dap2 = 8;			// 다른 지지의 수2
			$dap3 = 0;	//오행의 수
			break;
		// 子 일때..
		case 5:
			$dap = 1;   // 다른 지지의 수1
			$dap2 = 9;			// 다른 지지의 수2
			$dap3 = 4;	//오행의 수
			break;
		//丑 일때..
		case 6:
			$dap = 2;   // 다른 지지의 수1
			$dap2 = 10;			// 다른 지지의 수2
			$dap3 = 3;	//오행의 수
			break;
		//寅 일때..
		case 7:
			$dap = 3;   // 다른 지지의 수1
			$dap2 = 11;			// 다른 지지의 수2
			$dap3 = 1;	//오행의 수
			break;
		//卯 일..
		case 8:
			$dap = 0;   // 다른 지지의 수1
			$dap2 = 4;			// 다른 지지의 수2
			$dap3 = 0;	//오행의 수
			break;
		//辰 일때..
		case 9:
			$dap = 1;   // 다른 지지의 수1
			$dap2 = 5;			// 다른 지지의 수2
			$dap3 = 4;	//오행의 수
			break;
		//巳 일때..
		case 10:
			$dap = 2;   // 다른 지지의 수1
			$dap2 = 6;			// 다른 지지의 수2
			$dap3 = 3;	//오행의 수
			break;
		//午 일때..
		case 11:
			$dap = 3;   // 다른 지지의 수1
			$dap2 = 7;			// 다른 지지의 수2
			$dap3 = 1;	//오행의 수
			break;

	}

	return array($dap, $dap2, $dap3);
}

/*############################################################################################################
충.. 정보..
##############################################################################################################*/		
//천간의 숫자를 보냈을때..
function ChoongChon($v){
	switch($v){
		//甲 일때..
		case 9:
			$dap = 5;   // 다른 천간의 수
			break;
		//乙일때...
		case 0:
			$dap = 6;   // 다른 천간의 수
			break;
		//丙 일때..
		case 1:
			$dap = 7;   // 다른 천간의 수
			break;
		//丁일때..
		case 2:
			$dap = 8;   // 다른 천간의 수
			break;
		//戊일때..
		case 3:
			$dap = 9;   // 다른 천간의 수
			break;
		//己일때..
		case 4:
			$dap = 0;   // 다른 천간의 수
			break;
		//庚일때..
		case 5:
			$dap = 1;   // 다른 천간의 수
			break;
		//辛일때..
		case 6:
			$dap = 2;   // 다른 천간의 수
			break;
		//壬일때..
		case 7:
			$dap = 3;   // 다른 천간의 수
			break;
		//癸일때..
		case 8:
			$dap = 4;   // 다른 천간의 수
			break;

	}

	return $dap;
}

//지지의 숫자를 보냈을때..
function ChoongGG($v){
	switch($v){
	// 未 일때..
		case 0:
			$dap = 6;   // 다른 지지의 수1
			break;
	
	// 申 일때..
		case 1:
			$dap = 7;   // 다른 지지의 수1
			break;

	// 酉 일때..
		case 2:
			$dap = 8;   // 다른 지지의 수1
			break;
	// 戌 일때..
		case 3:
			$dap = 9;   // 다른 지지의 수1
			break;
	//亥 일때..
		case 4:
			$dap = 10;   // 다른 지지의 수1
			break;
		// 子 일때..
		case 5:
			$dap = 11;   // 다른 지지의 수1
			break;
		//丑 일때..
		case 6:
			$dap = 0;   // 다른 지지의 수1
			break;
		//寅 일때..
		case 7:
			$dap = 1;   // 다른 지지의 수1
			break;
		//卯 일..
		case 8:
			$dap = 2;   // 다른 지지의 수1
			break;
		//辰 일때..
		case 9:
			$dap = 3;   // 다른 지지의 수1
			break;
		//巳 일때..
		case 10:
			$dap = 4;   // 다른 지지의 수1
			break;
		//午 일때..
		case 11:
			$dap = 5;   // 다른 지지의 수1
			break;

	}

	return $dap;
}


/*############################################################################################################
파.. 정보..
##############################################################################################################*/		
//지지의 숫자를 보냈을때..
function PaGG($v){
	switch($v){
	// 未 일때..
		case 0:
			$dap = 3;   // 다른 지지의 수1
			break;
	
	// 申 일때..
		case 1:
			$dap = 10;   // 다른 지지의 수1
			break;

	// 酉 일때..
		case 2:
			$dap = 5;   // 다른 지지의 수1
			break;
	// 戌 일때..
		case 3:
			$dap = 0;   // 다른 지지의 수1
			break;
	//亥 일때..
		case 4:
			$dap = 7;   // 다른 지지의 수1
			break;
		// 子 일때..
		case 5:
			$dap = 2;   // 다른 지지의 수1
			break;
		//丑 일때..
		case 6:
			$dap = 9;   // 다른 지지의 수1
			break;
		//寅 일때..
		case 7:
			$dap = 4;   // 다른 지지의 수1
			break;
		//卯 일..
		case 8:
			$dap = 11;   // 다른 지지의 수1
			break;
		//辰 일때..
		case 9:
			$dap = 6;   // 다른 지지의 수1
			break;
		//巳 일때..
		case 10:
			$dap = 1;   // 다른 지지의 수1
			break;
		//午 일때..
		case 11:
			$dap = 8;   // 다른 지지의 수1
			break;

	}

	return $dap;
}

/*############################################################################################################
해.. 정보..
##############################################################################################################*/		
//지지의 숫자를 보냈을때..
function HaeGG($v){
	switch($v){
	// 未 일때..
		case 0:
			$dap = 5;   // 다른 지지의 수1
			break;
	
	// 申 일때..
		case 1:
			$dap = 4;   // 다른 지지의 수1
			break;

	// 酉 일때..
		case 2:
			$dap = 3;   // 다른 지지의 수1
			break;
	// 戌 일때..
		case 3:
			$dap = 2;   // 다른 지지의 수1
			break;
	//亥 일때..
		case 4:
			$dap = 1;   // 다른 지지의 수1
			break;
		// 子 일때..
		case 5:
			$dap = 0;   // 다른 지지의 수1
			break;
		//丑 일때..
		case 6:
			$dap = 11;   // 다른 지지의 수1
			break;
		//寅 일때..
		case 7:
			$dap = 10;   // 다른 지지의 수1
			break;
		//卯 일..
		case 8:
			$dap = 9;   // 다른 지지의 수1
			break;
		//辰 일때..
		case 9:
			$dap = 8;   // 다른 지지의 수1
			break;
		//巳 일때..
		case 10:
			$dap = 7;   // 다른 지지의 수1
			break;
		//午 일때..
		case 11:
			$dap = 6;   // 다른 지지의 수1
			break;

	}

	return $dap;
}



/*############################################################################################################
형.. 정보..
##############################################################################################################*/		
//지지의 숫자를 보냈을때..
function HyeongGG($v){
		if ($v==5){
			$dap = 8;
		}else if($v==8){
			$dap = 5;
		}else{
			$dap = 12;
		}

	return $dap;
}


/*############################################################################################################
삼형.. 정보..
##############################################################################################################*/		

//지지의 숫자를 보냈을때..
function SamHyeongGG($v){
	
		if ($v==7){
			$dap = "巳申";
		}else if($v==1){
			$dap = "巳寅";
		}else if($v==10){
			$dap = "申寅";
		}else if($v==6){
			$dap = "戌未";
		}else if($v==3){
			$dap = "未丑";
		}else if($v==0){
			$dap = "丑戌";

		}else{
			$dap = "無";
		}

	return $dap;
}

/*############################################################################################################
자형.. 정보..
##############################################################################################################*/		
//지지의 숫자를 보냈을때..
function JaHyeongGG($v){
		if ($v==9 || $v==11 || $v==2 || $v==4){
			$dap = $v;
		}else{
			$dap = 12;
		}

	return $dap;
}


/*############################################################################################################
원진.. 정보..
##############################################################################################################*/		
//지지의 숫자를 보냈을때..
function WonJinGG($v){
	switch($v){
	// 未 일때..
		case 0:
			$dap = 5;   // 다른 지지의 수1
			break;
	
	// 申 일때..
		case 1:
			$dap = 8;   // 다른 지지의 수1
			break;

	// 酉 일때..
		case 2:
			$dap = 7;   // 다른 지지의 수1
			break;
	// 戌 일때..
		case 3:
			$dap = 10;   // 다른 지지의 수1
			break;
	//亥 일때..
		case 4:
			$dap = 9;   // 다른 지지의 수1
			break;
		// 子 일때..
		case 5:
			$dap = 0;   // 다른 지지의 수1
			break;
		//丑 일때..
		case 6:
			$dap = 11;   // 다른 지지의 수1
			break;
		//寅 일때..
		case 7:
			$dap = 2;   // 다른 지지의 수1
			break;
		//卯 일..
		case 8:
			$dap = 1;   // 다른 지지의 수1
			break;
		//辰 일때..
		case 9:
			$dap = 4;   // 다른 지지의 수1
			break;
		//巳 일때..
		case 10:
			$dap = 3;   // 다른 지지의 수1
			break;
		//午 일때..
		case 11:
			$dap = 6;   // 다른 지지의 수1
			break;

	}

	return $dap;
}



/*############################################################################################################
공망 정보
##############################################################################################################*/
//Saju_GongMang[일일천간번호][해당천간번호] = 해당 6친 번호가 나옴
//공망표를 배열로서 구성
$Saju_GongMang0 = array( 9,20,11,20,1,20,3,20,5,20,7,20 );   //을일때..
$Saju_GongMang1 = array( 20,9,20,11,20,1,20,3,20,5,20,7 );   //병일때..
$Saju_GongMang2 = array( 7,20,9,20,11,20,1,20,3,20,5,20 );   //정일때..
$Saju_GongMang3 = array( 20,7,20,9,20,11,20,1,20,3,20,5 );   //무일때..
$Saju_GongMang4 = array( 5,20,7,20,9,20,11,20,1,20,3,20 );   //기일때..
$Saju_GongMang5 = array( 20,5,20,7,20,9,20,11,20,1,20,3 );   //경일때..
$Saju_GongMang6 = array( 3,20,5,20,7,20,9,20,11,20,1,20 );   //신일때..
$Saju_GongMang7 = array( 20,3,20,5,20,7,20,9,20,11,20,1 );   //임일때..
$Saju_GongMang8 = array( 1,20,3,20,5,20,7,20,9,20,11,20 );   //계일때..
$Saju_GongMang9 = array( 20,11,20,1,20,3,20,5,20,7,20,9 );   //갑일때..
$Saju_GongMang = array($Saju_GongMang0,$Saju_GongMang1,$Saju_GongMang2,$Saju_GongMang3,$Saju_GongMang4,$Saju_GongMang5,$Saju_GongMang6,$Saju_GongMang7,$Saju_GongMang8,$Saju_GongMang9);

//공망인지 아닌지를 비교..
//$v 해당공망, $v2 지지
function GongMangYN($v, $v2){
	$temp = ($v + 1) % 12;
	$dap = "無";
	if (($v == $v2) || ($temp == $v2)){
		$dap = "有";				
	}
	
	return $dap;
}


/*############################################################################################################
지장간 정보
##############################################################################################################*/

	function GiJangGan($v){
	switch($v){

		case 7:

			$g1 = "戊";
			$g2 = "丙";
			$g3 = "甲";

			break;
		case 8:

			$g1 = "甲";
			$g2 = "乙";
			$g3 = "";

			break;

		case 9:

			$g1 = "乙";
			$g2 = "癸";
			$g3 = "戊";

			break;

		case 10:

			$g1 = "戊";
			$g2 = "庚";
			$g3 = "丙";

			break;
		case 11:

			$g1 = "丙";
			$g2 = "己";
			$g3 = "丁";

			break;

		case 0:	

			$g1 = "丁";
			$g2 = "乙";
			$g3 = "己";

			break;
		case 1:

			$g1 = "戊";
			$g2 = "壬";
			$g3 = "庚";

			break;
		
		case 2:

			$g1 = "庚";
			$g2 = "辛";
			$g3 = "";

			break;

		case 3:	

			$g1 = "辛";
			$g2 = "丁";
			$g3 = "戊";

			break;				

		case 4:

			$g1 = "戊";
			$g2 = "甲";
			$g3 = "壬";

			break;
		case 5:

			$g1 = "壬";
			$g2 = "癸";
			$g3 = "";

			break;


		case 6:	

			$g1 = "癸";
			$g2 = "辛";
			$g3 = "己";

			break;				

	}

	return array($g1,$g2,$g3);
}

/*############################################################################################################
##############################################################################################################*/

//예제.. 밑에 표시할때 쓰임..
$Saju_GGG = array("子", "丑", "寅", "卯", "辰", "巳", "午" ,"未", "申", "酉", "戌", "亥");

//오행을 알아낸다.천간으로
function What5hangC($v){
	switch($v){
	//갑을일때
		case 0:
		case 9:
			$r = "목";
			$rh = "木";
			break;
	//병정일때
		case 1:
		case 2:
			$r = "화";
			$rh = "火";
			break;
	//무기일때
		case 3:
		case 4:
			$r = "토";
			$rh = "土";
			break;
	//경신일때
		case 5:
		case 6:
			$r = "금";
			$rh = "金";
			break;
	//임계일때
		case 7:
		case 8:
			$r = "수";
			$rh = "水";
			break;
	}
	//(오행한글, 오행한자)
	return array($r,$rh);
}

//오행을 알아낸다. 지지로
function What5hangG($v){
	switch($v){
	//인묘일때
		case 7:
		case 8:
			$r = "목";
			$rh = "木";
			break;
	//사오일때
		case 10:
		case 11:
			$r = "화";
			$rh = "火";
			break;
	//미,술,축,진일때
		case 0:	case 3:	case 6:	case 9:
			$r = "토";
			$rh = "土";
			break;
	//신유일때
		case 1:
		case 2:
			$r = "금";
			$rh = "金";
			break;
	//해자일때
		case 4:
		case 5:
			$r = "수";
			$rh = "水";
			break;
	}
	//(오행한글, 오행한자)
	return array($r,$rh);
}

	//갑자를 알아낸다.(천간)
	function WhatChongi($syear, $smonth, $sday){
	// 1881년의 날수와 현재까지의 날수의 차를 구해서 나머지로 날을 구한다.

		$m = array(31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 );
		$gg = array("02","03","04","05","06","07","08","09","10","01");
		
		$k11 = (int)($syear-1);

		$td2 = $k11*365 + (int)($k11/4) - (int)($k11/100) + (int)($k11/400);
	
		$temp2 = $k11*365 + (int)($k11/4) - (int)($k11/100) + (int)($k11/400);
		
		$ll = $syear%400==0 || $syear%100!=0 && $syear%4==0;
		
		if($ll){
			$m[1] = 29;
		}else{
			$m[1] = 28;
		}
		
		for($i=0; $i<$smonth-1; $i++) 
			$td2 = $td2 + (int)$m[$i];
		
		$td2 = $td2 + (int)$sday;

		$r1 = ($td2 - 686657)%10;  //천간
		$r2 = ($td2 - 686657)%12;  // 지지
		
		return array($r1,$r2);
	}

	function WhatChongi2($syear, $smonth, $sday){
	// 1881년의 날수와 현재까지의 날수의 차를 구해서 나머지로 날을 구한다.

		$m = array(31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 );
		$gg = array("02","03","04","05","06","07","08","09","10","01");
		$k11 = (int)($syear-1);

		$td2 = $k11*365 + (int)($k11/4) - (int)($k11/100) + (int)($k11/400);
	
		$temp2 = $k11*365 + (int)($k11/4) - (int)($k11/100) + (int)($k11/400);
		$ll = $syear%400==0 || $syear%100!=0 && $syear%4==0;
	
		if($ll){
			$m[1] = 29;
		}else{
			$m[1] = 28;
		}

		for($i=0; $i<$smonth-1; $i++) 
			$td2 = $td2 + (int)$m[$i];

		$td2 = $td2 + (int)$sday;

		$r1 = ($td2 - 686657)%10;  //천간
		$r2 = ($td2 - 686657)%12;  // 지지
		
		return array($r1,$r2);
	}


	//근기를 알아낸다.
	function WhatGungi($c,$g){
		global $Saju_GunGi, $Saju_GunGiHan, $Saju_GunGi2, $Saju_GunGi2Han;
		//변수가 역으로 돌아가는게 하나 더 있다.
		//자의 위치를 조정함으로서 상대좌표를 얻는다.

		switch($c){
		//갑일때
			case 9:
				$r = (($g+12) - 4) % 12;
				$v = $Saju_GunGi[$r];	
				$vh = $Saju_GunGiHan[$r];
				
				break;
		//을일때
			case 0:
				$r = ($g + 12 + 0) % 12;
				$v = $Saju_GunGi2[$r];	
				$vh = $Saju_GunGi2Han[$r];

				break;
		//병무일때
			case 1: case 3:					
				$r = (($g+12) + 5) % 12;
				$v = $Saju_GunGi[$r];	
				$vh = $Saju_GunGiHan[$r];

				break;
		//정기일때
			case 2: case 4:
				$r = ($g + 12 - 3) % 12;
				$v = $Saju_GunGi2[$r];	
				$vh = $Saju_GunGi2Han[$r];

				break;
		//경일때
			case 5:
				$r = (($g+12) + 2) % 12;
				$v = $Saju_GunGi[$r];	
				$vh = $Saju_GunGiHan[$r];

				break;
		//신일때
			case 6:
				$r = ($g + 12 + 6) % 12;
				$v = $Saju_GunGi2[$r];	
				$vh = $Saju_GunGi2Han[$r];
				break;
	
		//임일때
			case 7:
				$r = (($g+12) - 1) % 12;
				$v = $Saju_GunGi[$r];	
				$vh = $Saju_GunGiHan[$r];

				break;
		//계일때
			case 8:
				$r = ($g + 12 + 3) % 12;
				$v = $Saju_GunGi2[$r];	
				$vh = $Saju_GunGi2Han[$r];

				break;


		}
		return array($v,$vh);
	}

	//음양을 알아낸다.
	function WhatYang($v){
	//나머지가 홀수이면 양..
		if ($v%2 == 1){
			$r = "양";
			$rh = "陽";
		}else{
			$r = "음";
			$rh = "陰";
		}

		return array($r,$rh);
	}

//신살을 알아낸다.
	function WhatShinSal($yg,$g){
		global $Saju_ShinSal, $Saju_ShinSalHan;
		
		//앞에 변수는 띠지지, 뒤에게 해당 지지, 만약 년주면 앞에게 일주 지지..
		switch($yg){
			//인오술일때
			case 3: case 7: case 11:
				$r = (($g+12) - 4) % 12;
				$v = $Saju_ShinSal[$r];	
				$vh = $Saju_ShinSalHan[$r];

				break;


			//신자진일때
			case 1: case 5: case 9:
				$r = (($g+12) + 2) % 12;
				$v = $Saju_ShinSal[$r];	
				$vh = $Saju_ShinSalHan[$r];

				break;

			//사유축일때
			case 10: case 6: case 2:
				$r = (($g+12) + 5) % 12;
				$v = $Saju_ShinSal[$r];	
				$vh = $Saju_ShinSalHan[$r];

				break;
			//해묘미일때
			case 0: case 4: case 8:
				$r = (($g+12) - 1) % 12;
				$v = $Saju_ShinSal[$r];	
				$vh = $Saju_ShinSalHan[$r];

				break;


		}
		return array($v,$vh);
	}

	//사주가 신강인지 신약인지 구별.................
	function WhatShinGY($yc,$yg,$mc,$mg,$dc,$dg,$tc,$tg){
		global $Saju_OHang, $Saju_OHangHan;
	
		if ($dc == '목'){
			$GYnum = WhatGY($yc,$yg,$mc,$mg,$dc,$dg,$tc,$tg,'수');
			$on = 0;
		}else if($dc == '화'){
			$GYnum = WhatGY($yc,$yg,$mc,$mg,$dc,$dg,$tc,$tg,'목');					
			$on = 1;
		}else if($dc == '토'){
			$GYnum = WhatGY($yc,$yg,$mc,$mg,$dc,$dg,$tc,$tg,'화');					
			$on = 2;
			//echo$GYnum ;
		}else if($dc == '금'){
			$GYnum = WhatGY($yc,$yg,$mc,$mg,$dc,$dg,$tc,$tg,'토');					
			$on = 3;
		}else if($dc == '수'){
			$GYnum = WhatGY($yc,$yg,$mc,$mg,$dc,$dg,$tc,$tg,'금');					
			$on = 4;
		}

			
		if ($GYnum == '신강'){
			$yo = ($on + 5 - 4) % 5;
			$ho = ($on + 5 - 3) % 5;
		}else{
			$yo = ($on + 5 - 1) % 5;
			$ho = $on;

		}
		//신강 or 약강, 용신, 용신 한자, 희신, 희신 한자
		return array($GYnum,$Saju_OHang[$yo],$Saju_OHangHan[$yo],$Saju_OHang[$ho],$Saju_OHangHan[$ho]);
	}

	function WhatGY($yc,$yg,$mc,$mg,$dc,$dg,$tc,$tg,$dd){
		// yc 에서 tg 까지는 8주의 각 5행이며 마지막 dd는 상생 오행

		// 상극 점수 변수
		$plusN = 0;  
		$minusN = 0;

		//연주의 천간의 오행 검사
		if ($yc == $dc or $yc == $dd) $plusN++;
		else $minusN++;

		//연주의 지지 오행 검사
		if ($yg == $dc or $yg == $dd) $plusN++;
		else $minusN++;

		//월주의 천간의 오행 검사
		if ($mc == $dc or $mc == $dd){ $plusN++;
		//echo$mc;
		//echo$dc;
		//echo$dd;
		//echo$plusN;
		//echo('111');
		}else{ $minusN++;
		//echo('222');
		//echo$mc;
		//echo$dc;
		//echo$dd;
		//echo$plusN;
		}

		//월주의 지지 오행 검사
		if ($mg == $dc or $mg == $dd) $plusN += 2.5;
		else $minusN += 2.5;

		//일주의 지지 오행 검사
		if ($dg == $dc or $dg == $dd) $plusN++;
		else $minusN++;

		//시주의 천간의 오행 검사
		if ($tc == $dc or $tc == $dd) $plusN++;
		else $minusN++;

		//시주의 지지 오행 검사
		if ($tg == $dc or $tg == $dd) $plusN++;
		else $minusN++;

		if ($plusN > $minusN)
			$dap = "신강";
		else
			$dap = "신약";
		return $dap;
	}


	/*#################################################################################
		입춘날짜
	##################################################################################*/
	//입춘날짜
	$Saju_SpringDay = array("4", "4", "5", "5", "5", "4", "4", "5", "5", "4", "5",  //1900 ~ 1910
							"5", "5", "4", "5", "5", "5", "4", "4", "5", "5",      //1911 ~ 1920
							"4", "4", "5", "5", "4", "4", "5", "5", "4", "4",      //1921 ~ 1930
							"5", "5", "4", "4", "5", "5", "4", "4", "5", "5",      //1931 ~ 1940								
							"4", "4", "5", "5", "4", "4", "5", "5", "4", "4",      //1941 ~ 1950								
							"4", "4", "4", "4", "4", "5", "4", "4", "4", "5",      //1951 ~ 1950		
							"4", "4", "4", "5", "4", "4", "4", "5", "4", "4",      //1961 ~ 1970		
							"4", "5", "4", "4", "4", "5", "4", "4", "4", "5",      //1971 ~ 1980		
							"4", "4", "4", "5", "4", "4", "4", "4", "4", "4",      //1981 ~ 1990
							"4", "4", "4", "4", "4", "4", "4", "4", "4", "4",      //1991 ~ 2000
							"4", "4", "4", "4", "4", "4", "4", "4", "4", "4",      //2001 ~ 2010
							"4", "4", "4", "4", "4", "4", "4", "4", "4", "4"      //2011-2020									
							);
	//입춘의 시 (자축인묘...)(0123....)
	$Saju_SpringTime = array("7", "10", "7", "4", "7", "10", "1", "4", "7", "10", "0",  //1900 ~ 1910
							 "3", "6", "9", "0", "3", "6", "9", "0", "3", "3",      //1911 ~ 1920
							 "9", "11", "2", "5", "8", "11", "2", "5", "8", "11",      //1921 ~ 1930
							"2", "5", "7", "10", "1", "4", "7", "10", "1", "4",      //1931 ~ 1940		
							"7", "10", "1", "4", "6", "9", "0", "3", "6", "9",      //1941 ~ 1950								
							"0", "3", "6", "9", "11", "3", "5", "8", "11", "2",      //1951 ~ 1950			
							"5", "8", "11", "2", "5", "8", "11", "1", "4", "7",      //1961 ~ 1970		
							"10", "1", "4", "7", "10", "1", "4", "7", "10", "1",      //1971 ~ 1980
							"3", "6", "9", "0", "3", "6", "9", "0", "3", "6",      //1991 ~ 1990
							"8", "11", "2", "5", "8", "2", "2", "5", "7", "11",      //1991 ~ 2000
							"1", "4", "4", "10", "1", "4", "7", "11", "1", "4",      //2001 ~ 2010							
							"7", "10", "1", "3", "6", "9", "0", "3", "6", "9"      //2011-2020									
				);

	/*#################################################################################
			각 절기 날짜와 시간 (월별)
	##################################################################################*/
	$Saju_JeolGiDay0 = array(1=>6,4,6,5,6,6,8,8,8,9,8,7); //1900
	$Saju_JeolGiTime0 = array(1=>2,7,5,7,4,7,0,5,6,2,3,11); //1900
	$Saju_JeolGiDay1 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1901
	$Saju_JeolGiTime1 = array(1=>4,6,8,10,7,10,3,8,9,5,6,2); //1901
	$Saju_JeolGiDay2 = array(1=>6,5,6,6,6,7,8,8,8,9,8,8); //1902
	$Saju_JeolGiTime2 = array(1=>7,1,11,1,10,1,6,11,0,7,9,5); //1902
	$Saju_JeolGiDay3 = array(1=>6,5,7,6,7,7,8,9,9,9,8,8); //1903
	$Saju_JeolGiTime3 = array(1=>10,4,1,4,1,4,9,2,3,10,0,8); //1903
	$Saju_JeolGiDay4 = array(1=>7,5,6,5,6,6,7,8,8,9,8,7); //1904
	$Saju_JeolGiTime4 = array(1=>1,7,4,7,4,7,0,5,6,1,3,11); //1904
	$Saju_JeolGiDay5 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1905
	$Saju_JeolGiTime5 = array(1=>4,10,7,10,7,9,3,7,9,4,5,2); //1905
	$Saju_JeolGiDay6 = array(1=>6,4,6,5,6,7,8,8,8,9,8,8); //1906
	$Saju_JeolGiTime6 = array(1=>7,1,10,1,10,0,6,10,0,7,9,5); //1906
	$Saju_JeolGiDay7 = array(1=>6,5,7,6,7,7,8,9,9,9,8,9); //1907
	$Saju_JeolGiTime7 = array(1=>10,4,1,4,5,3,8,1,3,10,0,8); //1907
	$Saju_JeolGiDay8 = array(1=>7,5,6,5,6,6,7,8,8,9,8,7); //1908
	$Saju_JeolGiTime8 = array(1=>1,7,4,7,4,6,11,4,6,1,2,11); //1908
	$Saju_JeolGiDay9 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1909
	$Saju_JeolGiTime9 = array(1=>4,10,7,9,7,9,4,7,9,4,5,1); //1909
	$Saju_JeolGiDay10 = array(1=>6,5,6,6,6,6,8,8,8,9,8,8); //1910
	$Saju_JeolGiTime10 = array(1=>7,0,10,0,9,0,5,10,11,7,8,4); //1910

	$Saju_JeolGiDay11 = array(1=>6,5,7,6,6,7,8,9,9,9,8,8); //1911
	$Saju_JeolGiTime11 = array(1=>10,3,0,3,0,3,8,1,4,10,11,7); //1911			
	$Saju_JeolGiDay12 = array(1=>7,5,6,6,6,6,7,8,8,9,8,7); //1912
	$Saju_JeolGiTime12 = array(1=>1,6,3,6,3,6,11,4,5,1,2,10); //1912			
	$Saju_JeolGiDay13 = array(1=>6,4,7,5,6,6,8,8,8,9,8,8); //1913
	$Saju_JeolGiTime13 = array(1=>3,9,6,9,6,9,2,7,8,4,5,1); //1913			
	$Saju_JeolGiDay14 = array(1=>6,5,6,6,6,6,8,8,9,9,8,8); //1914
	$Saju_JeolGiTime14 = array(1=>6,0,9,6,9,11,5,10,11,7,8,4); //1914			
	$Saju_JeolGiDay15 = array(1=>6,5,7,6,7,7,8,9,9,9,8,8); //1915
	$Saju_JeolGiTime15 = array(1=>9,3,0,3,0,2,8,1,2,10,11,7); //1915			
	$Saju_JeolGiDay16 = array(1=>7,5,6,5,6,6,7,9,8,9,8,7); //1916
	$Saju_JeolGiTime16 = array(1=>0,6,3,6,3,5,11,3,5,0,2,10); //1916			
	$Saju_JeolGiDay17 = array(1=>6,4,6,5,7,6,8,8,8,9,8,8); //1917
	$Saju_JeolGiTime17 = array(1=>3,9,6,9,6,8,1,6,8,3,5,1); //1917			
	$Saju_JeolGiDay18 = array(1=>6,4,6,6,6,6,8,8,8,9,8,9); //1918
	$Saju_JeolGiTime18 = array(1=>6,0,9,0,9,11,4,9,0,6,8,4); //1918			
	$Saju_JeolGiDay19 = array(1=>6,5,7,6,6,8,8,8,9,9,8,9); //1919
	$Saju_JeolGiTime19 = array(1=>9,3,0,3,0,2,7,0,2,9,11,7); //1919			
	$Saju_JeolGiDay20 = array(1=>6,5,7,6,7,6,8,8,8,8,8,7); //1920
	$Saju_JeolGiTime20 = array(1=>0,3,3,5,3,5,10,3,4,0,1,9); //1920			

	$Saju_JeolGiDay21 = array(1=>6,4,6,6,6,6,8,8,8,9,8,8); //1921
	$Saju_JeolGiTime21 = array(1=>3,9,6,8,5,8,1,6,7,3,4,0); //1921			
	$Saju_JeolGiDay22 = array(1=>6,4,6,5,6,7,8,9,8,9,8,8); //1922
	$Saju_JeolGiTime22 = array(1=>6,11,9,11,8,11,4,9,10,6,7,3); //1922			
	$Saju_JeolGiDay23 = array(1=>6,5,6,6,6,7,8,8,9,9,8,8); //1923
	$Saju_JeolGiTime23 = array(1=>9,2,11,2,11,2,7,0,1,9,10,6); //1923			
	$Saju_JeolGiDay24 = array(1=>6,5,6,6,6,6,7,8,8,8,8,7); //1924
	$Saju_JeolGiTime24 = array(1=>0,5,3,5,2,4,10,3,0,0,1,9); //1924			
	$Saju_JeolGiDay25 = array(1=>6,4,6,5,6,6,8,8,8,9,8,7); //1925
	$Saju_JeolGiTime25 = array(1=>2,8,5,8,5,7,1,6,7,3,4,0); //1925			
	$Saju_JeolGiDay26 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1926
	$Saju_JeolGiTime26 = array(1=>5,11,8,11,8,10,3,7,10,6,7,3); //1926			
	$Saju_JeolGiDay27 = array(1=>6,5,6,6,6,7,8,8,9,9,8,8); //1927
	$Saju_JeolGiTime27 = array(1=>8,2,11,2,11,1,6,11,1,8,10,6); //1927			
	$Saju_JeolGiDay28 = array(1=>6,5,6,5,6,6,7,8,8,8,7,7); //1928
	$Saju_JeolGiTime28 = array(1=>11,5,2,5,2,4,9,2,4,11,1,9); //1928			
	$Saju_JeolGiDay29 = array(1=>6,4,4,6,6,6,9,8,8,9,8,7); //1929
	$Saju_JeolGiTime29 = array(1=>9,8,5,8,10,7,0,5,7,2,4,0); //1929			
	$Saju_JeolGiDay30 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1930
	$Saju_JeolGiTime30 = array(1=>5,11,8,11,8,10,3,8,10,5,6,3); //1930			

	$Saju_JeolGiDay31 = array(1=>6,5,6,6,6,7,8,8,9,9,8,8); //1931
	$Saju_JeolGiTime31 = array(1=>8,2,11,1,10,1,6,11,0,8,9,6); //1931			
	$Saju_JeolGiDay32 = array(1=>6,5,6,5,6,6,7,8,8,8,7,7); //1932
	$Saju_JeolGiTime32 = array(1=>7,5,2,4,1,4,9,2,9,11,0,8); //1932			
	$Saju_JeolGiDay33 = array(1=>6,4,6,5,6,6,7,8,8,9,8,7); //1933
	$Saju_JeolGiTime33 = array(1=>2,7,5,7,4,7,0,5,6,9,3,11); //1933			
	$Saju_JeolGiDay34 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1934
	$Saju_JeolGiTime34 = array(1=>5,10,7,10,7,10,3,8,9,5,6,2); //1934			
	$Saju_JeolGiDay35 = array(1=>6,5,6,6,6,7,8,8,8,9,8,8); //1935
	$Saju_JeolGiTime35 = array(1=>8,1,10,1,10,0,6,11,0,8,9,5); //1935			
	$Saju_JeolGiDay36 = array(1=>6,5,6,5,6,6,7,8,8,8,7,7); //1936
	$Saju_JeolGiTime36 = array(1=>11,4,1,4,1,3,9,2,3,11,0,8); //1936			
	$Saju_JeolGiDay37 = array(1=>6,4,6,5,6,6,7,8,8,9,8,7); //1937
	$Saju_JeolGiTime37 = array(1=>1,7,4,7,4,6,11,11,6,2,3,11); //1937			
	$Saju_JeolGiDay38 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1938
	$Saju_JeolGiTime38 = array(1=>4,10,7,10,7,9,2,7,9,6,6,2); //1938			
	$Saju_JeolGiDay39 = array(1=>6,5,6,6,6,6,8,8,8,9,8,8); //1939
	$Saju_JeolGiTime39 = array(1=>7,1,10,1,4,0,5,10,0,7,9,5); //1939			
	$Saju_JeolGiDay40= array(1=>6,5,6,5,6,6,7,8,8,8,7,7); //1940
	$Saju_JeolGiTime40 = array(1=>10,4,1,4,1,3,8,1,3,10,0,8); //1940			

	$Saju_JeolGiDay41 = array(1=>6,4,6,5,4,5,7,8,8,9,8,7); //1941
	$Saju_JeolGiTime41 = array(1=>1,7,4,7,3,3,11,4,5,1,3,11); //1941			
	$Saju_JeolGiDay42 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1942
	$Saju_JeolGiTime42 = array(1=>4,10,7,9,6,9,2,7,8,4,5,2); //1942			
	$Saju_JeolGiDay43 = array(1=>6,5,6,6,6,6,8,8,8,9,8,8); //1943
	$Saju_JeolGiTime43 = array(1=>7,1,10,0,9,0,5,10,7,7,8,5); //1943			
	$Saju_JeolGiDay44 = array(1=>6,5,6,5,6,6,7,8,8,8,7,7); //1944
	$Saju_JeolGiTime44 = array(1=>10,4,4,3,0,3,8,1,2,10,11,7); //1944			
	$Saju_JeolGiDay45 = array(1=>6,4,6,7,6,7,7,8,8,9,8,7); //1945
	$Saju_JeolGiTime45 = array(1=>1,6,11,6,3,5,11,7,5,1,7,10); //1945			
	$Saju_JeolGiDay46 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1946
	$Saju_JeolGiTime46 = array(1=>4,9,6,9,6,8,2,7,8,4,5,1); //1946			
	$Saju_JeolGiDay47 = array(1=>6,5,6,5,6,6,9,8,8,9,8,8); //1947
	$Saju_JeolGiTime47 = array(1=>7,0,9,0,9,8,4,9,11,7,8,4); //1947			
	$Saju_JeolGiDay48 = array(1=>6,5,6,5,5,6,7,8,8,8,7,7); //1948
	$Saju_JeolGiTime48 = array(1=>10,3,0,3,0,2,7,0,2,10,11,7); //1948			
	$Saju_JeolGiDay49 = array(1=>6,4,6,6,6,6,7,8,8,9,8,7); //1949
	$Saju_JeolGiTime49 = array(1=>0,6,3,6,3,5,10,3,5,0,2,3); //1949			
	$Saju_JeolGiDay50 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1950
	$Saju_JeolGiTime50 = array(1=>3,9,6,9,6,8,1,6,1,3,5,1); //1950			

	$Saju_JeolGiDay51 = array(1=>6,4,6,5,7,6,8,8,8,9,8,8); //1951
	$Saju_JeolGiTime51 = array(1=>6,0,9,0,9,11,4,9,11,6,8,4); //1951			
	$Saju_JeolGiDay52 = array(1=>6,4,5,5,5,6,7,7,8,8,7,8); //1952
	$Saju_JeolGiTime52 = array(1=>9,3,0,3,11,2,7,0,1,10,11,7); //1952			
	$Saju_JeolGiDay53 = array(1=>6,4,6,5,6,6,7,8,8,9,8,7); //1953
	$Saju_JeolGiTime53 = array(1=>0,6,3,5,2,5,10,3,4,0,2,10); //1953			
	$Saju_JeolGiDay54 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1954
	$Saju_JeolGiTime54 = array(1=>3,9,6,8,5,8,1,6,7,3,4,1); //1954			
	$Saju_JeolGiDay55 = array(1=>6,4,6,6,6,6,8,8,8,9,8,8); //1955
	$Saju_JeolGiTime55 = array(1=>3,11,11,11,8,4,4,9,10,7,1,3); //1955			
	$Saju_JeolGiDay56 = array(1=>6,5,5,5,5,6,7,7,8,8,7,7); //1956
	$Saju_JeolGiTime56 = array(1=>9,3,0,2,11,1,7,0,1,9,10,6); //1956			
	$Saju_JeolGiDay57 = array(1=>5,4,6,5,6,6,7,8,8,9,8,7); //1957
	$Saju_JeolGiTime57 = array(1=>0,5,2,2,2,4,9,2,4,0,1,9); //1957			
	$Saju_JeolGiDay58 = array(1=>6,4,6,5,6,6,8,8,8,9,8,7); //1958
	$Saju_JeolGiTime58 = array(1=>3,8,5,8,5,6,0,5,7,3,4,6); //1958			
	$Saju_JeolGiDay59 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1959
	$Saju_JeolGiTime59 = array(1=>6,11,8,11,8,10,3,8,10,6,7,3); //1959			
	$Saju_JeolGiDay60 = array(1=>6,5,5,5,5,6,7,7,8,8,7,7); //1960
	$Saju_JeolGiTime60 = array(1=>8,2,11,2,11,1,6,11,2,8,10,6); //1960			

	$Saju_JeolGiDay61 = array(1=>5,4,6,5,6,6,7,8,8,8,8,8); //1961
	$Saju_JeolGiTime61 = array(1=>11,5,2,5,2,4,9,2,4,11,1,9); //1961			
	$Saju_JeolGiDay62 = array(1=>6,4,6,5,6,6,7,8,8,9,8,7); //1962
	$Saju_JeolGiTime62 = array(1=>2,8,5,8,4,7,0,5,6,2,4,0); //1962			
	$Saju_JeolGiDay63 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1963
	$Saju_JeolGiTime63 = array(1=>5,11,8,10,7,10,3,8,9,5,7,3); //1963			
	$Saju_JeolGiDay64 = array(1=>6,5,5,5,5,6,7,7,8,8,7,7); //1964
	$Saju_JeolGiTime64 = array(1=>8,2,11,1,10,1,6,11,0,8,10,6); //1964			
	$Saju_JeolGiDay65 = array(1=>5,4,6,5,6,6,7,8,8,8,8,6); //1965
	$Saju_JeolGiTime65 = array(1=>11,5,2,4,1,3,6,2,3,11,0,9); //1965			
	$Saju_JeolGiDay66 = array(1=>6,4,6,5,6,6,7,8,8,8,8,7); //1966
	$Saju_JeolGiTime66 = array(1=>2,8,5,7,4,6,0,5,6,2,3,0); //1966			
	$Saju_JeolGiDay67 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1967
	$Saju_JeolGiTime67 = array(1=>5,11,8,10,7,9,2,2,9,5,6,2); //1967			
	$Saju_JeolGiDay68 = array(1=>6,5,5,5,5,6,7,7,7,8,7,7); //1968
	$Saju_JeolGiTime68 = array(1=>8,1,10,1,5,0,5,10,0,8,9,5); //1968			
	$Saju_JeolGiDay69 = array(1=>5,4,6,5,6,6,7,8,8,8,7,7); //1969
	$Saju_JeolGiTime69 = array(1=>11,4,1,4,1,8,8,1,3,11,0,8); //1969			
	$Saju_JeolGiDay70 = array(1=>6,4,6,5,6,6,7,8,8,9,8,7); //1970
	$Saju_JeolGiTime70 = array(1=>2,7,4,7,4,6,11,4,6,2,3,11); //1970			

	$Saju_JeolGiDay71 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1971
	$Saju_JeolGiTime71 = array(1=>5,10,7,10,7,9,2,7,9,4,6,2); //1971			
	$Saju_JeolGiDay72 = array(1=>6,5,5,5,5,5,7,7,7,8,7,8); //1972
	$Saju_JeolGiTime72 = array(1=>7,1,10,1,10,0,5,10,0,7,9,5); //1972			
	$Saju_JeolGiDay73 = array(1=>6,4,6,5,6,6,7,8,8,8,7,7); //1973
	$Saju_JeolGiTime73 = array(1=>10,4,4,4,0,3,8,1,2,10,0,8); //1973			
	$Saju_JeolGiDay74 = array(1=>7,4,6,5,6,7,7,8,8,9,8,7); //1974
	$Saju_JeolGiTime74 = array(1=>1,7,4,6,3,6,11,4,5,1,3,11); //1974			
	$Saju_JeolGiDay75 = array(1=>6,4,6,5,8,6,8,10,8,9,8,8); //1975
	$Saju_JeolGiTime75 = array(1=>4,10,7,9,6,8,2,7,8,4,6,2); //1975			
	$Saju_JeolGiDay76 = array(1=>6,5,5,5,5,5,7,7,7,8,7,7); //1976
	$Saju_JeolGiTime76 = array(1=>7,1,10,0,9,11,5,10,11,7,8,5); //1976			
	$Saju_JeolGiDay77 = array(1=>5,4,6,5,6,6,7,8,8,8,7,7); //1977
	$Saju_JeolGiTime77 = array(1=>10,4,1,3,0,2,11,1,4,10,11,8); //1977			
	$Saju_JeolGiDay78 = array(1=>6,4,6,5,6,6,8,8,8,9,8,7); //1978
	$Saju_JeolGiTime78 = array(1=>1,7,4,6,3,5,10,3,5,1,2,11); //1978			
	$Saju_JeolGiDay79 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1979
	$Saju_JeolGiTime79 = array(1=>4,10,7,9,6,8,6,6,8,4,5,1); //1979			
	$Saju_JeolGiDay80 = array(1=>6,5,5,4,5,6,7,7,7,8,7,7); //1980
	$Saju_JeolGiTime80 = array(1=>7,1,9,0,9,11,4,9,11,7,8,4); //1980			

	$Saju_JeolGiDay81 = array(1=>5,4,6,5,5,6,7,8,8,8,7,7); //1981
	$Saju_JeolGiTime81 = array(1=>10,3,0,3,0,2,7,0,2,10,11,7); //1981			
	$Saju_JeolGiDay82 = array(1=>6,4,6,5,6,5,7,8,8,9,8,7); //1982
	$Saju_JeolGiTime82 = array(1=>1,6,3,6,3,5,10,3,5,0,2,10); //1982			
	$Saju_JeolGiDay83 = array(1=>6,4,6,5,7,6,8,8,8,9,8,8); //1983
	$Saju_JeolGiTime83 = array(1=>4,9,6,9,5,8,1,6,7,3,5,6); //1983			
	$Saju_JeolGiDay84 = array(1=>6,5,5,4,5,5,6,7,6,8,7,7); //1984
	$Saju_JeolGiTime84 = array(1=>6,0,9,0,9,11,4,9,10,6,8,4); //1984			
	$Saju_JeolGiDay85 = array(1=>5,4,6,5,5,7,7,7,8,8,7,7); //1985
	$Saju_JeolGiTime85 = array(1=>9,3,0,2,11,1,7,0,1,9,11,7); //1985			
	$Saju_JeolGiDay86 = array(1=>6,4,6,5,6,6,7,8,8,9,8,7); //1986
	$Saju_JeolGiTime86 = array(1=>0,6,3,5,2,4,10,3,4,0,2,10); //1986			
	$Saju_JeolGiDay87 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1987
	$Saju_JeolGiTime87 = array(1=>3,9,6,8,5,7,1,6,7,3,5,1); //1987			
	$Saju_JeolGiDay88 = array(1=>6,4,5,4,5,5,7,7,7,8,7,7); //1988
	$Saju_JeolGiTime88 = array(1=>6,0,9,11,8,10,3,8,10,6,7,4); //1988			
	$Saju_JeolGiDay89 = array(1=>5,4,5,5,5,6,7,7,8,8,7,7); //1989
	$Saju_JeolGiTime89 = array(1=>9,3,0,2,11,1,6,11,1,9,10,7); //1989			
	$Saju_JeolGiDay90 = array(1=>5,4,6,5,6,6,7,8,8,8,8,7); //1990
	$Saju_JeolGiTime90 = array(1=>0,6,3,5,2,4,9,2,4,0,1,10); //1990			

	$Saju_JeolGiDay91 = array(1=>6,4,6,5,6,6,8,8,8,9,8,8); //1991
	$Saju_JeolGiTime91 = array(1=>3,8,5,8,4,7,0,5,0,2,4,0); //1991			
	$Saju_JeolGiDay92 = array(1=>6,4,5,3,5,5,7,7,8,8,7,7); //1992
	$Saju_JeolGiTime92 = array(1=>5,11,8,10,7,9,3,8,9,5,7,3); //1992			
	$Saju_JeolGiDay93 = array(1=>5,4,5,5,5,7,6,7,8,8,7,7); //1993
	$Saju_JeolGiTime93 = array(1=>8,2,11,1,10,0,6,7,0,9,10,6); //1993			
	$Saju_JeolGiDay94 = array(1=>5,4,6,6,6,6,7,8,8,8,8,7); //1994
	$Saju_JeolGiTime94 = array(1=>11,5,2,2,1,3,8,1,3,11,1,9); //1994			
	$Saju_JeolGiDay95 = array(1=>5,4,6,5,6,6,7,8,9,9,8,8); //1995
	$Saju_JeolGiTime95 = array(1=>2,8,5,7,4,6,11,4,0,3,3,0); //1995			
	$Saju_JeolGiDay96 = array(1=>6,4,5,4,5,5,7,7,7,8,7,7); //1996
	$Saju_JeolGiTime96 = array(1=>5,2,8,10,7,9,2,7,9,5,0,6); //1996			
	$Saju_JeolGiDay97 = array(1=>5,4,5,5,5,6,7,7,8,8,7,7); //1997
	$Saju_JeolGiTime97 = array(1=>8,2,11,1,10,0,5,10,0,8,9,6); //1997			
	$Saju_JeolGiDay98 = array(1=>6,4,6,5,6,6,7,8,8,8,7,7); //1998
	$Saju_JeolGiTime98 = array(1=>0,5,1,4,1,3,8,1,3,11,0,8); //1998			
	$Saju_JeolGiDay99 = array(1=>6,4,6,5,6,6,7,8,8,9,8,7); //1999
	$Saju_JeolGiTime99 = array(1=>2,7,4,8,4,6,11,3,6,2,3,11); //1999			
	$Saju_JeolGiDay100 = array(1=>6,4,5,4,5,5,7,7,7,8,7,7); //2000
	$Saju_JeolGiTime100 = array(1=>5,11,7,10,6,9,2,8,9,5,6,2); //2000			

	$Saju_JeolGiDay101 = array(1=>5,4,5,5,6,6,7,7,7,8,7,7); //2001
	$Saju_JeolGiTime101 = array(1=>2,1,10,1,0,0,5,10,11,7,9,5); //2001			
	$Saju_JeolGiDay102 = array(1=>5,4,6,5,6,6,7,8,8,8,7,7); //2002
	$Saju_JeolGiTime102 = array(1=>11,4,2,4,3,3,8,1,3,11,0,8); //2002			
	$Saju_JeolGiDay103 = array(1=>6,4,6,5,6,6,7,7,8,8,7,7); //2003
	$Saju_JeolGiTime103 = array(1=>2,4,7,7,4,6,11,4,6,2,3,11); //2003			
	$Saju_JeolGiDay104 = array(1=>6,4,5,4,5,5,7,7,7,8,7,8); //2004
	$Saju_JeolGiTime104 = array(1=>5,10,7,10,6,9,2,7,8,4,8,2); //2004			
	$Saju_JeolGiDay105 = array(1=>5,4,5,5,5,5,7,7,7,8,7,7); //2005
	$Saju_JeolGiTime105 = array(1=>8,1,10,1,9,11,5,10,11,7,9,5); //2005			
	$Saju_JeolGiDay106 = array(1=>5,4,6,5,6,6,7,8,8,8,8,7); //2006
	$Saju_JeolGiTime106 = array(1=>11,4,1,1,0,2,8,9,9,10,0,8); //2006			
	$Saju_JeolGiDay107 = array(1=>6,4,6,5,6,6,7,8,8,9,8,8); //2007
	$Saju_JeolGiTime107 = array(1=>1,7,4,0,3,5,10,3,5,1,2,11); //2007			
	$Saju_JeolGiDay108 = array(1=>6,4,5,4,6,5,7,7,7,8,7,7); //2008
	$Saju_JeolGiTime108 = array(1=>4,11,7,10,6,6,1,0,8,4,5,2); //2008			
	$Saju_JeolGiDay109 = array(1=>5,4,5,5,5,5,7,7,7,8,7,7); //2009
	$Saju_JeolGiTime109 = array(1=>7,1,10,0,0,11,1,9,11,6,9,4); //2009			
	$Saju_JeolGiDay110 = array(1=>5,4,6,6,5,6,7,7,8,8,7,7); //2010
	$Saju_JeolGiTime110 = array(1=>10,4,1,3,0,2,7,0,1,9,11,7); //2010			

	$Saju_JeolGiDay111 = array(1=>6,4,6,5,6,6,7,8,8,9,8,7); //2011
	$Saju_JeolGiTime111 = array(1=>1,7,4,6,3,5,10,10,4,0,2,10); //2011			
	$Saju_JeolGiDay112 = array(1=>6,4,5,4,5,5,7,7,7,8,7,7); //2012
	$Saju_JeolGiTime112 = array(1=>4,10,7,9,6,8,1,6,7,3,5,1); //2012			
	$Saju_JeolGiDay113 = array(1=>5,4,5,4,5,5,7,7,7,8,7,7); //2013
	$Saju_JeolGiTime113 = array(1=>7,1,9,0,8,11,4,9,10,6,8,4); //2013			
	$Saju_JeolGiDay114 = array(1=>5,4,6,5,5,6,7,7,8,8,7,7); //2014
	$Saju_JeolGiTime114 = array(1=>10,3,0,3,11,1,7,0,1,9,11,7); //2014			
	$Saju_JeolGiDay115 = array(1=>6,4,6,5,6,6,6,8,8,8,8,7); //2015
	$Saju_JeolGiTime115 = array(1=>1,6,3,6,2,4,10,2,4,0,1,10); //2015			
	$Saju_JeolGiDay116 = array(1=>6,4,5,4,5,5,7,7,7,8,6,7); //2016
	$Saju_JeolGiTime116 = array(1=>3,9,7,9,5,7,0,5,7,3,4,1); //2016			
	$Saju_JeolGiDay117 = array(1=>5,4,5,4,5,5,7,7,7,6,7,7); //2017
	$Saju_JeolGiTime117 = array(1=>6,0,9,9,8,10,3,8,10,6,7,4); //2017			
	$Saju_JeolGiDay118 = array(1=>5,4,6,5,5,6,7,7,8,8,7,7); //2018
	$Saju_JeolGiTime118 = array(1=>9,3,0,2,11,1,6,11,6,6,10,7); //2018			
	$Saju_JeolGiDay119 = array(1=>6,4,6,5,6,6,7,8,8,8,8,7); //2019
	$Saju_JeolGiTime119 = array(1=>0,6,3,5,2,4,9,2,4,11,1,10); //2019			
	$Saju_JeolGiDay120 = array(1=>6,4,5,4,5,5,6,7,7,8,7,7); //2020
	$Saju_JeolGiTime120 = array(1=>3,9,6,8,5,7,0,5,6,2,4,0); //2020			

	$Saju_JeolGiDay = array($Saju_JeolGiDay0,$Saju_JeolGiDay1,$Saju_JeolGiDay2,$Saju_JeolGiDay3,$Saju_JeolGiDay4,$Saju_JeolGiDay5,
	$Saju_JeolGiDay6,$Saju_JeolGiDay7,$Saju_JeolGiDay8,$Saju_JeolGiDay9,$Saju_JeolGiDay10,
	$Saju_JeolGiDay11,$Saju_JeolGiDay12,$Saju_JeolGiDay13,$Saju_JeolGiDay14,$Saju_JeolGiDay15,
	$Saju_JeolGiDay16,$Saju_JeolGiDay17,$Saju_JeolGiDay18,$Saju_JeolGiDay19,$Saju_JeolGiDay20,
	$Saju_JeolGiDay21,$Saju_JeolGiDay22,$Saju_JeolGiDay23,$Saju_JeolGiDay24,$Saju_JeolGiDay25,
	$Saju_JeolGiDay26,$Saju_JeolGiDay27,$Saju_JeolGiDay28,$Saju_JeolGiDay29,$Saju_JeolGiDay30,
	$Saju_JeolGiDay31,$Saju_JeolGiDay32,$Saju_JeolGiDay33,$Saju_JeolGiDay34,$Saju_JeolGiDay35,
	$Saju_JeolGiDay36,$Saju_JeolGiDay37,$Saju_JeolGiDay38,$Saju_JeolGiDay39,$Saju_JeolGiDay40,
	$Saju_JeolGiDay41,$Saju_JeolGiDay42,$Saju_JeolGiDay43,$Saju_JeolGiDay44,$Saju_JeolGiDay45,
	$Saju_JeolGiDay46,$Saju_JeolGiDay47,$Saju_JeolGiDay48,$Saju_JeolGiDay49,$Saju_JeolGiDay50,
	$Saju_JeolGiDay51,$Saju_JeolGiDay52,$Saju_JeolGiDay53,$Saju_JeolGiDay54,$Saju_JeolGiDay55,
	$Saju_JeolGiDay56,$Saju_JeolGiDay57,$Saju_JeolGiDay58,$Saju_JeolGiDay59,$Saju_JeolGiDay60,
	$Saju_JeolGiDay61,$Saju_JeolGiDay62,$Saju_JeolGiDay63,$Saju_JeolGiDay64,$Saju_JeolGiDay65,
	$Saju_JeolGiDay66,$Saju_JeolGiDay67,$Saju_JeolGiDay68,$Saju_JeolGiDay69,$Saju_JeolGiDay70,
	$Saju_JeolGiDay71,$Saju_JeolGiDay72,$Saju_JeolGiDay73,$Saju_JeolGiDay74,$Saju_JeolGiDay75,
	$Saju_JeolGiDay76,$Saju_JeolGiDay77,$Saju_JeolGiDay78,$Saju_JeolGiDay79,$Saju_JeolGiDay80,
	$Saju_JeolGiDay81,$Saju_JeolGiDay82,$Saju_JeolGiDay83,$Saju_JeolGiDay84,$Saju_JeolGiDay85,
	$Saju_JeolGiDay86,$Saju_JeolGiDay87,$Saju_JeolGiDay88,$Saju_JeolGiDay89,$Saju_JeolGiDay90,
	$Saju_JeolGiDay91,$Saju_JeolGiDay92,$Saju_JeolGiDay93,$Saju_JeolGiDay94,$Saju_JeolGiDay95,
	$Saju_JeolGiDay96,$Saju_JeolGiDay97,$Saju_JeolGiDay98,$Saju_JeolGiDay99,$Saju_JeolGiDay100,
	$Saju_JeolGiDay101,$Saju_JeolGiDay102,$Saju_JeolGiDay103,$Saju_JeolGiDay104,$Saju_JeolGiDay105,
	$Saju_JeolGiDay106,$Saju_JeolGiDay107,$Saju_JeolGiDay108,$Saju_JeolGiDay109,$Saju_JeolGiDay110,
	$Saju_JeolGiDay111,$Saju_JeolGiDay112,$Saju_JeolGiDay113,$Saju_JeolGiDay114,$Saju_JeolGiDay115,
	$Saju_JeolGiDay116,$Saju_JeolGiDay117,$Saju_JeolGiDay118,$Saju_JeolGiDay119,$Saju_JeolGiDay120
	);

	$Saju_JeolGiTime = array($Saju_JeolGiTime0,$Saju_JeolGiTime1,$Saju_JeolGiTime2,$Saju_JeolGiTime3,$Saju_JeolGiTime4,
	$Saju_JeolGiTime5, $Saju_JeolGiTime6,$Saju_JeolGiTime7,$Saju_JeolGiTime8,$Saju_JeolGiTime9,$Saju_JeolGiTime10,
	$Saju_JeolGiTime11,$Saju_JeolGiTime12,$Saju_JeolGiTime13,$Saju_JeolGiTime14,$Saju_JeolGiTime15, 
	$Saju_JeolGiTime16,$Saju_JeolGiTime17,$Saju_JeolGiTime18,$Saju_JeolGiTime19,$Saju_JeolGiTime20,
	$Saju_JeolGiTime21,$Saju_JeolGiTime22,$Saju_JeolGiTime23,$Saju_JeolGiTime24,$Saju_JeolGiTime25, 
	$Saju_JeolGiTime26,$Saju_JeolGiTime27,$Saju_JeolGiTime28,$Saju_JeolGiTime29,$Saju_JeolGiTime30,
	$Saju_JeolGiTime31,$Saju_JeolGiTime32,$Saju_JeolGiTime33,$Saju_JeolGiTime34,$Saju_JeolGiTime35, 
	$Saju_JeolGiTime36,$Saju_JeolGiTime37,$Saju_JeolGiTime38,$Saju_JeolGiTime39,$Saju_JeolGiTime40,
	$Saju_JeolGiTime41,$Saju_JeolGiTime42,$Saju_JeolGiTime43,$Saju_JeolGiTime44,$Saju_JeolGiTime45, 
	$Saju_JeolGiTime46,$Saju_JeolGiTime47,$Saju_JeolGiTime48,$Saju_JeolGiTime49,$Saju_JeolGiTime50,
	$Saju_JeolGiTime51,$Saju_JeolGiTime52,$Saju_JeolGiTime53,$Saju_JeolGiTime54,$Saju_JeolGiTime55, 
	$Saju_JeolGiTime56,$Saju_JeolGiTime57,$Saju_JeolGiTime58,$Saju_JeolGiTime59,$Saju_JeolGiTime60,
	$Saju_JeolGiTime61,$Saju_JeolGiTime62,$Saju_JeolGiTime63,$Saju_JeolGiTime64,$Saju_JeolGiTime65, 
	$Saju_JeolGiTime66,$Saju_JeolGiTime67,$Saju_JeolGiTime68,$Saju_JeolGiTime69,$Saju_JeolGiTime70,
	$Saju_JeolGiTime71,$Saju_JeolGiTime72,$Saju_JeolGiTime73,$Saju_JeolGiTime74,$Saju_JeolGiTime75, 
	$Saju_JeolGiTime76,$Saju_JeolGiTime77,$Saju_JeolGiTime78,$Saju_JeolGiTime79,$Saju_JeolGiTime80,
	$Saju_JeolGiTime81,$Saju_JeolGiTime82,$Saju_JeolGiTime83,$Saju_JeolGiTime84,$Saju_JeolGiTime85, 
	$Saju_JeolGiTime86,$Saju_JeolGiTime87,$Saju_JeolGiTime88,$Saju_JeolGiTime89,$Saju_JeolGiTime90,
	$Saju_JeolGiTime91,$Saju_JeolGiTime92,$Saju_JeolGiTime93,$Saju_JeolGiTime94,$Saju_JeolGiTime95, 
	$Saju_JeolGiTime96,$Saju_JeolGiTime97,$Saju_JeolGiTime98,$Saju_JeolGiTime99,$Saju_JeolGiTime100,
	$Saju_JeolGiTime101,$Saju_JeolGiTime102,$Saju_JeolGiTime103,$Saju_JeolGiTime104,$Saju_JeolGiTime105, 
	$Saju_JeolGiTime106,$Saju_JeolGiTime107,$Saju_JeolGiTime108,$Saju_JeolGiTime109,$Saju_JeolGiTime110,
	$Saju_JeolGiTime111,$Saju_JeolGiTime112,$Saju_JeolGiTime113,$Saju_JeolGiTime114,$Saju_JeolGiTime115, 
	$Saju_JeolGiTime116,$Saju_JeolGiTime117,$Saju_JeolGiTime118,$Saju_JeolGiTime119,$Saju_JeolGiTime120
	);



/*############################################################################################################
대운의 숫자를 구함
##############################################################################################################*/		

function BigFortuneNum($a, $b, $y, $m, $d){  //성별, 년간지음양,
	global $Saju_JeolGiDay;

	$bd = "$y-$m-$d"; //태어난 날짜
	$bfn = $Saju_JeolGiDay[$y%100][$m]; //달의 절기날짜

	$beforeDay = my_mktime(0,0,0,$m-1,$d,$y); //태어난 날짜에서 한달전
	$beforeY = (int)date("Y", $beforeDay);       //태어난 날짜에서 한달전 해..
	$beforeM = (int)date("m", $beforeDay);       //태어난 날짜에서 한달전 달..
	$beforeNum = $Saju_JeolGiDay[$beforeY%100][$beforeM]; //지난달의 절기날짜

	$nextDay = my_mktime(0,0,0,$m+1,$d,$y); //태어난 날짜에서 한달후
	$nextY = (int)date('Y', $nextDay);       //태어난 날짜에서 한달후 해..
	$nextM = (int)date('m', $nextDay);       //태어난 날짜에서 한달후 달..
	$nextNum = $Saju_JeolGiDay[$nextY%100][$nextM]; //담달의 절기날짜

	if( ($a=='m' && $b == '양') || ($a=='f' && $b == '음')){ // 남자가 양이고 여자가 음일때.. 순행

		if ($d > $bfn){ //달의 절기날짜가 태어난 일보다 작으면.. 담달 절기날짜를 구한다.
			$dap = diffDay( $y, $m, $d, $nextY, $nextM, $nextNum);
		}else if($d == $bfn){  //절기날짜랑 같으면
			$dap = 1;
		}else{
			$dap = diffDay($y, $m, $d, $y, $m, $bfn);							
		}
	}else{ // 남자가 음이고 여자가 양일때.. 역행

		if ($d < $bfn){ //달의 절기날짜가 태어난 일보다 더 크면.. 저번달 절기날짜를 구한다.
			$dap = diffDay($beforeY, $beforeM, $beforeNum, $y, $m, $d);							
		}else if($d == $bfn){  //절기날짜랑 같으면
			$dap = 1;
		}else{
			$dap = diffDay($y, $m, $bfn, $y, $m, $d);
		}
	}

	$dap = (int)(($dap + 1)/3);

	if ($dap == 0) $dap = 1;  //0이면 1로 설정..

	return $dap;
}


function diffDay($bY, $bM, $bD, $nY, $nM, $nD){ // 비교할 전의날짜, 후의 날짜,
	$end = my_mktime(0, 0, 0, $nM, $nD, $nY); 

	$start = my_mktime(0, 0, 0, $bM, $bD, $bY);

	return ($end - $start) / 86400 + 1;
}


function is_leaf_year($year) {
	$year = year_digit_check($year);

	if ($year % 400 == 0)
		return true;
	elseif ($year % 100 == 0)
		return false;
	elseif ($year % 4 == 0)
		return true;
	else
		return false;
}

function year_digit_check ($year) {
	if ($year < 100) {
		if ($year < 70)
			$year = $year + 2000;
		else
			$year = $year + 1900;
	}

	return $year;
}

function get_gmt_different() {
	$result = mktime(0,0,0,1970,1,1);
	$result2 = gmmktime(0,0,0,1970,1,1);

	return $result - $result2;
}

function my_mktime($hr,$min,$sec,$mon,$day,$year) {
	$gmt_different = get_gmt_different();

	$hr = intval($hr);
	$min = intval($min);
	$sec = intval($sec);
	$mon = intval($mon);
	$day = intval($day);
	$year = intval($year);

	$year = year_digit_check($year);

	$_day_power = 86400;
	$_hour_power = 3600;
	$_min_power = 60;

	$_month_table_normal = array("",31,28,31,30,31,30,31,31,30,31,30,31);
	$_month_table_leaf = array("",31,29,31,30,31,30,31,31,30,31,30,31);

	$_total_date = 0;

	if ($year >= 1970) {
		for ($a = 1970; $a <= $year; $a++) {
			$leaf = is_leaf_year($a);

			if ($leaf == true) {
				$loop_table = $_month_table_leaf;
				$_add_date = 366;
			} else {
				$loop_table = $_month_table_normal;
				$_add_date = 365;
			}

			if ($a < $year)
				$_total_date += $_add_date;
			else {
				for($b=1;$b<$mon;$b++)
					$_total_date += $loop_table[$b];
			}
		}

		$_total_date +=$day-1;

		return $_total_date * $_day_power + $hr * $_hour_power + $min * $_min_power + $sec + $gmt_different;
	}
	else {
		for ($a = 1969 ; $a >= $year; $a--) {
			$leaf = is_leaf_year($a);

			if ($leaf == true) {
				$loop_table = $_month_table_leaf;
				$_add_date = 366;
			} else {
				$loop_table = $_month_table_normal;
				$_add_date = 365;
			}

			if ($a > $year) {
				$_total_date += $_add_date;
			} else {
				for($b=12;$b>$mon;$b--) {
				$_total_date += $loop_table[$b];
			}
		}
	}

	$_total_date += $loop_table[$mon] - $day;

	$_day_time = $hr * $_hour_power + $min * $_min_power + $sec;
	$_day_time = $_day_power - $_day_time;

	return -( $_total_date * $_day_power + $_day_time - $gmt_different);
	}
}
?>